"/r/Conservative Official Political Discord"
"A Message from Mod About Flair"
"California Gov Newsom busted attending large dinner party against his own advice"
"Democrats will never stop calling conservatives Nazis. Ever."
"Limbaugh Accuses Fox News of Abandoning its Base -- 'You Don’t Turn on the People Who Got You Where You Are'"
"GOP Flips 12 House Seats So Far…"
"CNN Compares The Trump Administration To Genocidal Nazi Germany"
"Pollster: It's Curious How Biden Underperformed Hillary Clinton In Every City...Except These Four: Milwaukee, Detroit, Atlanta and Philadelphia."
"Israeli agents killed Al Qaeda's No. 2 official on street in Iran: report"
"Kristi Noem fires back at former president Obama over his characterization of America in his forthcoming memoir"
"Grammy-winning artist Erykah Badu tests positive for COVID-19 in left nostril, negative in right. “No symptoms. Was tested for COVID. Same machine. Left nostril positive. Right nostril negative,” she tweeted."
"MSNBC’s exodus to work for Joe Biden shows it’s been shilling for him all along"
"Voting Software Company WHISTLEBLOWERS Come Forward; Claim Their Software Changed 3.8 MILLION Votes - Stole Election."
"Blue State Blues: Republicans Need to Be Ruthless in Georgia"
"Republican Young Kim takes down Democrat in California House rematch"
"Democratic senators warned of potential 'vote switching' by Dominion voting machines prior to 2020 election"
"Republican Burgess Owens Defeats Democrat Rep. Ben McAdams in Utah"
"The Whistleblowers Against Electoral Fraud are Emerging"
"Justice Alito Slams Dem Lockdowns, Says COVID Has Caused 'Unimaginable Restrictions On Liberty'"
"Rep. Louie Gohmert, (R-TX): Foreign company had evidence of 'vote switching' -- Server 'seized' by U.S. Army forces after he gave information to President Trump"
"According to The New York Times, potentially 90 percent of those who have tested positive for COVID-19 have such insignificant amounts of the virus present in their bodies that such individuals do not need to isolate. \"Most of these people are not likely to be contagious\""
"Florida Republicans win recount, flip key Senate seat in Miami"
"Fox’s Wallace: Trump Can’t ‘Credibly’ Say the Election Was Taken from Him — No ‘Serious Fraud’"
"An MRC study finds that 4.6% of Joe Biden voters would NOT have voted for him had they known about the Biden family's corrupt business dealings."
"The Law is Clear: If An Election is Stolen, State Legislatures Can Restore The Will of The People"
"Wisconsin lawsuit seeks to toss 800,00 ballots -- Biden leads by 20,000 votes in state"
"Trump Tweet: Our election was hijacked. There is no question. Congress has a duty to #ProtectOurDemocracy &amp; #FollowTheFacts.... oh, wait, that was Nancy Pelosi in 2017."
"BREAKING: President Trump Makes Surprise Appearance As Thousands March In DC To Show Their Support For Him…#MarchForTrump"
"Mississippi governor says his state won't participate in a potential national lockdown, promises to fight it"
"Retiring diplomat says defense officials misled Trump on troop count in Syria"
"Man Who Believes He's On The Right Side Of History Announces Crackdown On The Jews"
"Kamala Harris Proposes Housing Plan Where Everybody Gets Free 10'x10' Room And Three Meals A Day"
"Law Firm That Dropped Trump Advises CCP-Linked Firms, Aided In Outsourcing U.S. Jobs To China"
"Milwaukee Elections Head Misplaced Crucial Voting Flash Drive"
"Media's hiding of Hunter Biden scandal robbed Trump of clear win: Poll"
"Brit Actor Dropped by His Agency for Saying It's Racist to Call Him \"White Privileged\""
"President Trump wins North Carolina, hits 232 electoral votes"
"STUNNING TESTIMONY: Michigan Election Observer Shane Trejo Witnessed Drivers Bring in 50 Boxes of “Absentee Ballots” After Midnight Deadline into Detroit TCF Center at 3:30am"
"Liberal cities fail to provide upward mobility"
"James Woods Finds That One Word That Should Not Be Said (\"Dominion\"), and Yes, Even Dems Questioned Voting System Issues"
"Thousands flock to DC for pro-Trump rally"
"Commentary: Building a New, Less Cowardly Republican Party"
"Three Wisconsin Voters Band Together, File Election Lawsuit That Could Give Trump An Easy Win"
"Journalist Glenn Greenwald Rips 'The Most Pathological Liar' in Politics and Other Dems for Burying Hunter Biden Fiasco"
"Chuck Schumer: ‘Republicans in Congress Are Spreading Conspiracy Theories’"
"Last December, Sen. Warren (D) helped pen a letter to HIG Capital, talking about how they and Dominion provide the majority of voting machines. Included in that letter are claims of vote-switching and many irregularities. Hmm..."
"California Democrat Governor Gavin Newsom Caught Attending Multi-Family Gathering That He Has Advised Against: Report | The Daily Wire"
"Democrats Need Joe Manchin More Than They Need AOC"
"South Dakota Gov. Kristi Noem won't comply if Biden pursues national mask mandate"
"HHS Secretary: Science, Data, Facts 'Do Not Support the Notion of Locking Down the Country'"
"Dick Morris: Georgia Recount 'a Sham and a Hoax and a Fix'"
"Hillary Clinton Supporter Alan Dershowitz: 'Trump Will Win the Pennsylvania Lawsuit'"
"Trump Team to Call Million Plus Voters about Anomalies in 6 Contested States. “We’re calling them to confirm whether or not they actually cast the ballot, or if that ballot was cast by somebody else in their name”"
"Elon Musk Tests Positive, Negative, Positive, Negative All in One Day, But MSNBC Producer Doesn't Think He Should Have Told You"
"This is disturbing. Facebook removed the title of “President” from Donald Trump and designated him as “Political Candidate.” Trump is still president and, no matter what happens, will remain so until Inauguration Day"
"Steven Crowder Surpasses ‘The Young Turks’ As Largest Online News Channel | The Daily Wire"
"Plan B? Trump could receive second term from U.S. House in 'contingent election'"
"Dejected Democrats regroup after Texas eludes them — again"
"How the Armenian Genocide’s Legacy Explains a Conflict on Pause -- For far too long, the West has turned a blind eye to Turkey’s egregious behavior."
"If Media Didn't Think Trump Could Win, It Wouldn't be Targeting his Lawyers"
"Thanksgiving is canceled, schools are closed but Nancy Pelosi's big indoor dinner for new House members is totally safe"
"CNN calls Parler a \"threat to Democracy\""
"Trump drives by supporters at DC march"
"Challenging 2020 also brings major jump in Chicago carjackings"
"President Trump Drives by Supporters in DC for 'Million MAGA March'. 'Chants of “USA! USA!” “We want Trump! We want Trump!” and “Four more years! Four more years!” could be heard.'"
"If All the Fraud Is Uncovered, Trump Will Win -- How do we know? The people who tried to pull off this election heist are drawn from the same swamp as the conspirators in the Russia hoax."
"South Dakota Gov. Kristi Noem Wouldn’t Enforce a Biden National Lockdown"
"Twitter Fact-Checks Harry Potter's Claim That Voldemort has Returned"
"Unhinged Analyst Furious With Parler Success Links Dan Bongino to Russian Disinformation"
"Pence: We're fighting to protect election ballot integrity -- And also \"about preserving what we have accomplished and have yet to do, and it's all about preventing the other side from undoing all the progress that we've made in making America great again.\""
"Democrats Lament Failure to Turn Texas Blue: 'What the F*ck Is Happening?'"
"Trump said the vaccine will be available to everyone by April -- except residents in New York state where the governor has decided not to “for political reasons.”"
"Elon Musk took 4 COVID tests in one day: receives 2 positives, 2 negatives"
"A major flaw has been found in Switzerland’s online voting system - SCYTL"
"As COVID-19 Threatens Further Lockdowns, One Portland Bar Owner Promises Civil Disobedience"
"Twitter in 1615 A.D."
"Trump talks post-election fight: Trump says he's confident he will win the states needed to get to 270 electoral votes, \"Never bet against me.\""
"AOC gets the hype, but Joe Manchin’s approach is the winner for the Democratic Party"
"Nevada: GOP Poll Watchers Say They Were Forced to Leave Election Center"
"Trump wins North Carolina"
"Colorado man wins lottery, misses deadline to turn in ticket by 3 days, loses all the money"
"Obama's WH Physician Issues Brutal Statement on Biden's Mental Health."
"Gambling sites refuse to call election for Biden, leaving $600 million in limbo"
"Growing Support for Election Audit"
"Watch: fox lou dobbs sydney powell interview on dominion systems"
"Trump got more NYC votes in 2020 — including in the South Bronx"
"Alito: Senators' Threats In 2A Case \"Affront To The Constitution\""
"Utah U.S. House 2020 Election Live Results | RealClearPolitics Calls Race For Burgess Owens in 4th Congressional District"
"Women and Minorities Lead the GOP’s Freshman Class"
"Google Used Power to Shift Millions of Votes Through Targeted Messaging: Researcher."
"Senior Administration Officials Lied To Trump About Troop Levels So He Wouldn’t Pull Out Of Syria"
"Lori Lightfoot tells constituents to cancel Thanksgiving DAYS after celebrating in crowded Chicago streets"
"Long-term unemployment is on the rise, economists and social scientists worry"
"Target Removes Book Critical Of Trans Agenda After Customer Complains Online; Book Shoots To Top 100 On Amazon"
"Alito Rightly Slams Five Democratic Senators for 'Bullying' the Supreme Court. The senators warned that the Court might have to be \"restructured\" if it did not reach the conclusion they preferred in a Second Amendment case."
"REMINDER: Tomorrow the Million MAGA March Will Try To #StopTheSteal -- Marchers will gather at noon at Freedom Plaza to march to the Supreme Court."
"Alan Dershowitz Predicts Trump SCOTUS Win in Pennsylvania Ballot Case"
"Classroom Busybodies Ban a ‘Jesus Loves Me’ Mask"
"Officials in Georgia have not been able to produce any invoices or work orders related to a “burst pipe” at Atlanta’s State Farm Arena that was blamed for an abrupt pause in vote counting on election night."
"Trump puts Giuliani in charge of election lawsuits: report"
"‘Utterly Detestable’: John Legend Says To Direct Donations To Democrats Instead Of Food Banks, Gets Ripped Online | The Daily Wire"
"Poll: Media's hiding of Hunter Biden scandal robbed Trump of clear win"
"Did The US Raid European Software Company Scytl And Seize Their Servers In Germany? — Our Intel Source Says YES, IT HAPPENED!"
"Al-Qaeda’s No. 2 Leader Was Killed In Iran By Israeli Assassins At Behest Of U.S.: Report | The Daily Wire"
"Memo: New Defense chief signals potential troop drawdown: 'All wars must end'"
"Former Reddit CEO Wants Trump SIlenced Online to Stop ‘A Coup’"
"Dominion Machines Cover Millions Of Voters, BUT WATCH HOW EASY IT IS TO RIG ONE OF THEM"
"Burgess Owens(R) grows lead over Incumbent Rep. Ben McAdams in 4th Congressional District race"
"Gov. Newsom says he shouldn't have attended birthday party at French Laundry amid COVID-19 surge"
"AOC Says She Plans To Work ‘Very Hard’ On Georgia Runoffs – State Dems Say Please Stay Away"
"In January, Socialism Is on the Ballot in Georgia"
"WH Rips Post-Election Timing on Vaccine: 'It Is a Scandal'"
"US election: Text messages cast doubt on Georgia officials’ ‘burst pipe’ excuse for pause in ballot counting."
"Events list for #StopTheSteal.US"
"Right thinkers abandon Twitter for Parler and Rumble"
"Boston Voter: Rallies Necessary to Counter Social Media Censorship"
"Ronald Reagan Last Stand on Earth Quote"
"How President Trump Surprised 'Million MAGA March' Participants"
"Newsom apologizes for breaking own COVID-19 rules"
"Democratic congresswoman compliments way Trump 'doesn't talk down to people' unlike some 'woke' Democrats"
"Kyle Rittenhouse's Mother Tears Into Joe Biden for Smearing Her Son as a White Supremacist"
"A dark look into Biden's America: Norway criminalizes private criticism of LGTBQ people"
"‘Critical race theory is the ideology of the bureaucracy’"
"Jon Voight Condemns the 'Lie' of a Biden Win Amid America's 'Battle of Righteousness Versus Satan' -- Who would’ve ever guessed one of the biggest supporters of the Republican Commander-in-Chief would be…Brad Pitt’s father-in-law?"
"Democratic governors in New Mexico, Oregon order Thanksgiving shutdowns"
"Biden Says He Is Considering Adding Metamucil To His Cabinet"
"Pelosi vows to teach Trump-less McConnell a lesson despite shrunken House majority"
"WATCH: CNN Runs Segment Comparing Trump To Nazis Purging Jews | The Daily Wire"
"Democrats sue states in hopes to change rules prior to the election."
"Warnock: ‘Sick and Tired’ of Attacks on Socialism"
"Family Income Rose Drastically Under Trump, Meaning His Economy Was Better Than Obama’s"
"Florida now a Republican state"
"New York Democrat Max Rose called Republicans 'jokes,' promised to win by an 'incredible margin,' and then lost his seat"
"Organization That Made Public Blacklist of Trump Supporters Shuts Down After Massive Backlash"
"Watch Live: Pro-Trump Rally in Washington, DC"
"Harmeet Dhillon: GOP Paid Millions to Lawyers Who Abandoned Trump"
"Portland Denny's Unveils World's First Legal Spinach &amp; Meth Omelet"
"Four titans of conservatism: Reagan (USA), Mulroney (Canada), Kohl (W. Germany), and Thatcher (UK). I would have loved to be a fly on the wall for their conversations."
"California Set to Reopen Strip Clubs Before Churches - Washington Free Beacon"
"Dems Plan To Move to Georgia, Register to Vote, Vote, Then Leave’, Sen. Barrasso: ‘That Is Fraud'"
"Juliet Samuel: The American era is over if Biden abandons President Trump's toughness on China"
"Democratic governors in New Mexico, Oregon order Thanksgiving shutdowns"
"John Legend Tells Mark Cuban to Donate to Democrats Over Food Banks, Cuban Absolutely Nukes Him"
"Man Who Believes He's On The Right Side Of History Announces Crackdown On The Jews"
"Former MI Sec of State: Recount Not Enough, Need Independent Audit"
"Increase in carjackings and robberies roils Twin Cities. \"It's open season out there,\" one victim says."
"Pollsters Failed to Detect Trump Support from Educated Whites"
"Tomahawk-Wielding Elizabeth Warren Vows To Take Land Back From The Pale Faces"
"A Fabulous Margaret Thatcher Socialism Quote from 1986"
"Trump campaign wins Pennsylvania lawsuit to block ballots that lacked ID"
"Oregon Democrat Governor Kate Brown Orders New Onerous Lockdown; Will Be Enforced By Police"
"Trump Confident He'll Get More Than 270 Electoral College Votes. 'Never Bet Against Me'"
"Will Israel attack Iran before Trump leaves office? | Spectator USA"
"Forty Fort man applied for a ballot for his deceased mother, detectives allege"
"How Chinese Sellers are Manipulating Amazon in 2020: A quick look at the rebirth of the Amazon-China relationship"
"Really incredible to see a top US official admit, and then top US journalists celebrate, that the elected President was deliberately misled on troop levels in order to help continue the US military occupation in Syria."
"Georgia Dem’s anti-Israel sermon resurfaces amid Senate runoff race"
"New federal lawsuit seeks to toss 800,000 ballots in Wisconsin"
"Obama: 'Americans spooked by black man in White House' led to Trump presidency"
"The Law Is There’s No Presidential Transition Until Congress Certifies the Election: The Democrats made the rules, but they don’t want to live by them."
"Twitter removes Lincoln Project post that doxxed lawyers representing Trump"
"Pa. Gov. Tom Wolf to join NJ, NY governors in ‘emergency summit' to discuss more possible COVID-19 restrictions. ———-Obey the overlords"
"Trump's campaign drops Arizona results lawsuit - report"
"Left-Wing Activist Group Launches Strategic Harassment Campaign Targeting Trump Election Lawyers"
"Lori Lightfoot tells constituents to cancel Thanksgiving DAYS after celebrating in crowded Chicago streets"
"Michelle Malkin, Dominion Voting systems VP - Voter Fraud and Antifa links"
"Deutsche Bank Says 5% ‘Privilege’ Tax Hike For Those Who Work From Home Is Needed To Help Low Income Workers"
"California Democrat Governor Gavin Newsom Caught Attending Multi-Family Gathering That He Has Advised Against: Report | The Daily Wire"
"Republicans’ ‘Powerful Memes’ Hurt Democrats In Texas, Beto O’Rourke Says"
"New video shows candidate’s husband escorting voters into early voting in Anson Co."
"Rep. Nunes: Focus on the Voting Machines"
"Milwaukee Fox Anchor Gone For Wish McConnell Died Instead Of Trebek – Deadline"
"Milwaukee Elections Head Misplaced Crucial Voting Flash Drive"
"Georgia's vote counting software suspected of having pro-Biden bug -- 'A curious thing happened' in Fulton County"
"Newsom attended French Laundry party with more households than California advises during pandemic"
"US military seizes servers containing US election data in Frankfurt Germany"
"Fox News Cuts Ties with John Solomon After Research Division Warned That He Spreads ‘Disinformation’"
"Hillary in Aug.: \"Joe Biden should not concede under any circumstances. We've got to have a massive legal operation.\""
"Lori Lightfoot Defends Attending Joe Biden Street Parties But Calling for Canceling Thanksgiving: \"There are times when we actually do need to have relief and come together, and I felt like that was one of those times.\""
"Elon Musk knocks 'extremely bogus' COVID-19 test after taking four tests in one day"
"Two accused 'dead' Georgia voters very much alive despite claims - and they voted legally"
"Michigan Judge Denies Trump Backers’ Bid to Toss Detroit Votes"
"Trump Team: Americans Owed a Fair Election. “They deserve to know that every legal vote is counted, and that every illegal vote is not counted.”"
"Justice Alito: Pandemic Has 'Resulted in Previously Unimaginable Restrictions on Individual Liberty'"
"Target is being blasted for removing a book — \"Irreversible Damage: The Transgender Craze Seducing Our Daughters\" after a complaint on Twitter that the book is spreading \"transphobia.\""
"European Union Launches ‘LGBTIQ Equality Strategy’ To Challenge ‘Right-Wing Govts’"
"Third Circuit finds no standing to challenge PA election"
"Michigan GOP Lawmakers Demand Fraud Audit Before Election Is Certified"
"FEC Chairman Says He Believes 'There Is Voter Fraud' in Key States"
"It's possible that 2020's election fraud is way bigger than we thought"
"The exodus from California"
"Wisc Governor Tony Evers TICKED after state supreme court throws out stay-at-home order"
"Pennsylvania secretary of state will not order a recount"
"Justice Alito: 'Tolerance for Opposing Views Is Now in Short Supply'"
"Cancel Culture has finally reached the courtroom: Trump campaign lawyers pressured to quit case in Pennsylvania"
"WATCH: Georgia GOP Senator Perdue Releases Devastating New Ad Targeting Dems Plans To ‘Change America’ | The Daily Wire"
"Iran-backed Terrorist Groups in Iraq Cheer Prospect of Biden Presidency"
"Cincinnati: Black Republican City Councilman Investigated in Bribery Case"
"Alan Dershowitz Predicts Trump Will Win Pennsylvania Lawsuit | The Daily Wire"
"Progress: Biden Administration To Apply 'Black Lives Matter' Decals To All Attack Drones"
"Suddenly, the Democrats do not like Facebook's policy against political advertising. Oh, and it's suddenly racist."
"After demonizing and threatening to disband the police, the Minneapolis city council today approved funds for the MPD to bring in additional help from outside the city to help combat skyrocketing crime rates."
"NASCAR hires Al Sharpton, Barack Obama, Shaun King to implement “Critical Race-Car Theory” (Satire)"
"WALSH: Cracker Barrel Apologizes For Racist Noose In One Of Its Restaurants. It Was Just A Cord For A Soldering Iron."
"Anti-Trump Lions in the Press Turn Into Cuddly Biden Kittens"
"'Nobody pays for a damn thing!' Glenn Beck has had ENOUGH of the left's unchecked corruption"
"Arizona Republican Party Files Lawsuit to Enforce Hand Count By Precinct"
"The Polls Were Way Off. Am I Supposed To Believe GA Senate Runoff Polls Will Be Any Better? Hard Pass. | The Daily Wire"
"Kayleigh McEnany: \"I think the President will attend his own inauguration\""
"Dominion Voting systems VP - Voter Fraud and Antifa links"
"It just got harder for immigrants: the U.S. naturalization test is about to change"
"Trump: Might 'Stop By' DC Rallies for Election Integrity this Weekend"
"D.C. Mayor Tightens Lockdown, Ignores It, Calling Her Travel ‘Essential’"
"Steve Cortes Points Out Shocking “Statistical Improbabilities” in Georgia, Wisconsin, Pennsylvania"
"Partisans Cheating By Ignoring Election Law Is As Big As Vote Fraud"
"Nicole Malliotakis Is Entering Congress With a Message for 'the Squad' -- Cuban-Americans know more than anyone what socialism and communism mean and are very vigilant when it comes to individuals who want to take away any freedoms or liberties or move us down a path to socialism."
"Developing: Milwaukee Elections Chief Lost Elections Flash Drive In Morning Hours Of November 4th When Democrats Miraculously Found 120,000 Votes For Joe Biden"
"Tucker Carlson on Biden Transition: 'Not an Incoming Presidential Administration --- A Corporate Takeover of the Country'"
"More than 10,000 dead people voted in Michigan"
"Fauci: U.S. Has ‘Independent Spirit’ But It’s ‘Time To Do What You’re Told’ To Stop Pandemic | The Daily Wire"
"Ted Cruz: Don’t trust Manchin because he’ll 'dutifully obey' far-left politicians"
"Pelosi says ‘not a big fan of Facebook’ in wake of election"
"Leftists want Control. They Certainly Do Not Want Equality"
"Exit Polls showed military and veteran voters favored Trump to Biden 52-45. However, other polling suggests younger veteran voters preferred Biden 51-40. In 2016, veteran voters favored Trump over Clinton 60-34."
"Rudy Giuliani says he has uncovered enough unlawful ballots in Pennsylvania and Michigan"
"Biden’s Pentagon Transition Team Members Funded By The Arms Industry"
"The lawless fantasy to oust all the election lawyers of Donald Trump"
"Trump Admin. strikes deal to make COVID-19 vaccine free at major pharmacies and the MSM hasn't really covered this"
"Is Jeremiah Wright an Anti-Semite? Raphael Warnock Can’t Say"
"Mass PCR testing is flawed and gives false positives"
"“Unfashionable Views”: Justice Alito Speaks Out Against Pandemic Restrictions, Contraception Laws, and Other Controversies"
"Disney+ Warns Subscribers Some Old Content May Feature White, Cisgendered, Heterosexual Males"
"Biden Considers Hillary Clinton To Serve As US Envoy To United Nations"
"Michigan judge rejects GOP effort to halt county's vote certification"
"Joe Biden announces Greta Thunberg will head Climate Change Task Force (Satire)"
"Gov. Tate Reeves Signals Mississippi Wouldn’t Comply with a Biden Mandatory Six-Week National Lockdown"
"Lawyer behind Trump's legal campaign to win Pa. has a long history in Philly"
"Biden Reveals New Plans For Space Force To Bomb Space Middle East (For The Space Oil)"
"Parler, Backed by Mercer Family, Makes Play for Conservatives Mad at Facebook, Twitter"
"Meet Georgia Democrat Rev. Raphael Warnock: ‘America Needs to Repent for Its Worship of Whiteness’"
"America Can Survive an Illegitimate Commander-in-Thief"
"Obama: Paranoia about 'black man in White House' drove voters to Trump"
"FEC Chairman: 'There Is Voter Fraud' in Key States"
"Republicans Need to Win Both GA Runoffs for Senate Majority That's Outside the Margin of Romney"
"Jeffrey Epstein associate Ghislaine Maxwell fights to keep sexually charged testimony sealed"
"Biden considering Yellen as possible Treasury secretary: report"
"Tens of Thousands of Pennsylvania Ballots Returned Earlier Than Sent Date: Researcher"
"FEC Chair Drops the Hammer: The Results Are 'Illegitimate'"
"Alito: COVID a \"Constitutional Stress Test,\" Has Resulted In \"Unimaginable Restrictions On Individual Liberty\""
"In a Rose Garden address on Friday, the commander-in-chief said they would distribute a COVID-19 vaccine across the United States but would not send it to the hard-hit NY State because Cuomo doesn’t trust it."
"Anarchist and anti-fascist groups planning to 'overwhelm' 'Million MAGA March' in DC — Trump hints at attending"
"Operation Warp Speed A Success As 20 Million Covid Vaccine Doses Expected In December"
"Examining the code, internet geeks conclude 'Trump's win was yuuuge'"
"Can you really blame Trump supporters for refusing to accept the election result? | Spectator USA"
"Ala. Sen.-elect Tommy Tuberville labels Biden a socialist | One America News Network"
"Republican legislators request a full audit of the Michigan 2020 election"
"Trump talks post-election fight: The bottom line: No matter what news organizations have projected, Trump says he's confident he will win the states needed to get to 270 electoral votes. He quickly ran through the situation in six states."
"Amend the constitution to prevent another President Trump. FFS."
"Wokeists Assault Space Exploration"
"Trump Signs New Executive Order Targeting Investments in Chinese Companies -- Specifically bars US investment in companies with ties to China's military."
"Voted, put up sunglasses and tried to ore again as his son"
"WSJ Editorial Board: Justice Alito Defends the Courts"
"Newsom attended French Laundry party with more households than California advises during pandemic"
"Clark County election officials accepted one person’s signature eight times"
"Georgia Senate Candidate Jon Ossoff Quietly Discloses Financial Ties to Pro-CCP Hong Kong Media Company"
"Lawsuit filed in Green Bay seeks to toss all ballots from 3 heavily Democratic Wisconsin counties"
"Kristi Noem shreds Obama’s ‘ridiculous message’, suggests he get a clue and lays down some inconvenient truths"
"Biden Administration to target Domestic \"Terrorism\""
"Bankrupt server company in Germany raided by US military"
"True the Vote Lawsuit: Dead People, Felons Voted Illegally in Michigan"
"EPISODE TAKEN OFF OF YOUTUBE!!! (warning, contains alex jones. that is all) Timcast IRL #165 - Alex Jones Talks Lockdowns, The Election With Tim Pool And Michael Malice - Timcast IRL"
"Law firm Porter Wright withdraws from representing Trump in Pennsylvania case"
"America's top military officer says 'we do not take an oath to a king'"
"Republicans complained for months about the potential for mail-in and absentee ballot fraud, but were told that it was safe, secure, and that important safeguards were in place to protect the vote. Now it emerges that at least 109 Michigan ballots were sent to a Michigan insane asylum"
"Joe Biden's Disastrous Record of Using 'Bold Federal Action' To Solve America's Problems"
"The Election Fraud Allegations - A Definitive Breakdown of What is Happening."
"Republicans Pick Up Tenth House Seat With New York Victory -- House Republicans added one more to their ranks this week after New York Democratic Rep. Max Rose conceded defeat Thursday."
"More than two dozen Fortune 500 CEOs held a secret video conference to discuss collective action if Trump refuses to leave office, conducts mass firings in government or holds rallies which become 'seditious riots'"
"Police Calm Millennial Protesters By Handing Out Participation Trophies"
"There's a Reason Texas Rejected Dominion Voting Systems"
"Oregon governor orders 2-week coronavirus freeze, restricting bars and restaurants to takeout, closing some businesses"
"The reason Elizabeth Warren probably won't get a cabinet position"
"Target Promises to Be More Woke as It Re-Opens Store Gutted by Minneapolis Rioters, But Installs Anti-Looting Shutters"
"Joseph Epstein: Donald Trump, the President His Detractors Loved to Hate"
"Michigan GOP Lawmakers Call For ‘Full Audit’ Of Election Results Over ‘Serious Allegations’ Of Error, Voter Fraud | The Daily Wire"
"Chinese Officials: Xi Jinping Personally Canceled Jack Ma’s IPO"
"L. Lin Wood Says 100% Trump will stay president and the legal evidence is overwhelming (22 mins in)"
"New York State Sheriffs Send Cuomo Bad News About His Bid To Crack Down on Thanksgiving"
"Report: Biden Considering Hillary Clinton For UN Ambassador"
"BREAKING: Michigan GOP state senators are requesting a full audit of the 2020 General Election"
"Beijing Is Called For Biden, The Big Guy Wins China"
"Thousands of Patriots to March on Washington for Election Transparency Saturday"
"Bill Galston: President Trump Remade His Party and the World"
"Just a little history for those that think media corruption is not “real thing” - Project Mockingbird"
"Pentagon shake-up to help cement Trump's legacy, bringing troops home and taking out enemies, White House source says"
"NAACP Motion to Intervene In PA Lawsuit Presents Evidence That State/County Officials Violated PA Election Laws"
"Judge sides with Trump, barring Pennsylvania from extending voter ID deadline -- A portion of mail-in ballots from voters who had failed to provide ID by Nov. 9 should not be counted."
"Wisconsin Supreme Court tosses governor’s stay-at-home order"
"No Recounts Or Recanvasses To Be Ordered For Any Pa. Statewide Election Races"
"Turley On Obama's '60 Minutes' Comments: Confirming Vote Counts Is Not 'Delegitimizing Democracy'"
"Pope Congratulates 'Deeply Devout' Catholic Biden, Who Calls Abortion an 'Essential Health Care Service'"
"TikTok User Asks the Non-White World for Permission to Tame Her Short Hairs"
"State regulators form an association to coordinate cannabis legalization implementation"
"Oregon governor orders 2-week coronavirus freeze, restricting bars and restaurants to takeout, closing some businesses"
"HHS Secretary: Science, Data, Facts 'Do Not Support the Notion of Locking Down the Country'"
"Biden Reveals New Plans For Space Force To Bomb Space Middle East (For The Space Oil)"
"Democrat Senator Joe Manchin tweets that Democrats do not want to defund the police and do not have a socialist agenda and AOC tweets a photo of herself glaring at him during a SOTU speech by Trump."
"Bill Barr is about to drop the hammer on vote fraud"
"So, Mea Culpa is 2020 Speak for, \"Do As I Say, Not As I Do?\""
"Detroit contracted poll workers from firm owned by key figure in ex-mayor's corruption case"
"WSJ Editorial Board: NYC’s Kids Aren’t All Right"
"Michigan voters file federal lawsuit seeking to toss 1.2M ballots"
"Pope Francis, Frequent Trump Critic, Congratulates Biden | The Daily Wire"
"Mexico’s President Declines to Acknowledge Biden as President-Elect"
"The Real Resistance - The 70million people who voted for Trump are revolting against the new elites."
"Hispanic Networks Triggered by Mexican President Refusal to Acknowledge Biden as President-Elect"
"The National Urging Plan: Biden Appears To Downgrade His Mask Pledge From A “Mandate” To An “Urging”"
"BREAKING: PA Judge Rules In Favor Of Trump Campaign, Says State MAY NOT Count Ballots Where Voters Failed To Provide Proof Of Identification"
"WATCH: CNN Runs Segment Comparing Trump To Nazis Purging Jews | The Daily Wire"
"Why President Trump Has A Strong Supreme Court Case To Contest Pennsylvania"
"FEC Chairman Says He Believes ‘There Is Voter Fraud’ in Key States"
"Joe Biden's COVID-19 board co-chair says US lockdown unlikely under new administration but pushed for targeted intervention, using the example of New York City's cracking down on hotspots by the zip code instead of enforcing citywide shutdowns."
"Lindsey Graham: Signature-Confirming Machines Weren't Working in Nevada. \"The machine was basically turned off.\""
"WSJ Editorial Board: Seattle’s New Theory of Crime"
"Court-Packing Is Dead in the Water, and a Democrat Dealt the Killing Blow. AOC Is NOT Happy"
"Outgoing Syria Envoy Admits Hiding US Troop Numbers; Praises Trump’s Mideast Record"
"House Republicans demand USPS documents on Pa. whistleblower probe"
"Potential Biden Cabinet Pick a Frequent Guest on Chinese Propaganda Outlets"
"Trump Campaign, Georgia GOP Highlight Major Concerns over Recount"
"Scytl Scuttled: Election Fraud Servers Seized By Huge U.S. Army Force in Frankfurt"
"US election: Georgia ‘burst pipe’ story called into question"
"41 Republican ballots mishandled at Tucson voting site"
"Trump lawyers withdraw from key Pennsylvania case challenging vote count"
"Meet the Smith College employee whistleblower exposing anti-white racism"
"Multiple Michigan residents swear they witnessed widespread voter fraud in Detroit"
"Local Liberal Newspaper Actually Reporting Something Against the Democrat Governor..."
"Sen. Lindsey Graham (R-SC) Pledges $1 Million Donation To Georgia's Sens. Loeffler, Perdue Campaigns"
"Fauci: U.S. Has ‘Independent Spirit’ But It’s ‘Time To Do What You’re Told’ To Stop Pandemic | The Daily Wire"
"The Week in Pictures: Recount Edition"
"Nation's Democrats Make Fortune Selling Used 'Not My President' Merch To Republicans"
"Notorious white supremacist leader Tom Metzger (Ran for Congress as a Democrat) dies at 82"
"What Three Contentious Presidential Elections from U.S. History Tell Us about How 2020 May End"
"55% of White Woman Added to the Enemy List"
"Newsom attended French Laundry party with more households than California advises during pandemic"
"Did Dominion Delete 2.7 Million Trump Votes?"
"Biden set to roll back Trump rules on abortion funding, religious exemptions in ObamaCare"
"There are 65 current vacancies in the Federal Courts. Now would be a really good time to fill them."
"Republicans warn against possible 'vote by text' plan in House"
"Arizona Secretary of State Referred to Trump's 'Base' as 'Neo-Nazi' in 2017"
"First black woman crowned Miss USA deemed ‘gun-loving Trump fan’ and the left can’t handle"
"Portland city commissioner blames 'white supremacists' for fact she called cops on her Lyft driver in argument about open windows"
"Steven Crowder Surpasses \"The Young Turks\""
"Joe Biden’s cancer charity spent more than $3.7million on staff salaries but distributed ZERO towards research grants over two years, tax filings reveal"
"More Protective MAGA Helmets Now Available For Trump Supporters Brave Enough To Go Out In Public"
"Biden Called Out For Silence As Leftists Attack Pro-Trump Demonstrators In Nation’s Capital | The Daily Wire"
"New York Times Finally Admits the Black Lives Matter Riots Left 'Long-Term Economic Damage'"
"Rudy Giuliani: 'Dominion Shouldn't Be Counting Votes Anywhere'"
"New Pentagon chief tells US troops that 'it’s time to come home'"
"Twitter Claims Trump Conceded, He Counters: “I concede NOTHING!”"
"'This is extremely dangerous to our democracy': James Woods tweets video showing the memo has gone out"
"Fauci Showed Breakthrough Pfizer COVID Vaccine Results To Biden Before Trump"
"Elderly Trump supporter attacked, protesters shoot fireworks at diners, surround hotel of Million MAGA March attendees"
"South Dakota Gov. Noem Won't Enforce Biden's Mask Mandate Tyranny"
"Trump: Antifa Waited Until Most People Left MAGA Rally to Attack"
"BLM and anti-fascist supporters attack multiracial family at Million MAGA March"
"Sharyl Attkisson: Media plotted to destroy Trump, cover for Biden"
"Congressional Democrats had raised security concerns about Dominion, other voting machine companies"
"Professor: Trump rose because government hasn’t served the people"
"Steven Crowder becomes the largest independent news channel after surpassing The Young Turks"
"Twitter flags Nikki Haley for saying obviously true things"
"Biden cancer \"charity\" spent millions on salaries, zero on research"
"'Total Media Blackout' as Antifa Launches Attacks on MAGA Rallygoers in DC"
"Georgia Senate candidate Raphael Warnock: People in US need to 'repent' for Trump and 'worship of whiteness'"
"38 percent of Americans planning on having Thanksgiving dinner with 10 or more people"
"What’s the most expensive tweet in Twitter history? I nominate Kathryn Murdoch’s post-election tweet, “We did it!” The corruption of Fox News triggers flashbacks to the fall of the former dissident website Drudge Report, which went full Never Trump."
"Why Democrats Lost So Many South Texas Latinos—the Economy. Party messaging didn’t resonate in socially conservative border communities fearful of Covid-19 shutdowns and the loss of well-paid oil-industry jobs"
"Watching the footage of all the violence against Trump supporters in DC got me like..."
"17 Pro-Life Women Elected To Congress In ‘Historic Surge’ Of Female GOP Victories"
"A picture of President Calvin Coolidge's pet lions—who were named \"Tax Reduction\" and \"Budget Bureau\""
"Dear Media: Give Us a Break About ‘Healing’ and ‘Coming Together’ — It’s Not Happening"
"Fury as Mayor tells Chicago to CANCEL Thanksgiving over Covid…days after celebrating Biden win maskless in crowd"
"Portland Official Who Called 911 After Lyft Driver Canceled Ride Says She Feared ‘White Supremacists’"
"Young Kim Flips Blue California Seat Red, Second CA GOP Pick-Up Of Election | The Daily Wire"
"A Quarter-Million Wisconsin Voters Claimed To Be “Indefinitely Confined” And Not Bound By Voter ID"
"Let's get ready to RATIOOO! Dems claiming Biden will 'restore the soul of this nation' as Biden supporters BEAT on Trump supporters in DC BACKFIRES"
"Florida Republicans win recount, flip key Senate seat in Miami"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"The Biderman report"
"Lockdowns Haven't Brought down Covid Mortality. But They Have Killed Millions of Jobs"
"Trump Tweet: Our election was hijacked. There is no question. Congress has a duty to #ProtectOurDemocracy &amp; #FollowTheFacts.... oh, wait, that was Nancy Pelosi in 2017."
"John James launches legal defense fund as he contests Michigan election results"
"Over 300,000 People Have Fled NYC Due to Coronavirus, Crime"
"Maria Bartiromo: Don’t censor her and don’t call her a conspiracy theorist. She said she believes Trump was the victim of an attempted coup that began even before his election"
"Why Trump supporters are here for good"
"BLM Attacks Pro-Trump Black Woman Pushing Stroller after D.C. Rally"
"Protesters Stomp on Trump Supporter's Head After D.C. Rally"
"Affidavit of Melissa Carone, IT contractor for Dominion Voting Systems working at Detroit, MI TCF Center states that she “witnessed nothing but fraudulent actions take place”"
"Mike Pence to Audience Chanting 'Four More Years!': 'That's the Plan'"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Sanders to Trump: ‘Man-Up’ and Say You Lost the Election"
"Like Cruel Scientists Who Torture Dogs, the Democrats Want to Teach Us Learned Helplessness"
"Antifa and BLM Come to DC Rally Where They Are Outnumbered -- They Should Have Stayed Home"
"Wisconsin Voters File Lawsuit To Exclude Over 792,000 Votes In 3 Counties"
"Chicago Mayor Limits Gatherings To Ten People Unless You're Involved In A Drive-By"
"'Far from over': 'MAGA' diehards pledge allegiance to Trump at Supreme Court"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"Fauci: Social Distancing, Masks Still Necessary After Getting Coronavirus Vaccine"
"California Judge Finds Newsom Lacked Authority for Mail Ballot Order"
"Al-Qaeda’s No. 2 Leader Was Killed In Iran By Israeli Assassins At Behest Of U.S.: Report | The Daily Wire"
"After the Minneapolis City Council Caused a Major Crime Wave, They Just Approved $500,000 to Fund Outside Police"
"Stochastic terrorism. They have already labeled 70 million Americans as deserving of violence against us. Take note and make sure you protect yourselves."
"After attacking them earlier in the streets, Antifa and BLM now harassing Trump supporters at restaurants and hotels in DC"
"Joe Biden Promises to Raise Annual U.S. Refugee Target by 800%"
"Revised and expanded U.S. citizenship test asks why Electoral College is important"
"'I'm NOT Hunter Biden, lunchbox.' Dana Loesch takes down HORDE of frothy-mouthed, chest-thumping harpies trying to #FireGinaCarano"
"Alito: Senators' Threats In 2A Case \"Affront To The Constitution\""
"Jon Meacham Fired By MSNBC for Failure to Disclose Writing Biden Speech He Praised On The Air"
"Sidney Powell on Dominion Systems…"
"Giuliani: Trump 'Far From' Conceding Election To Biden"
"Confirmed: Biden Cancer Initiative Spent on Salaries -- and Little Else"
"Fox’s Wallace: Trump Can’t ‘Credibly’ Say the Election Was Taken from Him — No ‘Serious Fraud’"
"Pope Francis account caught liking bikini model’s racy picture on Instagram"
"new york attorney general leilita james is a corrupt fascist who ran on the promise to abuse her authority to target her political enemies.. something that fascist New York Democrat voters seem to have liked"
"BBC Investigation into the dead voters of Michigan"
"Biden COVID Advisory Board Member: Indoor Dining, Gyms, and Gatherings in Homes Should Be Targeted ‘for Closures’"
"Election Observer Explains How Nursing Home Vote Fraud Works"
"Whoa. Newsmax Breaks Big Ratings Milestone as Competition With Fox News Heats Up"
"Refusing To Apply The Law To Leftists Is Normalizing Political Violence"
"Trump: Georgia's Election Recount a 'Waste of Time' -- officials won't allow his campaign's observers to be in the counting rooms"
"7 Democrats Who Violated Coronavirus Guidance As Left Moves To Cancel Thanksgiving"
"Sydney Powell \"We are going to release the Kraken\" on Dominion Treason"
"For First Time, Trump Says Biden ‘Won,’ But Again Claims ‘Election Was Rigged’ | The Daily Wire"
"GOP Flips 12 House Seats So Far…"
"California Voter: Voter Suppression Looks Like Communism. \"They controlled newspapers, the controlled the media, they tried to get everybody to support them, when it turns out to be all lies”"
"Gov. Newsom Breaks State COVID-19 Guidelines For a Birthday Party in Napa County"
"Meet the Man Who Was Our First Multiracial Vice President"
"Lawyer Who Represented Richard Jewell Sues to Stop Georgia Certifying Election Results Without Signature Review"
"Antifa Goes Wild in D.C., Attacking Trump Supporters, Even Terrorizing Children and the Elderly"
"Fox News Anchor Blows Up on Trump Spokeswoman as the Descent Continues"
"CNN’s Acosta Projecting: Trump Will Become Just ‘Another Crackpot On The Internet’ After Jan. 20 | The Daily Wire"
"The political class’s coronavirus credibility crisis endangers public health"
"Massive Crowds March in DC to Show Support for Trump, Demand Election Integrity"
"Leftists Violently Attack Trump Supporters In Nation’s Capital Following ‘MAGA March’ | The Daily Wire"
"Super Woke Law Professor Compares Questioning Voting Results To Holocaust Denial"
"In key swing states this year, mail-in ballot rejections plummeted from 2016 rates"
"Woke Terrorists Want Gina Carano Fired Because She Is Not A Leftist"
"Mississippi governor says his state won't participate in a potential national lockdown, promises to fight it"
"Israeli agents killed al-Qaeda's No. 2 on Iran street, at behest of US"
"Trump Card?"
"Raphael Warnock wanted all of you White people to repent"
"California Gov Newsom busted attending large dinner party against his own advice"
"Joe Biden promises to raise annual number of refugees admitted to US from 15,000 to at least 125,000"
"Young Kim Flips Blue California Seat Red, Second CA GOP Pick-Up Of Election"
"California Voters Rebuked Their Governor, Legislators at the Ballot Box"
"Biden's 'I'm no Trump' campaign is not enough to govern"
"GET READY: The Show Is Just Starting – Democrats Rigged the Voting Machines, They Attempted a Steal – And They Got Caught"
"Post-election announcement of vaccine ripped by White House -- Biden was notified of vaccine the night before while WH only learned through news reports."
"Mitchell Laments False 'Socialist Memes' Harming Democrats"
"Democratic Socialists endorse 6 candidates in bid to run NYC Council"
"Democrats will never stop calling conservatives Nazis. Ever."
"Violent Left Terrorizes DC: BLM Thug Holding “Trump Pence Out Now!” Sign Sucker Punches, Knocks Out White Male From Behind [VIDEOS]"
"New Mexico orders two week lockdown"
"The Whistleblowers Against Electoral Fraud are Emerging"
"HHS spends hundreds of thousands funding study of non-heterosexual women who drink and use FB"
"Antifa invades Million MAGA March carrying ‘Punch a MAGA in the Face’ banner while HIDING behind COPS"
"Boston Voter: Rallies Necessary to Counter Social Media Censorship"
"Satire: Democrats Propose Sending Republicans To 'Unity Camps'"
"Israeli agents killed Al Qaeda's No. 2 official on street in Iran: report"
"Trump Makes Appearance At ‘Million MAGA March’ In D.C. | The Daily Wire"
"Social distancing, masks still necessary after getting COVID-19 vaccine: Fauci"
"Gov. Kristi Noem won't comply with Biden face mask mandate: He 'doesn't have the authority'"
"BREAKING: President Trump Makes Surprise Appearance As Thousands March In DC To Show Their Support For Him…#MarchForTrump"
"Seattle’s New Theory of Crime"
"In 2019, Democrats warned that election companies like Dominion were 'prone to security problems'"
"A Cautionary Note to Antifa and BLM Thugs Contemplating “Civil War”"
"Pelosi Defends Holding Large Dinner for Incoming Members"
"Limbaugh Accuses Fox News of Abandoning its Base -- 'You Don’t Turn on the People Who Got You Where You Are'"
"Mass exodus from NYC is happening as New York state to lose $1.4 billion in tax revenue: report"
"Bill Maher Owns Libs, Who Think 'Silence Is Violence and Looting Is Not'"
"Harvard Researchers: Nearly Half of Young Adults Showing Signs of Depression Amid Pandemic -"
"Justice Alito tells it like it is"
"President Trump: COVID vaccine should be approved in coming weeks"
"N.Y. Gov. Cuomo Denies Science Again: \"None Of What He Said Is True\""
"WATCH: Antifa Accosts Women, Children, Elderly, and Restaurant-Goers After MAGA March"
"New stats reveal massive NYC exodus amid coronavirus, crime"
"Million MAGA March: Supporters explain why they're still backing Trump"
"Violence erupts in DC as counter-protesters assault Trump supporters"
"President Trump Drives by Supporters in DC for 'Million MAGA March'. 'Chants of “USA! USA!” “We want Trump! We want Trump!” and “Four more years! Four more years!” could be heard.'"
"Media Confused By Completely Peaceful Protest"
"'Ready To Help': Biden Spoke At PA Election Board Chairman's Party"
"CNN’s Acosta: Trump Will Become Just ‘Another Crackpot On The Internet’ After Jan. 20 | The Daily Wire"
"Violence occurs after rally in the nation's capital; Trump calls out Antifa"
"Grammy-winning artist Erykah Badu tests positive for COVID-19 in left nostril, negative in right. “No symptoms. Was tested for COVID. Same machine. Left nostril positive. Right nostril negative,” she tweeted."
"Congressional Democrats had raised security concerns about Dominion, other voting machine companies"
"An MRC study finds that 4.6% of Joe Biden voters would NOT have voted for him had they known about the Biden family's corrupt business dealings."
"Parler, Backed by Mercer Family, Makes Play for Conservatives Mad at Facebook, Twitter"
"Washington State is a worrisome window into the future | Spectator USA"
"Law Firm That Dropped Trump Advises CCP-Linked Firms, Aided In Outsourcing U.S. Jobs To China"
"CNN Compares The Trump Administration To Genocidal Nazi Germany"
"Warnock: America Must ‘Repent For Its Worship Of Whiteness’ | The Daily Wire"
"Harvesting the 2020 Election"
"For those of you wondering, here's a podcast where Giuliani lays out current legal cases and the path remaining for Trump. Great listen!"
"Judge says acting DHS secretary appointment unlawful, reinstating DACA"
"Flashback: Democrats Warned of Voting Machines 'Switching' Votes Last Year"
"Thousands flock to DC for pro-Trump rally"
"Biden Transition Official Believes the First Amendment Has a 'Design Flaw' -- His Remedy Is to Curb Free Speech"
"Thousands of disheartened families yanking kids out of NYC public schools"
"Trump rails against Georgia recount process"
"Covid detected in Italy Sept 2019"
"Meet Georgia Democrat Rev. Raphael Warnock: ‘America Needs to Repent for Its Worship of Whiteness’"
"Muslim 'influencer' claims she was removed from flight after passenger said he felt uncomfortable"
"'Sigh of Relief': U.N. Joins Globalist Agencies to Await Biden Handouts"
"Trump supporters protests turn into violent clashes with anti-demonstrators"
"Kristi Noem fires back at former president Obama over his characterization of America in his forthcoming memoir"
"Pennsylvania Won't Need a Recount to Certify Biden Victory, State Says"
"Justice Alito Slams Dem Lockdowns, Says COVID Has Caused 'Unimaginable Restrictions On Liberty'"
"Walked a fine line’: how Fox News found itself in an existential crisis"
"Biden’s Media Campaign"
"The New Purpose of Public Education."
"Trump drives by supporters at DC march"
"Pollster: It's Curious How Biden Underperformed Hillary Clinton In Every City...Except These Four: Milwaukee, Detroit, Atlanta and Philadelphia."
"Blue State Blues: Republicans Need to Be Ruthless in Georgia"
"How vote switching machines work"
"MSNBC’s exodus to work for Joe Biden shows it’s been shilling for him all along"
"US election: Trump appears to admit Biden victory in tweet"
"For President Trump, a larger fight endures after 2020 election"
"Scottish Hate Crime Bill Could Criminalise 'Inflammatory' Bible"
"As China’s confidence grows, it looks to ‘design’ how war is fought"
"Google Used Power to Shift Millions of Votes Through Targeted Messaging: Researcher."
"DHS boss Chad Wolf defies Trump order to fire cyber chief Chris Krebs"
"Women and Minorities Lead the GOP’s Freshman Class"
"Lindsey Graham fires back after top Democrat demands no more hearings for Trump's judicial nominees"
"Tucker Carlson issues on-air apology over Georgia voter claims"
"PHOTOS: Donald Trump Thrills D.C. Supporter Rally with Motorcade Drive-By"
"Pennsylvania Court Denies 5 Trump Campaign Legal Challenges"
"Media's hiding of Hunter Biden scandal robbed Trump of clear win: Poll"
"UK: Dozens of foreign-born terrorists avoided deportation on release from prison, study finds"
"Democrats Lament Failure to Turn Texas Blue: 'What the F*ck Is Happening?'"
"Democrats Need Joe Manchin More Than They Need AOC"
"Julie Kelly: Celebrate Thanksgiving (Avoiding death is not living.)"
"Retiring diplomat says defense officials misled Trump on troop count in Syria"
"BLM and anti-fascist supporters attack multiracial family at Million MAGA March"
"Obama's WH Physician Issues Brutal Statement on Biden's Mental Health."
"According to The New York Times, potentially 90 percent of those who have tested positive for COVID-19 have such insignificant amounts of the virus present in their bodies that such individuals do not need to isolate. \"Most of these people are not likely to be contagious\""
"Portland Denny's Unveils World's First Legal Spinach &amp; Meth Omelet"
"Three Wisconsin Voters Band Together, File Election Lawsuit That Could Give Trump An Easy Win"
"Democratic senators warned of potential 'vote switching' by Dominion voting machines prior to 2020 election"
"CHAOS As BLM Terrorize Trump Supporters: ‘Radical Revolution Changes the World B*tch,\" [VIDEO]"
"Last December, Sen. Warren (D) helped pen a letter to HIG Capital, talking about how they and Dominion provide the majority of voting machines. Included in that letter are claims of vote-switching and many irregularities. Hmm..."
"Al-Masri's daughter, also a target, was tapped for top al-Qaeda role - report"
"Rep. Louie Gohmert, (R-TX): Foreign company had evidence of 'vote switching' -- Server 'seized' by U.S. Army forces after he gave information to President Trump"
"Republican Burgess Owens Defeats Democrat Rep. Ben McAdams in Utah"
"Logan Act: Communist China Congratulates Biden on 'Victory,' Opens Backchannel Talks"
"Janet Daley: Why won’t UK say that a vaccine will end this dystopian lockdown?"
"The Notorious SAA: Democrats Denounce Alito After Years Of Praising Ginsburg For Controversial Comments"
"Republican Young Kim takes down Democrat in California House rematch"
"Trump Campaign Asks Pennsylvania Federal Judge To Order State To Provide Information About Mailed-In Ballots"
"Melissa McCarthy apologizes for backing anti-sex-trafficking charity"
"Dick Morris: Georgia Recount 'a Sham and a Hoax and a Fix'"
"If All the Fraud Is Uncovered, Trump Will Win -- How do we know? The people who tried to pull off this election heist are drawn from the same swamp as the conspirators in the Russia hoax."
"The Law is Clear: If An Election is Stolen, State Legislatures Can Restore The Will of The People"
"Pennsylvania, Michigan, Wisconsin: Here's an Update on Team Trump's Lawsuits and Recounts"
"The New York Academy of Medicine Honors Andrew M. Cuomo, Governor of New York, with Prestigious Public Health Award"
"Colorado man wins lottery, misses deadline to turn in ticket by 3 days, loses all the money"
"(Clinton) Federal Judge Invalidates Trump Administration's DACA Rollback"
"How President Trump Surprised 'Million MAGA March' Participants"
"\"Violence erupts in DC as counter-protesters fight Trump supporters\""
"Top UK Politician: Workplaces May Ban Britons Without Vaccination Docs"
"Commentary: Building a New, Less Cowardly Republican Party"
"As COVID-19 Threatens Further Lockdowns, One Portland Bar Owner Promises Civil Disobedience"
"Dominion Machines Cover Millions Of Voters, BUT WATCH HOW EASY IT IS TO RIG ONE OF THEM"
"How the Armenian Genocide’s Legacy Explains a Conflict on Pause -- For far too long, the West has turned a blind eye to Turkey’s egregious behavior."
"Mitch McConnell: the US Senate’s Republican roadblock"
"Dejected Democrats regroup after Texas eludes them — again"
"Covid-19: Stop anti-vaccination fake news online with new law says Labour"
"Milwaukee Elections Head Misplaced Crucial Voting Flash Drive"
"Wisconsin lawsuit seeks to toss 800,00 ballots -- Biden leads by 20,000 votes in state"
"Liberal cities fail to provide upward mobility"
"How Ballot Fraud in Nevada Worked and the GOP Will Never Win Statewide Unless The Process Changes"
"Chuck Schumer: ‘Republicans in Congress Are Spreading Conspiracy Theories’"
"Elon Musk says he ‘most likely’ has COVID-19 amid conflicting test results"
"Janice Turner: Care home visits are a basic human right"
"Watch: fox lou dobbs sydney powell interview on dominion systems"
"Republican Party of Pennsylvania, Petitioner v. Kathy Boockvar, Secretary of Pennsylvania, et al. (U.S. Supreme Court case in progress)"
"Oregon Gov. Kate Brown says large parties could trigger fines or jail time during coronavirus ‘freeze’"
"Man Who Believes He's On The Right Side Of History Announces Crackdown On The Jews"
"Anyone who reads about our founding cannot deny there was a divine hand at work."
"Journalist Glenn Greenwald Rips 'The Most Pathological Liar' in Politics and Other Dems for Burying Hunter Biden Fiasco"
"\"The Great Reset\" Already Happened"
"Kamala Harris Proposes Housing Plan Where Everybody Gets Free 10'x10' Room And Three Meals A Day"
"How did the Russiagate hoax feed into the Covid hoax and then feed into the Election hoax?"
"The Radical Ideology of Antifa: Burn, Harass, and Intimidate"
"First African-American Miss USA distances herself from Trump after social media backlash."
"Alaska Ballot Measure to enact Ranked-choice Voting Pulls Ahead"
"Long-term unemployment is on the rise, economists and social scientists worry"
"Brit Actor Dropped by His Agency for Saying It's Racist to Call Him \"White Privileged\""
"Democrat West Coast Governors Impose COVID Travel 'Advisory' on Free Americans"
"How Chinese Sellers are Manipulating Amazon in 2020: A quick look at the rebirth of the Amazon-China relationship"
"Union agents believe they have an inherent right to access employers property ... SCOTUS to decide"
"HHS Secretary: Science, Data, Facts 'Do Not Support the Notion of Locking Down the Country'"
"If Media Didn't Think Trump Could Win, It Wouldn't be Targeting his Lawyers"
"President Trump wins North Carolina, hits 232 electoral votes"
"STUNNING TESTIMONY: Michigan Election Observer Shane Trejo Witnessed Drivers Bring in 50 Boxes of “Absentee Ballots” After Midnight Deadline into Detroit TCF Center at 3:30am"
"Plan B? Trump could receive second term from U.S. House in 'contingent election'"
"James Woods Finds That One Word That Should Not Be Said (\"Dominion\"), and Yes, Even Dems Questioned Voting System Issues"
"Hillary Clinton Supporter Alan Dershowitz: 'Trump Will Win the Pennsylvania Lawsuit'"
"ANTIFA and BLM demonstrate Biden's UNITY by physically assaulting PEACEFUL Pro-Trump MAGA Marchers"
"A Capitalist Defense of Big Pharma"
"NY Gov. Cuomo Explains Why Schools Are Closing Even Though They Don't Spread COVID"
"Poll: Media's hiding of Hunter Biden scandal robbed Trump of clear win"
"Challenging 2020 also brings major jump in Chicago carjackings"
"House Minority Leader Kevin McCarthy Celebrates the Year of the Republican Woman"
"California Democrat Governor Gavin Newsom Caught Attending Multi-Family Gathering That He Has Advised Against: Report | The Daily Wire"
"Restaurant workers react to Governor Brown's two week freeze"
"South Dakota Gov. Kristi Noem won't comply if Biden pursues national mask mandate"
"Democrats sue states in hopes to change rules prior to the election."
"In January, Socialism Is on the Ballot in Georgia"
"Alito: Senators' Threats In 2A Case \"Affront To The Constitution\""
"Utah U.S. House 2020 Election Live Results | RealClearPolitics Calls Race For Burgess Owens in 4th Congressional District"
"Oregon: Relaxation of drug laws creates an Altered State"
"A Fabulous Margaret Thatcher Socialism Quote from 1986"
"Durham’s Lame Duck Period: Democratic Leaders Suggest A Dim Future For Biden-Related Investigations"
"Trump Team to Call Million Plus Voters about Anomalies in 6 Contested States. “We’re calling them to confirm whether or not they actually cast the ballot, or if that ballot was cast by somebody else in their name”"
"A major flaw has been found in Switzerland’s online voting system - SCYTL"
"Cindy McCain Says Late Husband Would Want Country to ‘Move on’ and Support Joe Biden"
"WH Rips Post-Election Timing on Vaccine: 'It Is a Scandal'"
"Elon Musk Tests Positive, Negative, Positive, Negative All in One Day, But MSNBC Producer Doesn't Think He Should Have Told You"
"Law Firm Targeted by Cancel Culture Will No Longer Represent the Trump Campaign"
"AOC gets the hype, but Joe Manchin’s approach is the winner for the Democratic Party"
"Ronald Reagan Last Stand on Earth Quote"
"America, Home Of The Stunning And Brave"
"Steven Crowder Surpasses ‘The Young Turks’ As Largest Online News Channel | The Daily Wire"
"Unhinged Analyst Furious With Parler Success Links Dan Bongino to Russian Disinformation"
"Trump leaves 2024 door open with fundraising push"
"Twitter Fact-Checks Harry Potter's Claim That Voldemort has Returned"
"Thanksgiving is canceled, schools are closed but Nancy Pelosi's big indoor dinner for new House members is totally safe"
"CNN calls Parler a \"threat to Democracy\""
"The 2020 Democratic Party Platform – Understanding the Opposition"
"Incoming GOP lawmaker shares video of hotel room workout, citing 'Democrat tyrannical control'"
"Victor Hansen: Will President Trump Ride Off Into the Sunset? (Shane...)"
"Paul Gregory: In Russia groundwork laid for transition from Putin"
"South Dakota Gov. Kristi Noem Wouldn’t Enforce a Biden National Lockdown"
"Pence: We're fighting to protect election ballot integrity -- And also \"about preserving what we have accomplished and have yet to do, and it's all about preventing the other side from undoing all the progress that we've made in making America great again.\""
"Trump said the vaccine will be available to everyone by April -- except residents in New York state where the governor has decided not to “for political reasons.”"
"Elon Musk took 4 COVID tests in one day: receives 2 positives, 2 negatives"
"Trump talks post-election fight: Trump says he's confident he will win the states needed to get to 270 electoral votes, \"Never bet against me.\""
"Classroom Busybodies Ban a ‘Jesus Loves Me’ Mask"
"Twitter in 1615 A.D."
"Newsom apologizes for breaking own COVID-19 rules"
"Nevada: GOP Poll Watchers Say They Were Forced to Leave Election Center"
"Trump wins North Carolina"
"\"The Average Temperature of the Universe has Been Getting Hotter and Hotter\""
"Trump got more NYC votes in 2020 — including in the South Bronx"
"Gambling sites refuse to call election for Biden, leaving $600 million in limbo"
"Memo: New Defense chief signals potential troop drawdown: 'All wars must end'"
"Trump supporters descend upon Washington to defend the president Despite Defeat"
"‘Critical race theory is the ideology of the bureaucracy’"
"Senior Administration Officials Lied To Trump About Troop Levels So He Wouldn’t Pull Out Of Syria"
"Pelosi vows to teach Trump-less McConnell a lesson despite shrunken House majority"
"Lori Lightfoot tells constituents to cancel Thanksgiving DAYS after celebrating in crowded Chicago streets"
"Alito Rightly Slams Five Democratic Senators for 'Bullying' the Supreme Court. The senators warned that the Court might have to be \"restructured\" if it did not reach the conclusion they preferred in a Second Amendment case."
"Target Removes Book Critical Of Trans Agenda After Customer Complains Online; Book Shoots To Top 100 On Amazon"
"Trump puts Giuliani in charge of election lawsuits: report"
"Alan Dershowitz Predicts Trump SCOTUS Win in Pennsylvania Ballot Case"
"REMINDER: Tomorrow the Million MAGA March Will Try To #StopTheSteal -- Marchers will gather at noon at Freedom Plaza to march to the Supreme Court."
"Did The US Raid European Software Company Scytl And Seize Their Servers In Germany? — Our Intel Source Says YES, IT HAPPENED!"
"Officials in Georgia have not been able to produce any invoices or work orders related to a “burst pipe” at Atlanta’s State Farm Arena that was blamed for an abrupt pause in vote counting on election night."
"Events list for #StopTheSteal.US"
"‘Utterly Detestable’: John Legend Says To Direct Donations To Democrats Instead Of Food Banks, Gets Ripped Online | The Daily Wire"
"Democratic senators warned of potential 'vote switching' by Dominion voting machines prior to 2020 election"
"Forty Fort man applied for a ballot for his deceased mother, detectives allege"
"Gov. Newsom says he shouldn't have attended birthday party at French Laundry amid COVID-19 surge"
"Former Reddit CEO Wants Trump SIlenced Online to Stop ‘A Coup’"
"Burgess Owens(R) grows lead over Incumbent Rep. Ben McAdams in 4th Congressional District race"
"AOC Says She Plans To Work ‘Very Hard’ On Georgia Runoffs – State Dems Say Please Stay Away"
"Trump walks back tweet saying Biden 'won' election"
"Watch Live: Pro-Trump Rally in Washington, DC"
"US election: Text messages cast doubt on Georgia officials’ ‘burst pipe’ excuse for pause in ballot counting."
"Right thinkers abandon Twitter for Parler and Rumble"
"Jon Voight Condemns the 'Lie' of a Biden Win Amid America's 'Battle of Righteousness Versus Satan' -- Who would’ve ever guessed one of the biggest supporters of the Republican Commander-in-Chief would be…Brad Pitt’s father-in-law?"
"Tomahawk-Wielding Elizabeth Warren Vows To Take Land Back From The Pale Faces"
"Democratic congresswoman compliments way Trump 'doesn't talk down to people' unlike some 'woke' Democrats"
"Warnock: ‘Sick and Tired’ of Attacks on Socialism"
"A dark look into Biden's America: Norway criminalizes private criticism of LGTBQ people"
"US Election 2020: The 'dead voters' in Michigan who are still alive"
"Biden Says He Is Considering Adding Metamucil To His Cabinet"
"Kyle Rittenhouse's Mother Tears Into Joe Biden for Smearing Her Son as a White Supremacist"
"Wokeists Assault Space Exploration"
"WATCH: CNN Runs Segment Comparing Trump To Nazis Purging Jews | The Daily Wire"
"Family Income Rose Drastically Under Trump, Meaning His Economy Was Better Than Obama’s"
"Elite Opinion Is Never Wrong"
"Florida now a Republican state"
"Harmeet Dhillon: GOP Paid Millions to Lawyers Who Abandoned Trump"
"New York Democrat Max Rose called Republicans 'jokes,' promised to win by an 'incredible margin,' and then lost his seat"
"Organization That Made Public Blacklist of Trump Supporters Shuts Down After Massive Backlash"
"Four titans of conservatism: Reagan (USA), Mulroney (Canada), Kohl (W. Germany), and Thatcher (UK). I would have loved to be a fly on the wall for their conversations."
"Oregon Democrat Governor Kate Brown Orders New Onerous Lockdown; Will Be Enforced By Police"
"Trump laying groundwork for full US troop withdrawal from Afghanistan before leaving office"
"Biden Transition Official Believes the First Amendment Has a 'Design Flaw' -- His Remedy Is to Curb Free Speech"
"Man arrested over Rick Moranis attack"
"Why Democrats Nearly Lost the House. The problem is their policies, not their marketing."
"UFC fighter Jorge Masvidal says he may start attending conservative rallies 'to keep the peace' after seeing left-wing violence"
"China Expert: Beijing Happy With Biden Win. “I think China is very happy with how things turned out, because Beijing worked very hard to get the vice president elected” by malicious and massive attacks on President Donald Trump through a public disinformation campaign."
"BREAKING: New Vaccine Developed In Conjunction With Trump’s ‘Operation Warp Speed’ Is 94.5% Effective, Company Says"
"Rand Paul Vows to Prevent Biden Lockdown -- 'We Can't Go on Like This Forever'"
"Suspect Arrested For Tossing ‘Commercial Grade Firework’ At Restaurant Patrons Following Million MAGA March"
"Asian kids officially kicked out of \"students of color\" category by a WA school district."
"When talk of ‘unity’ just means ‘surrender’"
"Obama Compares Trump To Dictator During Interview, Gets Slammed Online For Hypocrisy | The Daily Wire"
"Hypocrisy Unmasked: Gov. Gavin Newsom Breaks Own COVID Rules to Party With Lobbyist"
"The ACLU is a Corrupt, Partisan Organization With No Real Connection to Civil Liberties Anymore"
"AT&amp;T Reportedly Looking to Sell CNN"
"Michigan lawmaker calls for Whitmer's impeachment"
"Woman calls Michelle Obama \"a great example of the disdain that 72.7 million people have put up with from elitists like her\" in scathing letter"
"Covid is so bad that Robert Reich wants to forget that pesky Constitution and just install Biden as President right now. No, I'm not kidding. This is a real tweet. Reich served in the Ford, Carter, Clinton and Obama administrations."
"If You Haven’t Quit Watching FOX News Yet… Watch this Clip of Leland Vittert laughing at a Trump Spokeswoman"
"1.7 Million Trump Votes Deleted By Dominion Voting System Nationwide."
"New federal lawsuit seeks to throw out 1.2 million votes in Michigan, flipping the state for Trump"
"Israel Demands CNN Apology over Amanpour Likening Trump’s Tenure to Nazi Germany"
"Where's Biden? The silence from 'Mr. Unity' over violent attacks to Trump supporters is deafening"
"Sanders: ‘Nobody I Know Who Is Running For Office Talks About Defunding The Police’ | The Daily Wire"
"No Evidence Of Widespread Viewership At Fox News Last Week"
"Obama Defames 'Millions of Americans' as Racists in New Memoir"
"Biden COVID Advisor: Those Older Than 75 Should Get Vaccines Last -- American's should be deeply troubled that a man Biden is looking to for advice on COVID is someone who hopes to die at 75 and has publicly supported rationing care for the elderly."
"Democrats Hold Big Dinners While Telling You to Cancel Thanksgiving"
"Sidney Powell with Maria Bartiromo on software evidence to 'OVERTURN' multiple states (Video)"
"Maher: Democrats' obsession \"woketopia\" is why the blue wave didn't happen on election night"
"The Real 'Authoritarian' Isn't Trump. It's The Left"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"Michigan Voters Call Into Question More Than One Million Ballots"
"Jorge Masvidal May Attend Conservative Protests to 'Keep the Peace' After Watching Leftist Attacks"
"And The Kraken for the win (explained)"
"Joe Biden's Student Loan Debt Forgiveness Plan Will Cancel up to $50,000 per Student"
"Dominion, the Foreign Software Company with a Controversial Background Deciding American Elections - El American"
"President Trump’s Final 2020 Act Should Be Pulling U.S. Out From Endless Wars -- A reprioritization of America’s strategic interests would cement the legacy of the first president in the era of great-power rivalry."
"China Lied and People Died in 2020. Americans Must Remember That."
"Michigan GOP State Rep. calls for Governor Whitmer's impeachment following new COVID restrictions"
"Pollster: It's Curious How Biden Underperformed Hillary Clinton In Every City...Except These Four."
"Parler Tops App Store Charts for First Time"
"California School District Bans 'To Kill a Mockingbird,' 'Huckleberry Finn,' Other Classic Novels"
"3 Fishy Things In Pennsylvania Voter Data The State Has Yet To Explain"
"The Chinese Air Force Sure Is Buying A Lot Of Bombers"
"Recount gives NH Republican a 6% boost in Vote Total"
"'Except you're FORCED to attend': EPIC thread takes ridiculous 'socialism is just like a potluck, y'all' narrative APART and it's glorious"
"“Moderna's coronavirus vaccine is 94.5 per cent effective, according to company data” Trump REALLY wasn’t lying.."
"Dr. Scott Atlas, a member of the White House Coronavirus Task Force, encouraged the people of Michigan on Sunday to \"rise up\" against new coronavirus restrictions put in place by Gov. Gretchen Whitmer. \"The only way this stops is if people rise up. You get what you accept.\""
"Stochastic terrorism. They have already labeled 70 million Americans as deserving of violence against us. Take note and make sure you protect yourselves."
"Hundreds of Catholics protest closure of Sunday Mass under France's coronavirus measures"
"Why the Minority Vote is Shifting Right"
"Italy: Young Man Fined 400 Euros for Kissing Girlfriend Outside, Violation of COVID Rules"
"Forget Finding Fraud, Trump May Seek to Deny Biden 270 Electoral Votes, Put Election in Congress"
"Biden Fills Economic Posts With Experts on Systemic Racism"
"Bill O'Reilly Predicts 'Collapse' Of Cable News Networks Post-Trump"
"New York Times Finally Admits the Black Lives Matter Riots Left 'Long-Term Economic Damage'"
"Watching the footage of all the violence against Trump supporters in DC got me like..."
"San Francisco Considering A Bill To Fine People For Smoking In Their Private Apartments | The Daily Wire"
"Scoop: Trump plans last-minute China crackdown"
"Emboldened by Biden, the Lockdown Fascists Return for Round 3. The political “Science!” leaders will all keep showing up to press conferences with their masks on so that we simple folk can bathe in the healing power of virtue-signalling."
"Obama Compares Trump to Dictator -- 'There Has Been a Sense' He Would 'Do Anything to Stay in Power'"
"Our immune systems can cope with Covid-19 – it's our politicians who can't"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Republicans Have Good Reason Not To Trust The Election Results -- And it’s not because they’re stupid, traitorous Nazis."
"Justin Trudeau Demands All Bears Be Scrubbed To Be Sure They Aren’t Polar Bears In Blackface"
"Professor says questioning systemic racism ‘is itself offensive and racist’"
"Michigan \"Stop the Steal\" Rally Goers Disappointed in Mainstream Media. \"They have an agenda, we don’t care to listen to their propaganda... it’s their narrative. It’s not news anymore.\""
"The Dominion software story keeps getting worse: the person in charge of the software’s security, is an Antifa supporter and Trump hater"
"The Modern Left Is Not Marxist, It's Worse"
"17 Pro-Life Women Elected To Congress In ‘Historic Surge’ Of Female GOP Victories"
"Mass exodus from NYC is happening as New York state to lose $1.4 billion in tax revenue: report"
"Trump allies raising millions for new conservative TV network: report"
"Outgoing Diplomat Admits Lying to President Trump About American Troop Numbers in Syria"
"‘Threat To Democracy’: CNN Sounds Alarm Over Conservatives Leaving Twitter, Facebook | The Daily Wire"
"Milwaukee news anchor suspended after wishing Mitch McConnell died instead of Alex Trebek"
"Refusing To Apply The Law To Leftists Is Normalizing Political Violence"
"Orange County, California plans audit of 2020 presidential election ballots"
"Biden’s Tax Returns Prove He’s a Scrooge When It Comes to Donating to Charity"
"Fox News Wins Award For RUDEST Interview, Is This CNN...🔊"
"NASA boss Jim Bridenstine may resign if Joe Biden takes control of the White House, which would likely delay the 2024 Moon Landing and subsequent Mars colonization mission"
"Newsmax is benefitting in huge fashion from Fox News driving away its audience, will the media landscape shift as a result?"
"Trump Campaign Rejects Media Reports of Changed Pennsylvania Case"
"60 Minutes’ Scarily Ignorant Interview of Barack Obama. Interviewer Scott Pelley of 60 Minutes supplied the ignorance. Obama supplied the scare. His solution to make the right half of America as ignorant as the left."
"Democrats reportedly lambaste party's embrace of far-left policies, socialism: 'It's killing us'"
"Companies Are Preparing to Cut Jobs and Automate if Biden Gets $15 Minimum Wage Hike, Reporting Shows"
"Stacey Abrams: ‘More Than 600,000’ Georgians Have Already Requested Mail Ballots for Runoff Election"
"Obama, with a net worth of $70MM, calls Trump 'Richie Rich'"
"Today Governor Cuomo threatened to sue the Trump administration if it moves ahead with its COVID-19 vaccine-distribution plan, which he called discriminatory — after the president threatened to move New York at the back of the line for getting the shot."
"Police Ignore BLM Attacks on Restaurant Patron, Staff in San Francisco Suburb"
"Fauci’s Own Family Turns On Him – Says They Can’t Stand Behind His Flip-Flopping on COVID"
"Trump Allies Considering Raising $200 Million For Fox News Alternative | The Daily Wire"
"Small-Town Trump Rally One Of Many Unreported By Corporate Media -- The corporate media gave little to no coverage of the organic Trump rallies that erupted in cities and towns across America in solidarity with the DC march."
"The U.S. Economy’s Remarkable Recovery Continues As Biden Plans To Crush It"
"'Total Media Blackout' as Antifa Launches Attacks on MAGA Rallygoers in D.C."
"Trump Allies Considering Raising $200 Million For Fox News Alternative | The Daily Wire"
"Gov. Whitmer closing high schools, colleges, in-person dining, casinos, movie theaters"
"Silicon Valley eager for Biden to reverse Trump visa rules, hire more immigrants"
"The Portland, Ore. politician who called the cops over an argument with her Lyft driver despite her support for the “defund the police” movement now says she acted out of a fear of “white supremacists.”"
"URGENT: We Will Not Win in Georgia Unless YOU Get Involved, Call the Governor NOW | Sean Hannity"
"Biden Called Out For Silence As Leftists Attack Pro-Trump Demonstrators In Nation’s Capital | The Daily Wire"
"Black Lives Matter And Antifa Assault Trump Supporters After DC March"
"Recall Whitmer"
"The 2020 election took place under a Trump-declared “National Emergency” that set an Election Day trap for the “unauthorized accessing of election and campaign infrastructure”"
"The Housing Bubble is Even Bigger Than the Stock Market Bubble"
"The inevitability of Trump 2024 - As long as there is an audience, he will go on"
"Mathematical Election Fraud Analysis (likely in Pennsylvania and Georgia) + Map"
"The COVID Lockdown Rut. Biden’s ‘new’ plan is more of the same insanity: life lived through our smartphones and screens."
"Judge Jeanine: \"Don't you DARE ask us to go quietly into the night!\""
"Over 300,000 People Have Fled NYC Due to Coronavirus, Crime"
"Twitter Claims Trump Conceded, He Counters: “I concede NOTHING!”"
"Quit Twiter/Facebook/Google seriously"
"California Voter: Voter Suppression Looks Like Communism. \"They controlled newspapers, the controlled the media, they tried to get everybody to support them, when it turns out to be all lies”"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"First black woman crowned Miss USA deemed ‘gun-loving Trump fan’ and the left can’t handle"
"Dershowitz: Trump May Seek to Deny Biden 270 Electoral Votes, Put Election in Congress"
"Government Incompetence: The Real Pandemic of 2020"
"Trump: Antifa Waited Until Most People Left MAGA Rally to Attack"
"Peter Neffenger, chairman of the board of Smartmatic voting software used by Dominion is on Joe Biden's DHS transition team."
"Not-So-Magic Mike? Bloomberg Spent $100M in 3 Key States That Trump Still Won"
"Portland politician who called 911 over Lyft spat blames ‘white supremacists’.....🤔🤔"
"Leftist Goons Gruesomely Stomp on Trump Supporter’s Head After MAGA Rally"
"‘Things Are Going to Get Easier’: E.U. Dreams of a Subservient U.S. Under Joe Biden"
"3 Ways The GOP Must Tackle Vote Fraud And Election Bungling Right Now -- More could have been done earlier about big-city voting machines, vote tracking and accountability, and the Democratic Party's long-sought unlimited mail-in voting rules."
"If the election does go to the state legislators, that’s where we all come in. Trump supporters have to put so much pressure on these legislators that they do what’s right, not what’s easy."
"Conservative Treehouse Being De-Platformed"
"WATCH: D.C. Cops Direct Trump-Supporters into Gauntlet of Protesters, Do Nothing When They Are Assaulted"
"Gov. Cuomo: Trump Attacks Me Over COVID Vaccine Because 'He Doesn't Like That I Criticize Him' -- 'Typical Bully'"
"Man Begs Internet To Stop Making Him Defend Trump"
"Sanders 'Fully' Expects Biden to Back the Biden-Sanders Manifesto: 'These Are Not Far-Left Ideas'"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"It's a Coup. Just say it!"
"Portland city commissioner blames 'white supremacists' for fact she called cops on her Lyft driver in argument about open windows"
"Watergate journalist is now pro-outing anonymous sources"
"In Order To Bring Peace On Earth, Liberals Are Willing To Destroy It"
"Voters Had a Chance to Reject COVID Tyranny, Now a Price Will Be Paid"
"Ukrainian-Born US Rep.-Elect Victoria Spartz: 'I Grew Up in a Socialistic Country'; 'It's Not Pretty'"
"Trump attorney Rudy Giuliani claims presidential election will be ‘overturned’"
"Jim Acosta: After January 20th, Trump Will Become 'Another Crackpot on the Internet' (How the hell does Acosta think that Trump will magically become Acosta after the swearing in?)"
"Citizen journalist could be jailed for reporting on COVID-19 outbreak in Wuhan"
"Music prof pushes to purge 'dead white guys' in 'national overhaul' of curriculum"
"WordPress deplatforms The Conservative Treehouse for no reason"
"Massive Turnout For ‘Million MAGA March’ In Washington, DC Saturday"
"House.gov › republicans-oversight › ... Hice: GSA Administrator Must Adhere to Constitution, Past Precedent in ..."
"Election Fallout Reveals Battle Between Freedom and Communism"
"Arthritis drug cuts COVID-19 deaths in hospitalized patients by two-thirds: study"
"Andrew Yang: Democrats need to adopt message that government is 'working for them'"
"Faced with needs, voters unsurprisingly chose school choice"
"With SpaceX &amp; NASA’s successful launch of the historic “Crew-1” mission tonight American astronauts are headed to space from US soil for the first time since 2011. Scheduled to rendezvous with the International Space Station on Tuesday"
"After COVID-19: The Next Crackdown, or at Least a ‘Reset’ (Spoiler: Climate Change)"
"A Book for Our Times: Peter Wood’s 1620 Skewers 1619 Project"
"Biden Campaign Operative, Texas State Senator Accused of Mail-in Ballot Fraud"
"“The First Thing We Do”: The Lawless Campaign To Harass Lawyers Representing The Trump Campaign"
"Tapper With Fauci: 'Christmas Is Probably Not Going To Be Possible' This Year"
"Pelosi, Hoyer supposedly telling members not to join Team Biden"
"Steven Crowder Surpasses \"The Young Turks\""
"House leaders urge Congressional Democrats not to join Biden administration because their majority will be razor thin"
"James Woods exposes dozens of local news shows reading from the same (Biden) script"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"Burgess Owens gets stronger lead over Ben McAdams in 4th district with latest ballot drop"
"The Revenge of the Yankees"
"Bernie pushes Biden to adopt socialism: Sanders says majority of Americans support a 'far-left agenda' - and he'd like a position in Joe's cabinet"
"Scottish Hate Crime Bill Could Criminalise ‘Inflammatory’ Bible"
"Who's Racist?"
"Democrats, Media Stand On The Graves Of European Jews To Hit Trump"
"Dear Media: Give Us a Break About ‘Healing’ and ‘Coming Together’ — It’s Not Happening"
"Was Election Software Rigged? Sidney Powell Lays Out the Trump Team's Findings."
"Trump Campaign Files Suit, Asks Judge to Block PA From Certifying Election Results. Filing states that PA \"county officials illegally allowed voters to use deficient ballots to cast replacement absentee mail-in ballots\""
"Giuliani: Trump 'Far From' Conceding Election To Biden"
"Trump coronavirus adviser Scott Atlas urges Michigan to 'rise up' against new Covid-19 measures"
"A Post-Trump Foreign Policy Should Keep America First. Here’s How -- Whenever Trump leaves office, Republicans should devote themselves to fleshing out elements of his agenda that went unfulfilled. Foremost among these should be foreign policy."
"Sidney Powell gives details about the election fraud Kraken"
"Incarcerated Texans asked to work"
"More Protective MAGA Helmets Now Available For Trump Supporters Brave Enough To Go Out In Public"
"New Pentagon chief tells US troops that 'it’s time to come home'"
"Happening This Week: More Than 2000 Leaders From Governments, Businesses Talk About \"The Great Reset\" - Radical Proposals For Global Economic Change"
"Fauci Showed Breakthrough Pfizer COVID Vaccine Results To Biden Before Trump"
"Rudy Giuliani: 'Dominion Shouldn't Be Counting Votes Anywhere'"
"Obama: Why Did Populist Republicans Rally Around 'Richie Rich' Trump?"
"Sidney Powell: 'We're Fixing to Overturn the Results of the Election in Multiple States'"
"'Total Media Blackout' as Antifa Launches Attacks on MAGA Rallygoers in DC"
"Trials Show Operation Warp Speed Partner Moderna's COVID Vaccine Is 94.5% Effective"
"Tens of thousands attend Million MAGA March"
"FAQ about State Legislators, the Constitution and how the Election is Decided. \"The Constitution gives state legislatures power to determine how electors are appointed. This power was reaffirmed by the Supreme Court this year.\""
"Andrew Cuomo tells mostly empty NYC church, 'Abuse of power is a virus'"
"Instant karma..."
"\"Who owns the future? Dems or GOP?\" -Patrick Buchanan"
"Obama Compares Trump to Dictator -- 'There Has Been a Sense' He Would 'Do Anything to Stay in Power'"
"Jason Whitlock with Tucker on the left use language to control black Americans (Video)"
"Mainstream Conservatives Need To Wake Up &amp; Recognize What We're Dealing With"
"NY Post: How much research funding did Biden's cancer charity provide?"
"Why did Donald Trump do better than expected in the U.S. election?"
"Imagine a nation wide bi-partisan effort of a canvass and observed vote count."
"Joe Biden’s cancer charity spent more than $3.7million on staff salaries but distributed ZERO towards research grants over two years, tax filings reveal"
"Wheel of Climate Change"
"After the Minneapolis City Council Caused a Major Crime Wave, They Just Approved $500,000 to Fund Outside Police"
"Biden’s Foolish Immigration Priorities"
"Report From John Durham Coming 'Real Soon,' Says Rep. Jim Jordan"
"BLM and anti-fascist supporters attack multiracial family at Million MAGA March"
"Why a Mandatory COVID Vaccine is Unconstitutional"
"Here We Go: Fauci Suggests That Christmas Could Be Cancelled"
"Sen. David Perdue: Winning Georgia Senate Seats Is ‘The Last Line Of Defense Against This Liberal Socialist Agenda’"
"Always Never Trump"
"Twitter flags Nikki Haley for saying obviously true things"
"Sharyl Attkisson: Media plotted to destroy Trump, cover for Biden"
"Woke Terrorists Want Gina Carano Fired Because She Is Not A Leftist"
"Indonesian men forced to do push-ups and dig graves as punishment for not wearing coronavirus masks"
"And with the vaccine, Commonpass is coming."
"Can Democrats Give Up Identity Politics &amp; White Guilt?"
"After Four Years of ‘the Resistance,’ Trump Is Right to Challenge the Election Results: If denying President Trump’s legitimacy for the past five years was okay, why is taking this one to court suddenly a threat to democracy?"
"Elderly Trump supporter attacked, protesters shoot fireworks at diners, surround hotel of Million MAGA March attendees"
"Democrat Argues White Democrats And Hispanics, Asians, View ‘Socialism’ Differently | The Daily Wire"
"A picture of President Calvin Coolidge's pet lions—who were named \"Tax Reduction\" and \"Budget Bureau\""
"Joe Biden Promises to Raise Annual U.S. Refugee Target by 800%"
"Over 300,000 People Have Fled NYC Due to Coronavirus, Crime"
"Here's Why the Pollsters Underestimated the Trump Vote By So Much (1.5-minute audio clip from The All-In Podcast)"
"A Quarter-Million Wisconsin Voters Claimed To Be “Indefinitely Confined” And Not Bound By Voter ID"
"What’s the most expensive tweet in Twitter history? I nominate Kathryn Murdoch’s post-election tweet, “We did it!” The corruption of Fox News triggers flashbacks to the fall of the former dissident website Drudge Report, which went full Never Trump."
"Bill Maher Owns Libs, Who Think 'Silence Is Violence and Looting Is Not'"
"'This is extremely dangerous to our democracy': James Woods tweets video showing the memo has gone out"
"Let's get ready to RATIOOO! Dems claiming Biden will 'restore the soul of this nation' as Biden supporters BEAT on Trump supporters in DC BACKFIRES"
"U.N. Chief Guterres Wants End to Coal-Fired Power in Reset World"
"Why do COVID death rates seem to be falling?"
"Like My Friend Franz Kafka, I’ve Got The Best COVID Rules For Joe Biden -- Restaurants must close at 10 p.m., except on Wednesdays, when they must close at 9 p.m., and Sundays, when they must close at 3 p.m. but cannot open until 4 p.m."
"Congressional Democrats had raised security concerns about Dominion, other voting machine companies"
"David Perdue Declines to Debate Democrat Jon Ossoff"
"Why Trump supporters are here for good"
"Covid-19: politicisation, “corruption,” and suppression of science"
"More than 300,000 New Yorkers have fled amid the pandemic"
"South Dakota Gov. Noem Won't Enforce Biden's Mask Mandate Tyranny"
"The Grand New Party: Here’s What’s In Store For The Republican Party Without Trump At The Helm"
"Jon Meacham Fired By MSNBC for Failure to Disclose Writing Biden Speech He Praised On The Air"
"Portland Official Who Called 911 After Lyft Driver Canceled Ride Says She Feared ‘White Supremacists’"
"[An oldie but a goodie, and maybe our national future under Biden/Harris] Wisconsin’s Shame: ‘I Thought It Was a Home Invasion’"
"Cuomo threatens to sue Trump administration over vaccine distribution plan"
"‘Bury Trump In A Nazi Graveyard,’ Alec Baldwin Says | The Daily Wire"
"Bolton: GOP Leaders Need to Explain to Trump Voters He Lost"
"Ilhan Omar: Biden Won Because Of GOP ‘Chaos’ | The Daily Wire"
"Pack it up, folks...looks like Christmas is getting canceled..."
"Why Democrats Lost So Many South Texas Latinos—the Economy. Party messaging didn’t resonate in socially conservative border communities fearful of Covid-19 shutdowns and the loss of well-paid oil-industry jobs"
"Violence occurs after rally in the nation's capital; Trump calls out Antifa"
"House leaders urge Democrats not to join team Biden to maintain majority"
"The Online Learning Crisis"
"CSPAN Clip: Biden describing the dying off and replacement of whites in America"
"Why Democrats Nearly Lost the House"
"Vincent James: Trust the Science; Lockdowns Are a Mistake"
"Fauci: Coronavirus Task Force Should Begin Meeting with Biden's Transition Team"
"Georgia Senate candidate Raphael Warnock: People in US need to 'repent' for Trump and 'worship of whiteness'"
"Biden wants mask mandates nationwide: ‘We can save tens of thousands of lives"
"Robert Rabon, longtime Horry County GOP leader, dies from COVID-19 complications"
"'If you have to sleep with her, do it': a Hunter Biden-linked firm's pursuit of Russian money"
"Raphael Warnock's radicalism is catching up with him"
"Professor: Trump rose because government hasn’t served the people"
"Like Cruel Scientists Who Torture Dogs, the Democrats Want to Teach Us Learned Helplessness"
"Thousands of disheartened families yanking kids out of NYC public schools"
"The New “Progressive” McCarthyism"
"Meet the Man Who Was Our First Multiracial Vice President"
"Biden Cancer Charity Spends Entire Budget On Salaries, Zero On Research"
"The fine print behind the 90% efficacy for the Pfizer vaccine"
"Steven Crowder becomes the largest independent news channel after surpassing The Young Turks"
"Gov. Inslee bans indoor gatherings and dining as part of new COVID-19 restrictions"
"Social distancing, masks still necessary after getting COVID-19 vaccine: Fauci"
"Biden cancer \"charity\" spent millions on salaries, zero on research"
"Was Election Software Rigged? Sidney Powell Lays Out the Trump Team's Findings."
"Fauci: Social Distancing, Masks Still Necessary After Getting Coronavirus Vaccine"
"38 percent of Americans planning on having Thanksgiving dinner with 10 or more people"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"California, Love It and Leave It"
"Confirmed: Biden Cancer Initiative Spent on Salaries -- and Little Else"
"Pro-Trump Wisconsin Lawyers Spike Election Lawsuit on Morning of Court Hearing"
"Left Cheers Harry Styles In Dresses; Candace Owens Pushes Back In Viral Tweet | The Daily Wire"
"Sanders to Trump: ‘Man-Up’ and Say You Lost the Election"
"15 Asia-Pacific countries sign world's largest free trade agreement in coup for China to extend influence"
"The Great Reset; How Much Do You Know &amp; Should You Be Frightened?"
"Fury as Mayor tells Chicago to CANCEL Thanksgiving over Covid…days after celebrating Biden win maskless in crowd"
"Scoop: Trump plans last-minute China crackdown"
"Joe Lonsdale: California, Love It and Leave It"
"A New Agenda for the GOP"
"Bill de Blasio’s pandemic bungling"
"Alito: Senators' Threats In 2A Case \"Affront To The Constitution\""
"The Biderman report"
"Media Praise Joe Biden’s ‘Solid Catholic Faith’"
"Scientific study shows COVID19 in Italy since September 2019"
"Biden Transition Official Believes the First Amendment Has a 'Design Flaw' -- His Remedy Is to Curb Free Speech"
"Young Kim Flips Blue California Seat Red, Second CA GOP Pick-Up Of Election | The Daily Wire"
"UT’s Kraken Named World’s Third Most Powerful Computer, ORNL’s Jaguar No. 1"
"DHS boss Chad Wolf defies Trump order to fire cyber chief Chris Krebs"
"Election Observer Explains How Nursing Home Vote Fraud Works"
"Fauci: Don't abandon masks, social distancing after getting vaccine"
"'Far from over': 'MAGA' diehards pledge allegiance to Trump at Supreme Court"
"Trump lashes out after campaign reportedly scraps key claim in Pennsylvania suit"
"A Cautionary Note to Antifa and BLM Thugs Contemplating “Civil War”"
"'I'm NOT Hunter Biden, lunchbox.' Dana Loesch takes down HORDE of frothy-mouthed, chest-thumping harpies trying to #FireGinaCarano"
"Florida Republicans win recount, flip key Senate seat in Miami"
"Oregon Gov. Kate Brown says large parties could trigger fines or jail time during coronavirus ‘freeze’"
"Fauci: Social Distancing, Masks Still Necessary After Getting Coronavirus Vaccine"
"Antifa and BLM Come to DC Rally Where They Are Outnumbered -- They Should Have Stayed Home"
"Lockdowns Haven't Brought down Covid Mortality. But They Have Killed Millions of Jobs"
