"2020 Election Recap, Discord Chat, and What’s To Come"
"Saturday Morning Political Cartoon Thread"
"Jared and Ivanka are poised to return to a Manhattan social scene that no longer welcomes them"
"Trump is going out the way he came in: A loser, a liar and a cheat"
"Trump Puts Democracy To The Test After Losing Presidency To Biden : For the first time, a sitting U.S. president tries to convince voters to not believe results clearly showing he lost."
"Deb Haaland says 'of course' she would serve as Interior secretary under Biden; she would be the first Native American in the Cabinet, and overseeing public lands."
"Minnesota GOP sent virus alert only to its side of the aisle"
"Biden Stocks Transition Teams with Climate Experts"
"A Judge Found Republicans' Claims Of Vote Fraud In Detroit \"Incorrect And Not Credible\""
"Secret intelligence exists that ‘would cast Trump in very negative light’, warns ex-FBI chief"
"Sen.-elect Tommy Tuberville botches history facts, including three branches of government"
"Project Veritas could face legal liability for postal worker's ballot fraud allegations, experts say"
"Two accused 'dead' Georgia voters very much alive despite claims - and they voted legally; 11Alive confirmed that two of the four Georgia voters the president accused of fraudulently voting “dead” are alive."
"'The American public can’t wait two more months' for a new coronavirus stimulus deal, Ohio senator says"
"Republicans are playing with fire. And we all risk getting burned | The party is challenging the outcome of the election without any proof of fraud. Their degradation of democracy will reverberate for years to come"
"Lawyers decided to quit Trump case after chaotic Four Seasons Landscaping press conference"
"250,000 Dead Americans by Thanksgiving as Trump Keeps Tweeting | The entire country is being crushed by the virus, Trump doesn’t care, Biden does, but he can’t do anything about it."
"Joe Biden's popular vote share is third largest by presidential challenger in election history"
"Trump puts personal lawyer Rudy Giuliani in charge of all election lawsuits"
"Obama says Biden's margin of victory over Trump is bigger than Trump's margin over Clinton in 2016"
"Obama White House Veterans Urge Biden To Embrace Executive Action"
"DHS Admits It Likely Made False Statement to Federal Court When Justifying Chad Wolf’s Appointment"
"Judges rule against 6 Trump campaign lawsuits to invalidate nearly 9,000 Pennsylvania ballots"
"Donald Trump lost the 2020 election, but misinformation will continue to win"
"Trump-appointed election official says president’s claims are ‘baffling’ and court evidence ‘laughable’"
"Tucker Carlson issues on-air apology over Georgia voter claims"
"‘Personal responsibility’ isn’t working. We need mask mandates."
"Georgia's Blue Shift Is A Lesson For Progressive Organizers Across The South"
"Detroit Police Chief admits to treating 'peaceful' Trump supporters differently than Black Lives Matter protesters"
"Fake posts promoting 'free pancakes' at Trump Hotel before DC rally spread on social media"
"Milwaukee wants to raise fines for COVID violations to as much as $20,000 as only 8% of state's ICU beds remain open"
"Pelosi cancels dinner for new members of Congress after Covid backlash led by Chelsea Clinton"
"Adrian Tam defeats local Proud Boys leader, becomes only gay Asian American in Hawaii House"
"Educator on Betsy DeVos: I feel like I’m graduating from ‘meanest, pettiest, most critical teacher I ever had’"
"Trump greets hundreds of supporters descending on D.C. to falsely claim he won election"
"Biden demands urgent federal COVID action as Trump feuds with Cuomo"
"Mike Pence suggests the Trump administration will be in place for four more years despite Biden victory: 'That's the plan'"
"“Everyone With Self-Respect Will Steer Clear”: For Ivanka and Jared, the Post–White House Future Is an Island Alone"
"Batter Up! Twitter Saboteurs Hijack 'Million MAGA March' Hashtag With Pancake Tweets"
"Biden Asked Republicans to Give Him a Chance. They’re Not Interested."
"Giuliani wrecks Trump campaign's well-laid legal plans"
"Mark Kelly reflects on using McCain's old desk: 'He was a hero of mine'"
"Two \"dead voters\" cited by Trump as proof of Georgia ballot fraud are alive"
"Fox's Lou Dobbs Has Full-On Election Meltdown: Denies Trump What's 'Rightfully His'"
"Senator-elect Tommy Tuberville flubs basics of the Constitution, World War II and the 2000 election."
"Stacey Abrams focuses on next step, Georgia’s U.S. Senate runoffs"
"'You Lost': Chris Evans Lambasts Trump and Four Seasons Landscaping Gaffe"
"Thomas Friedman on GOP: This is not a political party. It's a cult"
"Rep.-Elect Cori Bush Wore a Breonna Taylor Mask. Some Republicans Thought It Was Her Name."
"\"Is that too socialist too?\": AOC pleads for second stimulus checks and rent forgiveness as pandemic rages"
"One-Time Stimulus Checks Aren’t Good Enough. We Need Universal Basic Income."
"The lack of a new stimulus bill may have contributed to surging virus cases amid reopening pressures, experts say"
"Trump Again Boasts He Won Pennsylvania And Georgia; Twitter Slaps Him Down"
"K-pop fans protest pro-Trump rally with pancake tweets"
"Lincoln project ad accuses GOP of \"acting like China, Iran, North Korea\" for refusing to accept Trump's election loss"
"Count on Biden to Restore the National Monuments Trump Trashed"
"Georgia Democrats Ask Judge to Shut Down Trump Supporters’ Lawsuit: This ‘Gambit’ Is Backed by No ‘Concrete, Credible Evidence’"
"Chris Hayes explains how the GOP is already setting ‘booby traps’ for Biden"
"Trump Is Going Out Like He Came In: With His Press Secretary Lying About Crowd Size"
"Biden Wants Census To See 'Invisible' Groups: LGBTQ, Middle Eastern, North African"
"CDC: Wearing a mask could keep you from catching virus"
"Trump had a very bad Friday in court with his election cases. They're headed for more action next week"
"Trump puts Giuliani in charge of election lawsuits: report"
"Vaccine czar calls on Trump to allow contact with Biden - Operation Warp Speed head warns thousands of lives at stake if project interrupted."
"COVID is threatening the economy. So is McConnell and the GOP"
"How did North Dakota's COVID-19 outbreak become the worst in the country?"
"Giuliani Time: Trump Taps Rudy To Lead Legal Challenges That Are Going Nowhere"
"San Diego elects first openly gay mayor"
"Oops, My Bad: Charles Koch Says He Regrets Dividing the Country, but Not Enough to Stop Funneling Shit Tons of Money to Republicans"
"‘Huge Loss’: Trump Loses Two Pennsylvania Mail-in Ballot Cases within Hours"
"Up to 23,000 new young voters could make a difference in Georgia runoff race, analysis says"
"Zuckerberg: Bannon's beheading comments aren't enough to ban him from Facebook"
"Beyond irresponsible: Republicans must put Americans and reality ahead of fealty to Trump | Republicans are embarrassing America. It's past time to admit Trump lost, congratulate Biden, stop spouting misinformation and move on to a transition."
"Republicans try packing the Fed before Trump exits"
"New Alabama senator struggles with basic WWII history and says US fought ‘socialism and communism’"
"Ossoff races to quick start on the Senate runoff campaign trail"
"Justice Alito speech on polarizing issues prompts calls to reform Supreme Court"
"Inmates help move bodies as they pile up at El Paso Medical Examiner’s office"
"Democrats need to clearly embrace popular, progressive policies or they will continue to fail in down ballot elections"
"Trump Could Lose Far More Than the White House"
"Trump’s Post-Election Power Grab Isn’t Just Selfish, It’s Dangerous to Democracy"
"Prosecutors who AG Bill Barr dispatched to investigate Trump's evidence-free claims of mass election fraud say they found no substantial irregularities"
"Outgoing President Crawls Out From Safe Space, Remains in Denial"
"Resurfaced Clips Show Donald Trump Saying 306 Electoral Votes Is a 'Landslide' in 2016 After Biden Wins Same Amount in 2020"
"Amend the Constitution to Prevent Another Trump"
"Trump to face ‘subpoenas and seizures’ following presidency, ex-Manhattan prosecutor says"
"Trump Says New York Won’t Get Vaccine Right Away Because He’s a Petty Little Bitch"
"The $15 Minimum Wage Won in Florida, But Biden Didn't. Here's Why — Activists say the key was actually talking about working-class issues."
"Trump’s far-fetched legal campaign to question the election seems to be falling apart"
"Biden is considering Janet Yellen for Treasury Secretary, potentially making her the first woman to hold the role: report"
"Two firsts: San Diego elects openly gay mayor of color"
"U.S. could see 13 million more COVID cases before Biden is sworn in as president"
"Advocacy Groups Slam 'Shameful' Deportation of ICE Medical Abuse Survivors | \"Congress must investigate and immediately put an end to this injustice,\" said one attorney."
"Democrats Work to Defy History in Georgia Runoffs That Have Favored G.O.P."
"\"That was in the teleprompter\": Fox News host casts doubt on news he just read about lack of voting irregularities"
"Alaska Congressman Who Mocked Coronavirus As ‘Beer Virus’ Now Infected"
"MAGA march: Kayleigh McEnany falsely claims ‘one million’ demonstrators in DC for protest"
"Why Parler's facing the same constraints conservatives fled on Twitter, Facebook, and YouTube"
"North Dakota issues statewide mask mandate to stem spread of COVID-19"
"New York attorney general threatens Trump with lawsuit if he denies state access to ‘life-saving’ vaccine"
"Almost Every U.S. State Is Now Officially a Coronavirus Hot Spot | This is what an utter pandemic catastrophe looks like."
"After $15 billion and 450 miles, Joe Biden will halt border wall, Trump’s signature project"
"Trump to rush drilling leases in Arctic before Biden takes over"
"Arizona GOP Senator Martha McSally finally concedes to Democrat Mark Kelly"
"Before Biden inauguration, 70,000 more could die from COVID-19 in the U.S."
"Oklahoma Spending Millions In COVID-19 Relief Funds On Renovating Welcome Centers"
"Lincoln Project resurfaces Kellyanne Conway tweet calling 306 electoral votes 'historic'"
"Trump rails against Georgia Gov. Kemp for consent decree aimed at helping minority voters"
"Counter-protesters ready to rally against 'Million MAGA March' attendees Saturday"
"Bush v. Gore Lawyer Tells Federalist Society That 2020 Election ‘Is Over’ — It's time to accept Joe Biden as the president-elect."
"Philadelphia suburbs return with a vengeance to oust Trump"
"Trump Camp Forced To Shut Down Absurd Voter Fraud Hotline Due To Ceaseless Prank Calls"
"US sees record 184,000 new daily Covid cases as Trump politicises vaccine effort"
"‘They know their vote matters’: the Georgia Senate runoffs battle is already on | Trump’s defeat in the reliably red state has shown Democratic voters the power of their ballot, activists say as they focus on Ossoff and Warnock’s races"
"It’s Time to Hunker Down | A devastating surge is here. Unless Americans act aggressively, it will get much larger, very quickly."
"Rudy Giuliani is reportedly taking charge in Trump's election legal battles — and Twitter is having a field day with it"
"John Kelly says Trump hurting national security by delaying Biden transition"
"With final races called, Biden ends with 306 Electoral College votes, Trump 232: Edison Research"
"Cindy McCain says late husband would have wanted country to 'move on' from election"
"Trump Taps Giuliani to Lead Election Lawsuits After Disastrous Day of Losses"
"Americans flock to social media platforms where misinformation goes unchecked"
"Trump's Voter Fraud Claims Are Now Being Debunked By His Own Government"
"AP Fact Check: Trump tweets a tall tale of ‘deleted’ votes"
"Trump says coronavirus vaccine won't be delivered to New York"
"Christiane Amanpour compares Trump administration ‘assault on values’ to Kristallnacht"
"President Trump threatens to withhold COVID-19 vaccine from New York in new feud with Governor Cuomo"
"2020 exit polls: As the racial gap closes, the Democrat-Republian education gap widens"
"John King: If Trump thinks 2016 was a landslide, 2020 is as well"
"Joe Biden Declared Winner in Georgia, Taking Electoral College Tally to 306"
"By Team Trump's standards, Biden has now won in a 'landslide'"
"Trump Takes Credit For 'Most Secure Election Ever' But Says It Was 'Rigged'"
"Biden likely to break barriers, pick woman to lead Pentagon"
"Trump Almost Admits He Lost Election, Says 'Time Will Tell'"
"Trump forced to drop ‘voter fraud’ hotline after it was swamped by prank calls from teenagers on TikTok"
"Chelsea Clinton blames Trump for Secret Service officers in quarantine"
"‘Respect the Will of the People’: Democratic AGs Call Out Bill Barr for DOJ’s ‘Un-American’ Election Interference"
"White House Press Secretary Kayleigh McEnany Wildly Exaggerates Trump March Crowd Size"
"New York Times: Rudy Giuliani put in charge of Trump's election lawsuits after series of losses"
"Biden plans to reach across the aisle – but is he walking into a Republican trap?"
"Prosecutors ask Barr to rescind memo on U.S. vote counting irregularities - Washington Post"
"Conservatives value personal stories more than liberals do when evaluating scientific evidence | When science and anecdote share a podium, you must decide how to value each"
"Organizers look to build off momentum and turn out a new batch of young voters in Georgia's runoffs"
"GOP leaders in 4 states quash dubious Trump bid on electors"
"13 million more Americans could get COVID-19 before Inauguration Day: report"
"Joe Biden Calls on Americans to 'Step Up,' Wear a Mask and Social Distance as COVID Spikes"
"Joe Biden Has Won Georgia. He’s The First Democrat To Win The State In Decades."
"Texas Attorney General sued by 4 whistleblowers claiming he 'believes he is above the very law' he upholds"
"'This Is a Really, Really Big Deal': Michigan Gov. Moves to Shut Down Line 5 Pipeline to Protect Great Lakes"
"Barack Obama says Congress' lack of action after Sandy Hook was \"angriest\" day of his presidency"
"Pompeo’s meetings in France to be held in ‘complete transparency’ with Biden team, says Macron"
"Alleged Michigan kidnapping plot included setting Capitol on fire: Prosecutors — Investigators said that there was also a second alleged plan."
"No longer mirror of US, Ohio’s electoral bellwether quiets"
"Stop the Steal's massive disinformation campaign connected to Roger Stone"
"Plot to kidnap Gov Whitmer also included plan to burn down Capitol"
"Biden wins Georgia as Trump continues unsupported fraud claims, secures North Carolina | U.S. president-elect's legal team confident Georgia recount won't change results"
"How a post-election crisis was manufactured in Pennsylvania"
"The purge at the Pentagon - The potential for sudden troop withdrawals should spur Congress to curtail Trump’s powers in his final weeks as president."
"The 'dead voters' in Michigan who are still alive"
"The Trump Campaign Can’t Find a Judge Who Will Ignore Facts — but It’s Trying"
"White House press secretary Kayleigh McEnany insists that Trump will attend 'his own' inauguration in January"
"10% of Secret Service officers sidelined by COVID: ‘These are the things they did not sign up for’"
"A Supreme Court Justice Went on A Rant About COVID, Abortion, and LGTBQ Rights - Justice Samuel Alito is very concerned about \"religious liberty.\""
"How Western media would cover the U.S. election if it happened in another country"
"In Trump’s final days, a 30-year-old aide purges officials seen as insufficiently loyal"
"Sacramento Pushes To Get Flu Shot To Underserved Communities As A ‘Dry Run’ For Potential COVID-19 Vaccine"
"Trump supporters chant 'Four more years!'; at Washington rally as he pushes false election claims"
"Trump Campaign Gets Laughed Out Of Court For Claiming A Bunch Of Unvetted Webform Submissions Is 'Evidence' Of Voter Fraud"
"Trump wavers between reality and election fiction with eye on his legacy during Rose Garden vaccine address"
"Trump, for once, listened when aides told him to lay low"
"Mississippi officially changes state flag that previously had confederate battle flag."
"With 'Irrevocable Injustice' on the Line, Democratic Lawmakers Demand Trump Admin Put Brakes on Federal Killing Spree"
"Federal prosecutors assigned to investigate election fraud denounce William Barr's policy change"
"How hate for Trump may have triumphed over love for Biden — and Trump"
"Sore loser or victim? Trump voters struggle with president’s role in defeat."
"Trump cheered as motorcade drives through far-right ‘Million MAGA March’ rally in DC"
"Obama’s New Book Reveals Genuine Praise For George W. Bush’s Transition Team | Bush graciously did “all he could” to ease the transition between administrations, Obama wrote in “A Promised Land.”"
"Postal Workers saved the election, now they need help to stop privatization"
"Trump campaign files election lawsuit at wrong court in latest blunder"
"Arizona Election Witness Confesses to Being Trump Campaign Lawyer's Business Partner in Court"
"Biden’s Education Department Will Move Fast to Reverse Betsy DeVos’s Policies"
"Trump’s Men in Moscow - Russian Media Revels in Trump’s Nonsensical Claims of Fraud as Enemies of Democracy Reap Propaganda Harvest."
"Biden solidifies win with Georgia victory as Trump appears to hint at presidency changing hands"
"With final races called, Biden takes 306 Electoral College votes, Trump 232: Edison Research"
"In speech seen as politically jarring, Supreme Court justice from N.J. raises concerns over COVID restrictions"
"Nevada Governor Steve Sisolak tests positive for COVID-19"
"The US president-elect is interested in Australia's COVID-19 response. This is what Scott Morrison sent Joe Biden's team"
"Biden’s victory came from the suburbs"
"More than 130 Secret Service officers are said to be infected with coronavirus or quarantining in wake of Trump’s campaign travel"
"'Self-pardon' no protection for Trump from cases awaiting his presidency's end"
"President Trump taps Rudy Giuliani to take over election legal fight | Prior lawyers pulled out of a federal lawsuit in Pennsylvania FridAY."
"Nearly the whole world considers Biden president-elect"
"White men swung to Biden. Trump made gains with Black and Latino voters. Why?"
"ICE Briefly Becomes A Stranded Minor: Loses Its Twitter Account For Being Too Young"
"Trump bolts presser as reporters yell, \"When will you admit you lost the election?\""
"Cori Bush says Republican lawmakers thought her name was Breonna Taylor because of her face mask"
"Mr. President, Pack Your Bags and Be Gone | Trump wants to preserve, protect and defend only himself."
"Out Of Sight And Going Out Of His Mind. Hold Up in the White House, Trump Rages; Finally, He Feels Shame"
"Missouri governor relaxes school quarantine policies even as COVID-19 cases spike"
"Donald Trump, Kellyanne Conway’s ‘Landslide’ Boasts Come Back To Haunt Them"
"Oregon GOP Calls Governor's New Restrictions 'Orwellian,' as State Continues to Set Records in COVID Cases"
"Senator-elect Mark Kelly says bipartisanship a real mission"
"Deb Haaland: ‘Of Course’ I’d Be Interested In Being Biden’s Interior Secretary - Tribal leaders are urging the president-elect to make history by picking the Native American congresswoman to oversee public lands"
"Watch Trump Get Really Close to Admitting He Lost the Election"
"Trump administration pushes to sell Alaska oil leases pre-Biden inauguration"
"Meet Georgia’s 16 Democratic electors"
"The Oldest Man in Congress Mocked COVID, and Now He Has It - Rep. Don Young of Alaska, 87, called it \"the beer virus.\" He just announced he has tested positive for beer virus."
"King: If Trump thinks 2016 was a landslide, 2020 is as well"
"Goodbye, Golden Goose"
"Appeals court orders injunction to halt El Paso County’s shutdown order; AG calls County Judge Samaniego ‘a tyrant’"
"Virginia lawmakers say door is open to legalizing marijuana in 2021"
"Incoming GOP Senator Doesn’t Seem To Have A Full Grasp On Basics Of U.S. Govt And History"
"Alito drops pretense of impartiality, delivers political remarks"
"Trump says \"time will tell\" which administration handles COVID next, stopping short of formal concession"
"What Does the MAGA Hat Mean Now?"
"COVID-19 Hospitalizations Surge In Dakotas: 'It's Like We Opened Up A Spigot'"
"The far right is cracking up, as their violent fantasies of Trump's fascist takeover evaporate. QAnon, the Proud Boys and white nationalist groups flail around helplessly as twilight falls on the Trump era"
"Matt Schlapp’s baseless claim that 9,000 Nevada mail ballots are illegitimate"
"Federal prosecutors assigned to monitor election malfeasance tell Barr they see no evidence of substantial irregularities"
"Latino voters in Georgia get attention in high-stakes Senate races"
"Andrew Yang: Democrats need to adopt message that government is 'working for them'"
"Pennsylvania court rejects five Trump campaign, GOP legal challenges to ballots"
"A Republican House candidate prematurely claimed victory in a race to unseat Democratic congresswoman Lauren Underwood, and then went to new member orientation even after she was declared the winner"
"Another law firm bails out on Trump campaign"
"Donald Trump wants to run the Republican party even if he leaves office. Can he?"
"3 scholars say Trump isn’t staging a coup — but he still poses a threat to democracy"
"Law firm Porter Wright withdraws from representing Trump in Pennsylvania case"
"Trump \"determined\" to make Biden transition \"as turbulent as possible,\" former NSC McMaster says"
"Every day Trump refuses to get out of the way he puts our country in danger | Every Republican should be calling Trump out. No more coddling the crybaby, giving him time to come around. Our nation’s best interests can’t wait."
"After Pouring Gasoline On U.S. Divide, Charles Koch Now Claims He Wants To Heal Nation"
"Fact-checking Trump’s distortions and outright lies about the 2020 election and COVID-19 vaccine"
"Yellen Under Consideration by Biden Team for Treasury Chief"
"Discussion Thread: President Donald Trump’s News Conference on Operation Warp Speed"
"Law Firm Stops Representing Trump Campaign in Pennsylvania Suit"
"Trump will remain President-elect Biden's greatest obstacle even after he takes office"
"The crisis isn’t Trump. It’s the Republican Party."
"That’s a Wrap: Biden Takes Georgia to End Nailbiter 2020 Election"
"Trump Campaign Lawyer Comically Filed Election Lawsuit in Court That Had No Authority to Hear the Case"
"130 Secret Service officers enter quarantine after testing positive for coronavirus or being exposed to Trump"
"Meghan McCain to Trump: I like people who don’t lose Arizona"
"Trump urges Congress to pass a 'big and focused' coronavirus relief bill in 1st stimulus comments since losing the election"
"Supreme Court Justice Alito's Federalist Society speech shows how political the court will get | One of the Supreme Court's leading conservatives openly joined the culture wars, and clearly telegraphed his intentions now that he's in the majority."
"Nearly 40,000 Voted At Hawks' State Farm Arena In Georgia Race Separated By 14,000 Votes"
"People Flying to DC For the Million MAGA March"
"'It's time to get to work': Mark Kelly prepares to be sworn into Senate in early December"
"Report: Over 130 Secret Service officers either infected with Covid or quarantining"
"Top CEOs met to discuss Trump's refusal to concede to Biden"
"Raphael Warnock: I’m focused on access to affordable health care, dignity of work, voting rights"
"Video: Polis Urges Coloradans To Be Careful This Thanksgiving And Not Bring ‘A Loaded Pistol For Grandma’s Head’"
"Republican Malice Has Turned the Pandemic Into a Deadly Loop | The GOP blocks the stimulus. Nonessential businesses reopen and people go back to work because they need money. Cases surge. People die."
"The disastrous coronavirus leadership void"
"Blockhead Football Coach Elected Alabama Senator Says Blockhead Things About Non-Football Topics Like History, Government"
"Judge blasts Trump administration’s “sloppy” climate analysis in oil case"
"Europe's Populists Loved Trump, Now They Are Dropping Him Hard"
"Obama hits Trump for refusing to concede, says there's 'no legal basis' for challenges"
"Bolton urges Republicans: ‘Acknowledge the reality that Biden is the president-elect’"
"Lou Dobbs demands GOP help Trump fight for 'what is rightfully his'"
"Charles Koch claims he screwed up by creating vast partisanship in politics"
"Second Major Law Firm Representing Trump in Election Lawsuits Abandons Ship"
"Joe Biden Becomes First Democrat to Win Arizona's Maricopa County Since Truman"
"US election security groups call 2020 election 'most secure in American history"
"Trump’s attempts to challenge the election results suffer further setbacks"
"Bye, Bye, ‘Sharpiegate’: Trump Campaign Hastily Retreats from Conspiracy-Laden Lawsuit After Brutal Hearing"
"The US has been breaking new COVID-19 case records on a daily basis while Trump shares unsubstantiated voter fraud claims on Twitter"
"Trump won't run for president in 2024 because he's too scared to 'lose like this again,' says his niece Mary"
"Newsmax chief says he’d welcome Trump to his cable channel but ‘we don’t want to be Trump TV’"
"The “Real Time” host exposed just how empty the soon-to-be-former president’s allegations of widespread voter fraud really are."
"Final Trump Days Ripe for Settling Scores, Pardoning Allies"
"Rebuking Trump, DHS cybersecurity agency says no evidence of deleted, changed votes"
"First openly gay Afro-Latino U.S. congressman: 'Never in my wildest dreams'"
"Rand Paul Is a Public Health Risk"
"‘I like people who don’t lose Arizona’: As Biden officially flips Arizona, Meghan McCain celebrates"
"What Happens to Never Trump Republicans Now?"
"Al Qaeda’s No. 2, Accused in U.S. Embassy Attacks, Was Killed in Iran -- Israeli agents shot Abu Muhammad al-Masri on the streets of Tehran at the behest of the U.S., officials said, but no one — Iran, Al Qaeda, the U.S. or Israel — has publicly acknowledged the killing."
"Angus King calls Trump's refusal to share intel with Joe Biden ‘dangerous for national security’"
"Judge denies GOP lawsuit to halt certification of Detroit election results"
"New U.S. citizenship test now requires more correct answers to pass"
"Republican Congressman Says Donald Trump Has Boarded the 'Crazy Train' With His Election Claims"
"130 Secret Service Officers Are in Quarantine or Have COVID After Trump’s Reckless Campaign"
"Donald Trump keeps baselessly claiming voter fraud in cities. But suburbs actually lost him the election"
"Biden's toughest foreign policy challenge may be regaining allies' trust"
"Fox News' Chris Wallace dismisses network reporter's claim that Trump's \"winning even as he's losing\""
"Nevada Gov. Steve Sisolak tests positive for coronavirus"
"The Death Toll of Donald Trump’s Delay Tactics | Tens of thousands may die between now and President-elect Joe Biden’s inauguration."
"Biden's team says he will get daily briefings from his COVID-19 coordinator, unlike Trump who often blanks his task force for weeks"
"‘Life-Or-Death Situation’: Governors Order New Restrictions As Covid Rages"
"How Trump’s Voter Fraud War Room Became a Fart-Infused ‘Room From Hell’"
"Trump asked aides if he could pursue a wild plan to replace the electoral college with loyalists who would ignore the vote, report says"
"Chris Hayes Explains How The GOP Is Already Setting 'Booby Traps' For Biden | All In | MSNBC"
"Trump supporters gather in Washington as president refuses to concede to Biden"
"Law Professor Jonathan Turley Pushes Debunked Vote-Switching Conspiracy Theory, Offers President’s Supporters False Hope"
"Trump: New York will get coronavirus vaccine last because of Cuomo’s comments"
"Biden is bringing back the daily briefing. Here's who is likely to be at the podium."
"The secret weapon in Biden's fight against climate change"
"Christopher Krebs Hasn’t Been Fired, Yet"
"Donald Trump hints at Joe Biden taking office as he speaks publicly for the first time since defeat"
"Trump loses election lawsuits in Pennsylvania and Michigan, drops Arizona case"
"Second effort to recall Gov. Jared Polis doesn’t submit required signatures by deadline — the group plans to request an extension"
"Letters That Outgoing Presidents Wrote to Their Successors"
"Trump’s media favorites battle for the Trump trophy"
"Heads roll as Trump launches post-election purge"
"Obama Warns Of ‘Dangerous Path’ With GOPers Refusing To Accept Trump’s Defeat"
"Candidate Trump decried the national debt in 2016 and promised to eliminate it. It's only gotten bigger."
"No US national lockdown despite surging Covid cases, says Biden adviser | Instead, the administration will try to target the regions hit hardest"
"Pelosi Cancels In-Person Dinner for New Reps After Backlash"
"Controversial Trump Fed board pick Judy Shelton gets closer to confirmation"
"Lawrence: ‘It’s All Over’ For William Barr &amp; Donald Trump | The Last Word | MSNBC"
"Rebuilding Trump's Broken Global Tech Policy Won't Be Easy"
"Joe Biden's Options To Combat Climate Change"
"No end to the stimulus stalemate"
"WV Gov. Justice announces ‘ultra mandatory’ mask order, closes school for week after Thanksgiving, moves winter sports season to January"
"Justice Samuel Alito called out for highly “partisan” speech on COVID-19 rules and same-sex marriage. The Supreme Court justice’s “angry” Federalist Society speech makes a good case for court reform, scholars say"
"Voters in six states getting phone calls from pro-Trump ‘voter integrity’ group"
"Trump keeps making arguments about the election on Twitter that he won't make in court"
"Biden considers Hillary Clinton for UN ambassador role"
"Trump supporters gather in Washington as he pushes false election claims"
"Pennsylvania secretary of state will not order a recount"
"Biden camp hopes to get past Republican fear of Trump, McConnell stonewalling"
"In 2016, Republicans called Democrats 'sore losers' after election"
"Biden aide says no U.S.-wide COVID lockdown planned as West Coast states advise against travel"
"Biden takes Arizona, first Democrat to win there since 1996"
"The election is over, we do have a new president’: Lawyer who successfully argued Bush v Gore says Trump should accept defeat | Ted Olson said the constitution ‘works pretty well at the end of the day’ because it means ‘flawed individuals’ will get voted out"
"Trump Supporters Descend On Washington For Events Contesting Biden's Victory"
"Law firm withdraws from Trump election suit in Pennsylvania"
"Carter Center will monitor part of a US election for the first time by observing Georgia recount"
"Van Jones: President Trump is strapping the country onto his own kamikaze plane"
"Incoming Rep. Cori Bush says Republicans mistook her for Breonna Taylor"
"2020 Shows That the Electoral College Is Stupid and Immoral"
"‘Time will tell’: US President Trump hints at departure"
"Trump putting democracy to the test after his loss to Biden"
"How Trump’s Voter Fraud War Room Became a Fart-Infused ‘Room From Hell’"
"Trump says New York State won't get first batch of vaccines due to Governor Cuomo"
"Republican candidates follow Trump's lead not to concede in their races"
"Michigan judge says cheating claims based on ignorance of how elections work"
"Trump Is No Longer Even Pretending To Care About His Job"
"Time is running out for President Trump's election challenges"
"'Abuse of the rule of law': 1,000 ex-judges, legal experts slam Trump's false claims of voter fraud"
"Anchorage state Sen. Josh Revak tests positive for COVID-19 after attending event with U.S. Rep. Don Young"
"Catholic Church Asks SCOTUS to Overturn Cuomo’s COVID-19 Restrictions. Justice Barrett May Be the Deciding Vote."
"Republican Congressman Helped Organize Ugly Far-Right Protest Against Election Result; Rep. Paul Gosar (R-Ariz.) rallied in Maricopa County last week with extremists intent on undermining democracy."
"Michigan governor seeks shutdown of Great Lakes oil pipeline"
"As Soon as Trump Leaves Office, He Faces Greater Risk of Prosecution The president is more vulnerable than ever to an investigation into his business practices and taxes."
"Biden set to roll back Trump rules on abortion"
"Trump lawyers withdraw from key Pennsylvania case challenging vote count"
"‘Fox &amp; Friends’ Host Steve Doocy Debunks Trump’s Dominion Voter Fraud Conspiracy Pushed by Fox Stars"
"Trump’s White House is ‘hollowed out’ due to coronavirus as president spews misinformation and acts on impulse A wave of coronavirus infections in the west wing is leaving the president alone at a critical moment as he continues to lie about the results of the 2020 US election"
"‘306’: Dems tease Trump with projected Biden win which he once called a landslide"
"The Cult Myth: Why Trumpism Won't Disappear with Trump"
"A senator who could become Biden's attorney general said breaking up Google should be 'on the table'"
"In Arizona, the final votes and the final call go for Biden"
"Saturday Morning Political Cartoon Thread"
"Massive election disinformation campaign connected to Roger Stone"
"Bolton: Republican leaders need to explain to voters that Trump lost"
"Obama says Trump has caused ‘damage’ by refusing to concede defeat and warns: ‘This is not normal’"
"To truly recover, US needs 400% more coronavirus relief than McConnell is offering, economists say"
"Exactly four years ago, Trump got his first top-secret intelligence briefing 7 days after election win—Biden still hasn't"
"Biden won places that are thriving. Trump won ones that are hurting."
"Trump hasn't attended a coronavirus task force meeting in five months and is taking no role in combatting the surge in the disease"
"Trump admits for first time that Biden won the election"
"Fauci: 'It would be better' if government health officials could start working with incoming Biden-Harris administration"
"Trump admits Biden won, falsely claims election was 'rigged'"
"Obama throws cold water on a Biden cabinet post: 'Michelle would leave me'"
"Warren slams 'political hack' Alito for 'nakedly partisan' speech on religious liberties"
"US election results: Donald Trump admits Biden 'won' for first time"
"US senator points to uncounted votes in Puerto Rico, which doesn't vote for US president"
"\"Trump just conceded\": Reactions follow president's \"he won because\" tweet"
"Bernie: Charles Koch should undo his damage by using his money for \"Justice\""
"Obama says it's 'disappointing' more Republicans aren't challenging Trump over election results"
"MAGA rally: One stabbing and at least 20 arrests as Trump supporters descend on DC"
"DC Trump Supporter Bar Gets $1,000 Fine for Maskless Crowds"
"Memo to Trump: \"The biggest fraud in America continues to be you\""
"Bernie Sanders says Trump denying election results 'beyond belief in terms of behavior for an American president'"
"Native voters aren't 'something else' — we helped swing the presidential election"
"Pompeo calls for respecting elections abroad while ignoring Biden victory"
"Jim Acosta says Trump will just be another 'crackpot' on internet after Jan. 20"
"Public Pressure And Lawsuits Kept USPS From Handing Trump The Election. Here’s How."
"Trump's acting DHS secretary was unlawfully appointed and didn't have the authority to suspend DACA, a federal judge ruled"
"Trump Tweets That Biden Won Election, Says Vote Was ‘Rigged’"
"Opposing Bush v. Gore Attorneys Say Biden Clearly Won the Election, 'No Resemblance' to 2000 Dispute"
"Dr. Fauci: Trump hasn’t attended a coronavirus task force meeting in ‘several months’"
"Republican Arkansas governor: 'I expect Joe Biden to be the next president of the United States'"
"Stacey Abrams leads fight against voter suppression"
"Trump counties make up just 29 percent of U.S. economic output, 2020 election study shows"
"Biden promised a 'railroad revolution' that could see faster trains and a return to Amtrak's nostalgic past — here's what Americans might see"
"Trump Tweets Out a Casual Concession After Long Insisting He Won"
"Michigan judge says GOP election challengers skipped training session, didn't fully understand process"
"Cuomo says Trump is 'incompetent' and 'irrelevant' after vaccine threat"
"Health department shuts down pro-Trump rally in Milwaukee"
"John Bolton says GOP leaders need to tell voters that Trump lost and dismiss his 'baseless' election fraud claims"
"Police Unions Spent Millions To Beat Back Reform In Los Angeles. They Lost Big Time."
"Trump tweets \"mail-in elections are a sick joke,\" as conservative groups encourage mail-in voting in Georgia Senate runoffs"
"'It's critical' for Republican leaders to explain to voters Trump lost the election: John Bolton"
"What Does Trump Get Out of Contesting Biden’s Win? The election was not close, and the President’s claims of voter fraud are merely a distraction from his many recent failures."
"Trump Admits Biden Won Election but Quickly Takes it Back"
"Trump Is Not Doing Well With His Election Lawsuits. Here’s a Rundown."
"Proud Boys Take Part in Violent Washington Protests"
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"Trump ‘has told aides he’ll announce 2024 candidacy as soon as Biden certified winner’"
"Biden task force member: 'We are entering this period that I call COVID hell'"
"Election Officials Spent Four Years Beefing Up Voting Security. It Paid Off."
"John Ossoff attributes close Georgia Senate race to black voter turnout"
"Giuliani’s wild Four Seasons rant reportedly scared top attorneys from election fight"
"Dear fellow Black voters: Thank you"
"Feinstein Calls on GOP to Stop Seating Trump Judges in Lame Duck"
"No Self-Respecting Lawyer Should Touch Trump’s Election-Fraud Claims"
"The Electoral College is not going to give Trump a second term"
"Mike Pompeo Loves To Preach About Peaceful Transitions Of Power — When It’s Happening In Other Countries"
"Ohio GOP governor says Trump should begin transition process amid legal battles"
"Trump begging emails raise questions about 'stolen election' slush fund"
"The Best Thing About a Trump Loss Is Stephen Miller Leaving the White House: Just about everyone—conservatives, progressives, libertarians—should be glad to say goodbye to this cruel approach to immigration policy."
"Jeh Johnson: Trump administration's refusal to aid transition a 'disservice to our national security'"
"Biden Likely to Stump in Georgia for Senate Runoffs, Aide Says"
"Kayleigh McEnany Breaks White House Whopper Record With MAGA Crowd Tally"
"Biden chief of staff: All Americans, state and local governments 'need to step up right now' on pandemic"
"Donald Trump Wants You to Know That He Definitely Did Not Just Concede the Election"
"Profiles in cowardice: Trump's Senate enablers"
"Trump in tweet says Biden 'won' but reiterates false claim election was rigged"
"Harvard law professor: Trump's challenges to election results 'dangerous,' and 'going to fail'"
"‘Million MAGA March’ Falls 900,000 or So Short of a Full Deck"
"Trump learns an old Hollywood truth: It sucks to get cancelled"
"Pennsylvania Won’t Need a Recount to Certify Biden Victory, State Says"
"Laugh? We nearly all died – why my US failed state Twitter thread went viral | The final throes of the Trump presidency exposed America as the bad joke – and danger to the world – it has certainly become"
"'Joe's a blue-collar guy': After years of declining power, union leaders look to Biden"
"Native American Voters Were Crucial To Joe Biden’s Victory | “The overwhelming turnout in tribal communities in the state of Arizona was key,” said Navajo Nation president Jonathan Nez"
"As Trump ignores deepening coronavirus crisis, Biden calls for urgent response"
"Trump encourages D.C. police to \"not hold back\" as violence erupts after \"Million MAGA March\""
"If Democrats can't stop acting like losers when they win, America is doomed. Yes, this election was unsettling — but Democrats won. It's time to fight for what they believe, not surrender"
"After Trump, foreign allies wonder if they can trust America, say former officials"
"Federal Judge Rules Chad Wolf Was ‘Not Lawfully Serving’ as DHS Head When He Issued DACA Memo"
"As D.C. Clashes Erupt, Trump Sics Police On 'Antifa Scum' In Stunningly Vicious Tweet"
"Incoming Biden chief of staff warns transition delay puts vaccine distribution at risk"
"US election: Trump appears to admit Biden victory in tweet"
"Cuomo rolls the tape on GOP calling out election deniers in 2016"
"'Get Over Yourselves': Michigan Doctor Tells GOP Lawmakers to Work With Dems and Back Mask Mandate"
"Trump also refuses to admit he lost the fight against the coronavirus"
"Susan Rice: Trump administration not helping Biden transition poses national security threat"
"Trump edges closer to conceding the election"
"'Victory': Federal Judge Invalidates Latest Trump Effort to Kill DACA"
"Twitter might not ban Trump. But we should still ignore him."
"GOP Governors Suggest That Trump Stop Delaying Biden’s Formal Transition Process"
"Ivanka and Kushner pulled children from school amid complaints family didn’t follow Covid rules"
"Michigan counties wrapping up canvases this week. That’s bad news for Trump."
"The US voted out a climate denier, and world leaders jumped for joy"
"Kellyanne Conway and Donald Trump said they won by a 'landslide' with 306 Electoral College votes in 2016. Now that Biden has 306, they're crying foul."
"Obama says it's 'disappointing' that more Republicans aren't standing up to Trump over election results"
"More than 8 in 10 Trump voters think Biden’s win is not legitimate: Trump’s efforts to undermine the system are influencing his base"
"Federal judge rules acting DHS head Chad Wolf unlawfully appointed, invalidates DACA suspension"
"Trump Supporters Mocked For ‘Million MAGA March’"
"'Outrageous': Republicans blasted for alerting only GOP side about COVID cases in Minnesota Senate"
"Incoming chief of staff: “Trump’s Twitter feed doesn’t make Joe Biden president or not president”"
"President-elect Joe Biden knows the pain of grief — and that makes him the leader America needs right now"
"Trump Accidentally Acknowledged Biden Won The Election — Then Tried To Take It Back"
"Warnock: 'We are in a very strong position' to win GA Senate race"
"Lawyers on Both Sides of Bush v. Gore Agree: Joe Biden Clearly Won the 2020 Election. “The sooner that Trump and his supporters accept the election result, the better it will be for the nation.”"
"Kamala Harris, set to be first South Asian American VP, sends out wishes for happy Diwali"
"Joe Biden Has Won Georgia. He’s The First Democrat To Win The State In Decades."
"Fifteen Asia-Pacific economies formed the world's largest free trade bloc on Sunday, a China-backed deal that excludes the United States; The countries abandoned a rival Asia-Pacific grouping formed under Obama which Trump exited in 2017"
"Trump Is Going Out Like He Came In: With His Press Secretary Lying About Crowd Size"
"Donald Trump says Joe Biden 'won' election; but also says he won't concede"
"Can Mitch McConnell do the right thing just once?"
"\"Were not going to stop\": Lawmakers press ahead with Trump-era investigations"
"Republican leaders in Arizona, Michigan, Pennsylvania and Wisconsin throw cold water on ploy to flip electors to Trump"
"Alabama's COVID health chief wears bulletproof vest amid death threats and anti-mask sentiment"
"Trump Destroyed Any Hope Of Israeli-Palestinian Peace — And Biden Can't Rebuild It"
"Trump’s refusal to concede creates tricky messaging issue for Ga. Republicans"
"Trump is putting this country through something unprecedented. Here are three scenarios."
"There’s a lot Biden can do for rural America. Red-state leaders should accept his help."
"Why the Left Should Ally With Small Business: It will strengthen labor and help fight the increasing concentration of corporate power."
"John Bolton Urges Republicans To Publicly Reject Trump's 'Baseless' Voter Fraud Claims"
"Trump indirectly admits he lost the presidential election by tweeting Biden 'won because the election was rigged'"
"Rep.-Elect Cori Bush Wore a Breonna Taylor Mask. Some Republicans Thought It Was Her Name."
"“Stolen Election” is the New “Birtherism” — “Scary Philadelphia voted illegally!” “Obama was born in Africa!” The Republican goal is the same: delegitimize the president and obstruct everything."
"Fake posts promoting 'free pancakes' at Trump Hotel before DC rally spread on social media"
"First openly gay Afro-Latino congressman Ritchie Torres says the ‘old boys’ club’ style of politics has ‘collapsed’ with 2020 election"
"Effort to recall Colorado Gov. Jared Polis has failed to collect necessary signatures by deadline"
"'Frankly embarrassing': Tapper breaks down Trump's lawsuits alleging voter fraud"
"Obama said he won't serve in Biden's cabinet because Michelle would 'leave' him"
"Sharpton: Trump's loss is 'a result of the American people assessing for themselves his performance in the last four years'"
"Cuomo threatens to sue Trump administration if vaccine plan burdens Black, Brown communities"
"Trump tweets that Biden 'won' – but repeats baseless vote fraud claim"
"Trump acknowledges Biden 'won' the U.S. election, but says it was 'rigged'"
"Fauci says Trump administration should start working with President-elect Biden on coronavirus response"
"Lawyers decided to quit Trump case after chaotic Four Seasons Landscaping press conference"
"Mark Kelly reflects on using McCain's old desk: 'He was a hero of mine'"
"Fox News’ Leland Vittert Goes at It With Trump Spox Over Voter Fraud Claims"
"Mike Pence suggests the Trump administration will be in place for four more years despite Biden victory: 'That's the plan'"
"Trump says Biden 'won' while promoting election conspiracy theories"
"MAGA march: Kayleigh McEnany falsely claims ‘one million’ demonstrators in DC for protest"
"Multiple people arrested at pro-Trump protests, Million MAGA March in DC"
"Steve Schmidt: The Republican party is ‘going to get more cuckoo’"
"Obama addresses Trump transition in first interview since election"
"Trump Administration Ending Like it Began: Lying About Crowd Size"
"Trump's post-presidency is going to be boisterous and belligerent. And that will cause headaches for Biden, the media, and the US economy."
"Fareed Zakaria: The conspiracy theory of the 2020 US election is here to stay"
"‘Dreamer’ immigration protections will be reinstated by Joe Biden on ‘day one:’ Incoming chief of staff Ron Klain"
"‘Personal responsibility’ isn’t working. We need mask mandates."
"They're Following and Chasing Us': Million MAGA March Protesters Chant 'Fake News' at MSNBC Reporter Amid Broadcast"
"Educator on Betsy DeVos: I feel like I’m graduating from ‘meanest, pettiest, most critical teacher I ever had’"
"Cuomo says NY will sue if Trump's vaccine plan lacks equal access for communities of color"
"'We're in overtime': Renee Montgomery keeps getting out vote for Loeffler-Warnock runoff"
"Federal Judge Rules Acting DHS Head Chad Wolf Unlawfully Appointed, Invalidates DACA Suspension"
"Ga. Democratic Senate hopeful Jon Ossoff holds drive-in rallies 'to set the right example'"
"Trump’s latest defense shakeup ‘destructive,’ Bolton says - Former national security adviser John Bolton said the recent firings of top officials at the Pentagon, NSA and DHS will be damaging to the incoming administration."
"Joe Biden's popular vote share is third largest by presidential challenger in election history"
"Trump rally shut down in Milwaukee, man attacked"
"Raging virus triggers new shutdown orders and economy braces for fresh wave of pain"
"'You Lost': Chris Evans Lambasts Trump and Four Seasons Landscaping Gaffe"
"Moore: Trump is 'a little grouchy' over election results"
"Judges rule against 6 Trump campaign lawsuits to invalidate nearly 9,000 Pennsylvania ballots"
"'I concede nothing': Trump backtracks after appearing to acknowledge Biden win"
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"Minnesota GOP sent virus alert only to its side of the aisle"
"The White House press secretary said more than 1 million attended a demonstration in support of Trump, but it was more likely thousands"
"Trump Puts Democracy To The Test After Losing Presidency To Biden : For the first time, a sitting U.S. president tries to convince voters to not believe results clearly showing he lost."
"Trump seems to acknowledge Biden win, but he won’t concede"
"President Trump admits Joe Biden won the 2020 election for the 1st time, then reverses tacit concession"
"Biden solidifies victory, Trump hints at leaving"
"DHS Admits It Likely Made False Statement to Federal Court When Justifying Chad Wolf’s Appointment"
"Trump for the first time says Biden won election and falsely blames conspiracy theories for his loss"
"Chris Hayes explains how the GOP is already setting ‘booby traps’ for Biden"
"Secret intelligence exists that ‘would cast Trump in very negative light’, warns ex-FBI chief"
"Trump appears to acknowledge Joe Biden won in a tweet, but says again he won’t concede"
"Trump and His Loyalists Are Lying about the Size of the Million MAGA March"
"Jared and Ivanka are poised to return to a Manhattan social scene that no longer welcomes them"
"Kentucky governor: 24 veterans have died in long-term care facility from COVID-19 since October"
"Judge rules Daca suspension invalid, Homeland Security head in office illegally"
"Here's How Scientists Want Biden to Take on Climate Change"
"Barack Obama Jokes Wife Michelle 'Would Leave Me' If He Joined President-Elect Joe Biden's Cabinet"
"Judge: DHS head didn’t have authority to suspend DACA"
"National lockdown to contain Covid surge is ‘measure of last resort,’ top Biden health advisor says"
"Fauci says transition delay harmful to public health as COVID-19 cases surge"
"Republicans increasingly urge Trump to begin formal transition"
"Trump seems to suggest Biden 'won' but later says he's not conceding"
"John King: If Trump thinks 2016 was a landslide, 2020 is as well"
"Deb Haaland says 'of course' she would serve as Interior secretary under Biden; she would be the first Native American in the Cabinet, and overseeing public lands."
"Rep.-Elect Cori Bush Wore a 'Breonna Taylor' Mask to Congress and Republicans Thought it Was Her Name"
"Trump’s student loan cliff threatens chaos for Biden"
"Justice Alito takes aim at abortion rights, gay marriage and Covid rules"
"What the bunker mentality really means"
"Biden Stocks Transition Teams with Climate Experts"
"Largely Out of Sight in Washington, Kamala Harris Preps for White House"
"Sigh of relief as international organisations await Biden"
"Trump is going out the way he came in: A loser, a liar and a cheat"
"Dr. Fauci discusses Trump impeding transition amid pandemic"
"North Dakota governor finally issues mask mandate as COVID crushes state"
"Sad! Trump Fights The Tyranny Of Reality, Loses Again"
"Tucker Carlson issues on-air apology over Georgia voter claims"
"White House task force physician 'not concerned' that Trump doesn't attend COVID-19 meetings"
"Out of Sight and Going Out of His Mind. Hold Up in the White House, Trump Rages; Finally, He Feels Shame"
"The Dakotas are 'as bad as it gets anywhere in the world' for COVID-19"
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"250,000 Dead Americans by Thanksgiving as Trump Keeps Tweeting | The entire country is being crushed by the virus, Trump doesn’t care, Biden does, but he can’t do anything about it."
"Trump Publicly Admits Biden Win For First Time, Continues To Allege 'Rigged' Election"
"Trump acknowledges Biden's win in latest tweet"
"Biden Asked Republicans to Give Him a Chance. They’re Not Interested."
"Georgia Democrats Ask Judge to Shut Down Trump Supporters’ Lawsuit: This ‘Gambit’ Is Backed by No ‘Concrete, Credible Evidence’"
"A Judge Found Republicans' Claims Of Vote Fraud In Detroit \"Incorrect And Not Credible\""
"Sen.-elect Tommy Tuberville botches history facts, including three branches of government"
"Mike Pompeo’s awkward seven-country tour could do more harm than good | All the countries on the itinerary are allies of the US and, at the end of the day, they will come to an accommodation with the new administration"
"Barack Obama rules out role in Biden cabinet – 'Michelle would leave me'"
"Biden Gets His Most Important Pick Right — Imposing order on the modern White House requires a competent chief of staff. Ron Klain is a good choice."
"Trump says Biden ‘won' but refuses to concede"
"Fired Staffers Accuse Texas Attorney General of Engaging in ‘All Manner of Retaliation Ranging from Serious to Petty and Pathetic’"
"Democrats keep winning the popular vote. That worries them."
"1 stabbing, 20 arrests in violent clashes after Trump supporters’ Washington election protest"
"10% of Secret Service officers sidelined by COVID: ‘These are the things they did not sign up for’"
"Trump fans flock to conservative-friendly social media apps as they reject US election results"
"We opposed each other in Bush v. Gore. Now we agree: Biden won."
"Biden is expected to select a woman to lead the Pentagon"
"Obama said his 'initial instinct' during '09 outburst from Joe Wilson was to 'smack this guy on the head'"
"Trump’s refusal to concede election defeat will ‘cost us dearly’ in American lives, says Susan Rice"
"Ed Martin Leads ‘Stop the Steal’ Rally in Washington, Calls on GOP Leaders to Push False Narrative of Voter Fraud"
"Republican leaders in four key states reject idea of flipping electors"
"Georgia Trump Supporters, Some Armed, Protest Election Amid State's Voting Recount"
"Obama White House Veterans Urge Biden To Embrace Executive Action"
"The lack of a new stimulus bill may have contributed to surging virus cases amid reopening pressures, experts say"
"Trump's refusal to concede is just the latest gambit to please Republican donors"
"Georgia's Blue Shift Is A Lesson For Progressive Organizers Across The South"
"'Very disturbing': Doctor reacts to Rand Paul's suggestion"
"'The American public can’t wait two more months' for a new coronavirus stimulus deal, Ohio senator says"
"Trump-appointed election official says president’s claims are ‘baffling’ and court evidence ‘laughable’"
"Trump Campaign Shuts Down Fraud Hotline After it Gets Flooded With Prank Calls"
"Pelosi cancels dinner for new members of Congress after Covid backlash led by Chelsea Clinton"
"Count on Biden to Restore the National Monuments Trump Trashed"
"Trump Says Biden Won, But Only Because the 'Election Was Rigged'"
"Two accused 'dead' Georgia voters very much alive despite claims - and they voted legally; 11Alive confirmed that two of the four Georgia voters the president accused of fraudulently voting “dead” are alive."
"How centuries-old regional differences explain the 2020 presidential election"
"Stelter: Fox News has never seen competition like this in its history"
"Milwaukee wants to raise fines for COVID violations to as much as $20,000 as only 8% of state's ICU beds remain open"
"GOP leaders in 4 states quash dubious Trump bid on electors"
"Republicans are playing with fire. And we all risk getting burned | The party is challenging the outcome of the election without any proof of fraud. Their degradation of democracy will reverberate for years to come"
"Elation, Frustration: For Women, Kamala Harris' Win Is A Big Step, But Long Overdue"
"Project Veritas could face legal liability for postal worker's ballot fraud allegations, experts say"
"Trump puts personal lawyer Rudy Giuliani in charge of all election lawsuits"
"'Donald Trump v. USA': legal experts marvel as election lawsuits border on bizarre"
"Covid-19 in the US: 45 of 50 states heading in wrong direction"
"Trump greets hundreds of supporters descending on D.C. to falsely claim he won election"
"Oregon governor warns violators of coronavirus 'freeze' could face jail, hefty fines"
"Trump election lawsuit in Arizona's Maricopa County dismissed, outcome wouldn't have affected races"
"DC's mask mandate ignored by many at Million MAGA March on Saturday"
"Biden has a better shot at riding the economy up now than Obama did"
"Trump the Genius, Trump the Incompetent, Trump the Bogeyman"
"Trump will cast a long shadow over Republican party despite defeat"
"White House Press Secretary Kayleigh McEnany Wildly Exaggerates Trump March Crowd Size"
"The promise of LGBTQ equality under the Biden administration"
"Commerce Department Remembers It Was Supposed To Ban TikTok; Says It Won't Enforce For Now"
"The Latest: Trump demands Georgia officials stop the recount amid claims of cheating"
"Donald Trump lost the 2020 election, but misinformation will continue to win"
"Why Mayor Pete is the right choice to be Joe Biden’s UN ambassador"
"Chad Wolf did not have the authority to restrict DACA program, federal judge rules"
"Biden Wants Census To See 'Invisible' Groups: LGBTQ, Middle Eastern, North African"
"Minnesota Senate Majority Leader Paul Gazelka tests positive for COVID-19"
"There Is No Trumpism Without Trump"
"Biden campaign says Georgia's U.S. presidential recount reveals no irregularities"
"COVID-19 Hospitalizations Surge In Dakotas: 'It's Like We Opened Up A Spigot'"
"Trump lost at the ballot box. His legal challenges aren’t going any better."
"Million Maga March: Trump fans rage against dying of the light"
"Fox News has never seen competition like this"
"Trump and his supporters seek comfort in conspiracy as election hopes dim"
"Obama says Biden's margin of victory over Trump is bigger than Trump's margin over Clinton in 2016"
"Trump hangs over Obama's memoir like an onrushing train"
"Giuliani’s false claim of more than 600,000 unlawful votes in Pittsburgh and Philadelphia"
"All the reasons Democrats say they did poorly down ballot"
"Trump and his White House minimize pandemic surge as he focuses on denying election loss"
"Pelosi cancels dinner for new members of Congress after Covid backlash led by Chelsea Clinton"
"4 candidates to replace Kamala Harris in the Senate"
"Republicans try packing the Fed before Trump exits"
"35 states now included on Pennsylvania Department of State's travel advisory list"
"'This ain’t over!' Vice President Mike Pence exhorts Trump campaign to continue challenging election result"
"US election results: How Native American voters helped flip Arizona for Biden"
"Federal judge invalidates DACA suspension"
"Trump Apparently Thinks Rudy Giuliani Can Save His Flailing Court Battles"
"President Trump briefly drove by the “Million MAGA March” on his way to the golf course"
"Firing a \"Vindictive, Illegal Parting Shot,\" Trump's Interior Proposes Sabotage of Conservation Program | \"The administration's proposal is unneeded, unwanted, and unacceptable.\""
"Ossoff races to quick start on the Senate runoff campaign trail"
"Trump’s Refusal to Start the Transition Process Is Crippling America’s Coronavirus Response"
"Senator-elect Tommy Tuberville flubs basics of the Constitution, World War II and the 2000 election."
"Biden demands urgent federal COVID action as Trump feuds with Cuomo"
"Cori Bush says Republican lawmakers thought her name was Breonna Taylor because of her face mask"
"Fox Host's Simple Question Derails Interview With Trump Aide"
"Minnesota GOP senators had COVID, but GOP caucus didn’t tell DFLers"
"Federal judge says new DACA rules are invalid"
"GOP Leaders In 4 States Quash Dubious Trump Scheme On Electors | Lawmakers in Arizona, Michigan, Pennsylvania, and Wisconsin have all said they won’t intervene in selecting electors"
"Leon Panetta: Trump 'plunging Pentagon into uncertainty'"
"Biden likely to break barriers and pick woman to lead Pentagon"
"Trump Implies Biden ‘Won’ in Tweet on ‘Rigged Election’"
"Republican leaders in 4 key U.S. states quash Trump bid on switching electors"
"All-female Cobb County Board of Commissioners evidence of Georgia's changing political landscape"
"Understanding the Trump voters: Here's why nobody is doing it right"
"Judge: DHS head didn't have authority to suspend DACA | A federal judge in New York has ruled that Acting Department of Homeland Security Secretary Chad Wolf assumed his position unlawfully"
"Trump sees electoral turnaround in 'probably two weeks'"
"The $15 Minimum Wage Won in Florida, But Biden Didn't. Here's Why — Activists say the key was actually talking about working-class issues."
"Trump's refusal to concede is just the latest gambit to please Republican donors | Millions who should be ranged against the American oligarchy are distracted and divided – just as their leaders want"
"Thousands Rally Behind Trump, Insisting He Won Race He Lost"
"New Defense chief signals potential troop drawdown: 'All wars must end'"
"Tucker Carlson apologizes on-air for false Georgia voter fraud claims"
"North Dakota anxiously awaits Biden's climate change agenda"
"Giuliani wrecks Trump campaign's well-laid legal plans"
"Violence erupts as thousands rally behind Trump in Washington, DC"
"Violence breaks out at Trump rally between supporters, counter-protesters"
"As U.S. pandemic intensifies, North Dakota becomes 35th state to require masks"
"Poland's President Duda congratulates Biden on 'successful campaign'"
"Adrian Tam defeats local Proud Boys leader, becomes only gay Asian American in Hawaii House"
"Republicans made gains in California but missed San Diego County: Where does the local GOP go from here?"
"Who is the 'Latino voter?' 2020 election showed Latino voters are diverse and vary region to region"
"Stacey Abrams focuses on next step, Georgia’s U.S. Senate runoffs"
"The purge at the Pentagon - The potential for sudden troop withdrawals should spur Congress to curtail Trump’s powers in his final weeks as president."
"The biggest errors the Trump administration made in response to COVID"
"Coronavirus spread across the US pushes Colorado to ramp up emergency response"
"As Trump rages, Georgia recount continues"
"Trump’s Post-Election Power Grab Isn’t Just Selfish, It’s Dangerous to Democracy"
"Republican voters choose legal marijuana party candidates in tight legislative races"
"How the Trump administration's 'midnight rule-making' could leave a big mark on government"
"Biden Likely To Take Historic Step In Choosing Woman To Lead Pentagon"
"Questions swirl at Pentagon after wave of departures"
"Monuments to Black lives have no value without justice and meaningful change"
"The spread of conspiracy theories like QAnon threatens our politics: GOP congressman"
"Beyond irresponsible: Republicans must put Americans and reality ahead of fealty to Trump | Republicans are embarrassing America. It's past time to admit Trump lost, congratulate Biden, stop spouting misinformation and move on to a transition."
"Million MAGA March: Supporters explain why they're still backing Trump Close | Thousands of pro-Trump protesters rallied in Washington DC for the Million MAGA March, turning out to support President Trump and back his unsubstantiated claims of voter fraud in the US election."
"US sees record 184,000 new daily Covid cases as Trump politicises vaccine effort"
"Trump’s far-fetched legal campaign to question the election seems to be falling apart"
"Voters refuse to take campaign signs down despite city order"
"White House Aide Paula White Calls on God and His Followers to Fight to Keep Trump in Office"
"Trump says for first time that Biden 'won,' blaming 'rigged' election"
"Vaccine czar calls on Trump to allow contact with Biden - Operation Warp Speed head warns thousands of lives at stake if project interrupted."
"Trump emerges from White House to take credit for vaccine and leaves open door for second term"
"Inmates help move bodies as they pile up at El Paso Medical Examiner’s office"
"'Too late': As people dance over Trump loss, rapper Fat Joe sings him goodbye on TV"
"The Dakotas are ‘as bad as it gets anywhere in the world’ for Covid-19 as governor finally mandates masks"
"The tragedy of Trump's refusal to concede"
"Two \"dead voters\" cited by Trump as proof of Georgia ballot fraud are alive"
"Biden is considering Janet Yellen for Treasury Secretary, potentially making her the first woman to hold the role: report"
"Violence erupts between counter-protestors, Trump supports following DC rally"
"The Trump Corner is officially closed: What other changes can Palm Beach County expect when Trump's a regular citizen again?"
"Trump had a very bad Friday in court with his election cases. They're headed for more action next week"
"Million Maga March: Trump fans rage against dying of the light"
"Lankford slammed by Trump loyalists over intelligence briefings"
"The “Real Time” host exposed just how empty the soon-to-be-former president’s allegations of widespread voter fraud really are."
"The \"What happened in your state last week?\" Megathread, Week 45"
"The Republican Party Is Dead. It’s the Trump Cult Now."
"Judges appear increasingly frustrated with Trump's legal claims about 2020 election"
"Winter COVID surge is upon us — Trump and the Republicans are just ignoring it. Chasing electoral delusions and holding his entire party hostage, Trump is condemning thousands more to death"
"Trump in overnight meltdown as he makes eight false election claims in just four tweets"
"Marijuana legalization is so popular it's defying the partisan divide"
"Where Biden Can Find $1 Trillion |Make the rich actually pay what they owe."
"Georgia recount is returning almost no changes in vote tallies that give Biden win"
"Michiganders Rise Up To Hail Gutsy ‘Big Gretch’ Whitmer And Her New COVID-19 Safety Rules"
"Will Trump Burn the Evidence? How the President could endanger the official records of one of the most consequential periods in American history."
"Now's a Good Time to Remember the Time Donald Trump's Own Investigation Proved Voter Fraud Isn't a Thing"
"Fauci says Biden transition is key to quick distribution of Covid vaccine"
"Fauci distances himself from Trump adviser Atlas: 'I totally disagree with the stand he takes'"
"Trump coronavirus advisor Scott Atlas urged people to 'rise up' against new restrictions in Michigan, then said he wasn't trying to encourage violence"
"Native Voters Helped Flip States for Biden. The Media Should Recognize That."
"Donald Trump's refusal to concede is no joke – it's a dangerous precedent"
"Trump claims he won the election; Twitter flags the tweet"
"\"No You Didn't\" Trends After Trump's Latest Election Result Lie"
"Trump is planning a series of confrontations with China in the final weeks of his presidency"
"Emily Murphy, the official blocking Biden's transition, has a record of working the system in ways that benefit Trump, ethics expert says"
"Obama says social media companies 'are making editorial choices, whether they've buried them in algorithms or not'"
"Whitmer responds to Atlas: I won't 'be bullied into not following reputable scientists'"
"Dr. Fauci 'concerned' about Trump stalling Biden transition at critical time in pandemic"
"Fox News Anchor Thoroughly Debunks Trump's Election Fraud Claims"
"Trump has been struggling to walk back his tweet where he appeared to admit Biden won, undermining his baseless case that the election was stolen"
"To achieve his climate goals, Joe Biden needs to bring scientists back - ‘Much of the expertise of the federal bureaucracy has fled in horror’"
"Biden transition team prepares to fight Covid with no help from Trump"
"For GOP, time to accept reality"
"Trump should be held responsible"
"Perdue declines to debate Ossoff ahead of Georgia Senate runoff"
"Biden Fills Economic Posts With Experts on Systemic Racism — Previous administrations haven’t made race scholarship such a clear priority."
"Barack Obama says issues, policies, facts don't matter to American voters anymore"
"Trump or No Trump, Religious Authoritarianism Is Here to Stay"
"Americans Were Primed To Believe The Current Onslaught Of Disinformation"
"Trump coronavirus adviser Scott Atlas urges Michigan to 'rise up' against new Covid-19 measures"
"Trump, the Absolute Worst Loser"
"Jon Ossoff brands David Perdue \"crook\" and \"coward\" after he declines Georgia runoff debate"
"Donald Trump should concede and ‘put country above his ego’, says Barack Obama"
"Chuck Todd: Every GOP senator declined interviews this weekend"
"Obama: Trump has accelerated 'truth decay'"
"Trump Distances Himself from Ongoing Election Lawsuits, Acts Like Campaign Hasn’t Been Losing in Court"
"In Unusually Political Speech, Alito Says Liberals Pose Threat to Liberties"
"Abolish the electoral college"
"Michigan Gov. Whitmer slams Trump adviser who encouraged residents to 'rise up"
"Trump’s Favorite Coronavirus Adviser Just Urged People to ‘Rise Up’ Against Restrictions - He singled out Michigan Gov. Gretchen Whitmer, who has already been the target of one violent far-right group."
"Obama’s advice to Trump? ‘It’s time for you’ to concede to Biden."
"America’s largest militia says it will refuse to recognise Biden as president and ‘resist’ his administration"
"Michigan to close high schools, colleges, bars for 3 weeks as COVID spikes"
"‘We need to do another stimulus package’: Former Obama economist tells MarketWatch what advice she would give Joe Biden"
"Obama said he was surprised at top Republicans who did a 'complete 180 on everything they claimed to believe' to align with Trump"
"Trump Camp Melts Down Over Reports Noting Its PA Lawsuit Had Been Scaled Back"
"N.Y. senators blame Mitch McConnell for holding up COVID relief bill"
"This is no conventional coup. Trump is paving the way for a 'virtual Confederacy'"
"Dear Joe Biden: Don’t Put Rahm Emanuel in Your Administration"
"Why Joe Biden Must Sideline Fox"
"Georgia's GOP secretary of state goes on Facebook fact-checking spree over Trump's misinformation"
"Biden to campaign in Georgia for Warnock and Ossoff in runoff elections deciding control of Senate"
"President Donald Trump shouldn't be able to pardon himself"
"What the history of coups tells us about Trump’s refusal to concede - Democracies are fragile and only vigilance from citizens can protect them."
"Trump’s Top COVID Adviser Denies Trying To Incite Violence Against MI Guv. With ‘Rise Up’ Tweet"
"Trump coronavirus adviser tells Michigan to ‘rise up’ against new shutdown orders"
"Georgia Sen. David Perdue declines to debate opponent ahead of January 5 runoff"
"Donald Trump's legal strategy makes no sense for winning the vote count. So what is he doing?"
"Trump Campaign Scales Back Pennsylvania Lawsuit After Law Firm Abandoned Ship"
"Trump campaign scraps claims its observers weren’t allowed to watch vote count from key lawsuit"
"Americans across party lines, regions embrace marijuana"
"Barack Obama: One election won't stop US 'truth decay'"
"Trump’s Tantrum Could Do Real Harm"
"2 more GOP governors push Trump to start the formal presidential transition process with Biden"
"If it were happening in Turkey, we’d call Trump’s actions an attempted coup"
"Obama said the election showed a 'very divided' nation and described a sense in the US that 'truth doesn't even matter'"
"Yes, 55 Percent of White Women Voted for Trump. No, I’m Not Surprised."
"Obama said he was surprised at top Republicans who did a 'complete 180 on everything they claimed to believe' to align with Trump"
"You Can't Eat Civility: A Message to Joe Biden and the Democrats"
"‘That’s just irresponsible’: Gov. Inslee says Idaho’s COVID-19 response hurts WA hospitals"
"Two more people from Trump's Election Night party at White House test positive for coronavirus"
"Obama Says Trump Has Accelerated 'Truth Decay' In America"
"The deafening silence of Republican senators on Donald Trump's increasingly erratic behavior"
"Obama Calls Trump's Refusal To Concede Another 'Breach Of Basic Democratic Norms'"
"Trump's Midnight Twitter Scream Causes 3 Honest Words To Trend In Response"
"Trump allies in talks to buy Newsmax and turn it into Fox News competitor, reports say"
"Trump takes no questions in first public remarks since losing election"
"Republicans think Georgia's intra-party feud could be a bad omen for GOP's future in the state"
"Obama to Trump on conceding election: 'Think beyond your own ego'"
"Perdue Declines Another Debate Against Ossoff"
"Judge blasts US agency's 'sloppy' climate work in oil case"
"Georgia secretary of state in quarantine as state prepares full by-hand count of presidential ballots"
"Newsmax CEO: 'We Are Not Actively Selling,' Have No Desire to Be 'Trump TV'"
"Jared Kushner’s Company Reportedly Moves To Evict Hundreds As Pandemic Rages"
"Trump campaign retreats from key Pennsylvania suite"
"Former US ambassador: Biden's lack of access to intel briefings 'potentially catastrophic'"
"Community colleges find an advocate in future First Lady Jill Biden"
"Georgia’s Senate Runoff Will Determine Whether the Minimum Wage Increases"
"Remember when Canada and the U.S. were friends? Joe Biden does"
"“Stolen Election” is the New “Birtherism” — “Scary Philadelphia voted illegally!” “Obama was born in Africa!” The Republican goal is the same: delegitimize the president and obstruct everything."
"Court Agrees with Attorney General James That Trump Administration’s Latest DACA Order Was Illegal"
"Elon Musk forced to watch historic SpaceX launch from home and mocked as ‘Space Karen’ after catching Covid"
"South Dakota ER nurse recalls how dying coronavirus patients spend last minutes insisting virus isn't real"
"Azar Defends WH's Refusal To Share COVID Vaccine Plans With Biden's Transition Team"
"Michigan Halts Indoor Dining, In-Person High School, College for Three Weeks"
"Fauci Suggests 'It Would Be Better' to Begin Working With Biden Team, Says Trump Hasn't Attended Task Force Meeting in Months"
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"Incoming chief of staff: “Trump’s Twitter feed doesn’t make Joe Biden president or not president”"
"Trump's failure to work with Biden is becoming more urgent as Covid spreads"
"Pandemic Fatigue Is Just Exhaustion in the Face of a Failed State"
"Michigan governor says she has authority for stay-home order"
"Trump tweets \"mail-in elections are a sick joke,\" as conservative groups encourage mail-in voting in Georgia Senate runoffs"
"Trump Won't Stop Posting a Bogus Voting Machine Conspiracy Theory From QAnon - He spent the weekend boosting the theory about rigged voting machines, and Monday morning screaming that he won the election he lost."
"Cuomo says NY will sue if Trump's vaccine plan lacks equal access for communities of color"
"The Million MAGA March in DC Got Ugly - Violence broke out when thousands of Trump supporters—including QAnon conspiracy theorists and Proud Boys—descended on Washington, D.C. Saturday to insist the president won the election."
"Biden team to meet with coronavirus vaccine makers this week as Trump stonewalls transition"
"Trump campaign jettisons major parts of its legal challenge against Pennsylvania’s election results"
"Trump campaign drops key claim in Pennsylvania ballot challenge"
"Biden promised a 'railroad revolution' that could see faster trains and a return to Amtrak's nostalgic past — here's what Americans might see"
"First Thing: Trump's election lawsuits continue to crumble"
"Georgia elections chief fires back at Trump over claims about recount process"
"Obama says Trump voters’ alternative views divide the country"
"GOP Governors Suggest That Trump Stop Delaying Biden’s Formal Transition Process"
"Obama throws cold water on a Biden cabinet post: 'Michelle would leave me'"
"The Note: Toll of Trump’s defiance comes into view | Trump's refusal to acknowledge the election results could have consequences."
"What Bernie Sanders Could Do as Secretary of Labor - If Biden were to embrace the idea, Sanders and a team of visionary leaders could forge a new New Deal for working Americans."
"Potentially Catastrophic': Former U.S. Ambassador Says Biden Needs Intel Briefings Before Inauguration"
"Bernie Sanders says Trump denying election results 'beyond belief in terms of behavior for an American president'"
"Lawsuits that tried to disrupt Biden's wins in four states are withdrawn"
"‘Several months’ since Trump attended a Covid crisis meeting, Fauci says"
"Trump's lawyer falsely claims he won by millions of votes"
"To truly recover, US needs 400% more coronavirus relief than McConnell is offering, economists say"
"Obama says Trump has caused ‘damage’ by refusing to concede defeat and warns: ‘This is not normal’"
"Obama says it's 'disappointing' more Republicans aren't challenging Trump over election results"
"Obama: US 'adversaries have seen us weakened'"
"Obama calls Trump 'Richie Rich'"
"Donald Trump's estranged niece says uncle is 'deliberately' refusing to concede election"
"EU says looking forward to better ties with US under Biden"
"Trump Has Been Skipping White House COVID Meetings for Months"
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"Trump Admits Defea … Never Mind"
"Republican Arkansas governor: 'I expect Joe Biden to be the next president of the United States'"
"Democrats look to sharpen message after Senate setback"
"Bolton: Republican leaders need to explain to voters that Trump lost"
"'Donald Trump v. USA': legal experts marvel as election lawsuits border on bizarre"
"The electoral College by vote per capita"
"Fauci: 'It would be better' if government health officials could start working with incoming Biden-Harris administration"
"John Ossoff attributes close Georgia Senate race to black voter turnout"
"Trump national security adviser: There will be a 'professional transition' of power"
"Video shows 'USPS whistleblower' was not alone when swearing to affidavit alleging mail-in ballot fraud"
"When Centrists Lose, Corporate Media Blame the Left"
"Massive election disinformation campaign connected to Roger Stone"
"Next attorney general must embrace marijuana law reforms"
"Trump's Pentagon shakeup may be more than perceived disloyalty"
"Bernie Sanders Tells Trump to 'Man Up' and Get Out of the White House in January"
"Trump Campaign Retreats From Key Claim in Pennsylvania Suit"
"Attorney General James Ready to Sue Trump Administration if New York Doesn’t Receive COVID-19 Vaccine with Rest of U.S."
"Election Officials Spent Four Years Beefing Up Voting Security. It Paid Off."
"Trump says Ohio governor's race will be 'hotly contested' after DeWine acknowledges Biden win"
"The coronavirus is now a rural threat"
"Will Donald Trump derail the economy by desperately clinging to power after being defeated by Joe Biden?"
"Pompeo calls for respecting elections abroad while ignoring Biden victory"
"America Has Yet To Shake Its Addiction To Hate - Black Americans did not grieve Trump's 2016 win in the same way as white liberals."
"Biden Likely to Stump in Georgia for Senate Runoffs, Aide Says"
"Trump, Trying to Cling to Power, Fans Unrest and Conspiracy Theories"
"Fox Fact-Checks Trump and Own Hosts’ Claims of Voter Fraud"
"Republicans commit at least $20 million, 600 staffers in Georgia Senate runoff races"
"Georgia election recount nears finish line with few hiccups"
"Biden campaign says Georgia's U.S. presidential recount reveals no irregularities"
"Fauci warns that White House transition delays could slow vaccine rollout"
"Dr. Fauci: Trump hasn’t attended a coronavirus task force meeting in ‘several months’"
"Social distancing, masks still necessary after getting COVID-19 vaccine: Fauci"
"Trump campaign abandons parts of Pennsylvania election lawsuit"
"Biden’s chief of staff says ‘he won’ and there’s nothing Donald Trump can tweet to change it"
"50 Years After the Start of the War on Drugs, Americans Have a Chance to Fix the Harm It Created"
"Michigan Gov. Whitmer criticizes Washington's \"vacuum of leadership\" as she unveils new COVID rules"
"House must take the first step to modernize how Congress works"
"\"Trump just conceded\": Reactions follow president's \"he won because\" tweet"
"Trump asserts he will soon file 'big cases' challenging 2020 election results"
"Trump national security adviser O'Brien says looks now that Biden has won"
"The Covid curves are bending the wrong way"
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"Trump admits Biden won, falsely claims election was 'rigged'"
"Native voters aren't 'something else' — we helped swing the presidential election"
"Exactly four years ago, Trump got his first top-secret intelligence briefing 7 days after election win—Biden still hasn't"
"National Security Adviser Says It Looks Like Biden Has Won The Election"
"Biden won places that are thriving. Trump won ones that are hurting."
"Republican governors say Biden transition must begin as Trump tweets \"I concede nothing\""
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"Warren Slams 'Political Hack' Alito for 'Nakedly Partisan' Speech on Religious Liberties"
"How Activists Saved Election Day in Pennsylvania"
"The Trump campaign dropped a major part of its election lawsuit regarding their claims that observers were not allowed to watch vote counts in Pennsylvania"
"John Bolton urges GOP leaders to \"explain\" to voters that Trump lost: \"This is a character test\""
"Trump campaign abandons part of legal challenge to Pennsylvania election results - Allegation that 682,479 mail-in and absentee ballots were illegally processed without its representatives watching has been dropped"
"Trump campaign downsizing, letting most staff go — except those helping legal battle"
"The Cities Accused in Fraud Conspiracies Didn’t Cost Trump the Election"
"ADL Calls for Improved Hate Crime Reporting in Response to New FBI Data"
"John Kelly: Trump’s Failure to Concede the Election ‘Hurts Our National Security’"
"Trump has conceded, whether he walked it back or not. Now Emily Murphy has to act"
"HHS Secretary Azar says the FDA will move 'as quickly as possible' to clear Moderna and Pfizer's Covid vaccines"
"Georgia election recount nears finish line with few hiccups"
"State AGs have sued the Trump admin. 138 times — nearly double those of Obama, Bush"
"Warnock: 'We are in a very strong position' to win GA Senate race"
"Trump’s Refusal to Start the Transition Process Is Crippling America’s Coronavirus Response"
"Ga. Democratic Senate hopeful Jon Ossoff holds drive-in rallies 'to set the right example'"
"Republicans increasingly urge Trump to begin formal transition"
"Trump Throws Twitter Tantrum As Long-Shot Attempts To Stay In Power Fade Away"
"Trump, Trying to Cling to Power, Fans Unrest and Conspiracies"
"Robert Rabon, longtime Horry County GOP leader, dies from COVID-19 complications"
"Whitmer: Atlas’ call for Michiganders to ‘rise up’ against Covid restrictions ‘took my breath away’"
"Lawsuits that tried to disrupt Biden's wins in four states are withdrawn"
"Trump hasn't attended a coronavirus task force meeting in five months and is taking no role in combatting the surge in the disease"
"Here are 10 climate executive actions Biden says he will take on day one"
"Biden’s corporate tax plan depends on Georgia’s Senate results"
"Trump admits for first time that Biden won the election"
"As Biden Hails Moderna Vaccine Scientists, Trump Tweets 'All Took Place on My Watch!'"
"Bernie: Charles Koch should undo his damage by using his money for \"Justice\""
"Trump Rebuffs Biden Transition Team, Setting Off Virus and National Security Risks"
"Trump, with help, is trying to sue and tweet his way to a second term. Could it work?"
"Opposing Bush v. Gore Attorneys Say Biden Clearly Won the Election, 'No Resemblance' to 2000 Dispute"
"Meet the Uber-driving, conspiracy theorist blogger who DeSantis just hired"
"Trump campaign retreats from key claim in Pennsylvania lawsuit"
"Perdue Rejects Offer To Debate Dem Rival Ossoff Before Key GA Senate Runoff"
"Fox Fact-Checks Trump and Own Hosts' Claims of Voter Fraud"
"Trump learns an old Hollywood truth: It sucks to get cancelled"
"Public Pressure And Lawsuits Kept USPS From Handing Trump The Election. Here’s How."
"Ivanka Trump and Jared Kushner are poised to return to a Manhattan social scene that no longer welcomes them"
"Biden’s IRS could finally give Trump’s tax returns to Democrats"
"Trump hints at primary challenge for Ohio Gov. DeWine, who acknowledged Biden as president-elect"
"The Pandemic Is Showing Us How Capitalism Is Amazing, and Inadequate"
"Juan Williams: Defeated Trump is in legal peril"
"Trump's election support from evangelicals shows we're the biggest obstacle to racial justice"
"Memo to Trump: \"The biggest fraud in America continues to be you\""
"Lawyers Pan Significant ‘Shrinkage’ of Trump Campaign’s Pennsylvania Lawsuit: Only Addresses a ‘Handful of Ballots’"
"Obama calls Trump 'Richie Rich'"
"Was It Worth It, Jared and Ivanka? The glossiest grifters become Vuitton vagabonds."
"Trump’s enablers are playing a dangerous game | Remember last weekend, when Joe Biden was declared president-elect and it seemed like the madness would finally end?"
"US senator points to uncounted votes in Puerto Rico, which doesn't vote for US president"
"Gun sale increase among minorities prompts discussion about race and politics"
"US election results: Donald Trump admits Biden 'won' for first time"
"Trump COVID Adviser Tells People of Michigan to ‘Rise Up’ Against New Restrictions"
"Warren slams 'political hack' Alito for 'nakedly partisan' speech on religious liberties"
"Michigan Gov. Whitmer slams Trump adviser who encouraged residents to 'rise up'"
"Barack Obama Reveals Meaning Behind Memoir Title, Gives Advice to Trump in '60 Minutes' Interview"
"Police Unions Spent Millions To Beat Back Reform In Los Angeles. They Lost Big Time."
"'It's critical' for Republican leaders to explain to voters Trump lost the election: John Bolton"
"A lawyer for Trump's campaign claims without evidence the president won reelection by 'millions of votes'"
"How Trump Set Up Nursing Home Residents to Die in the Pandemic. And What President-Elect Biden Can Do to Help Them"
"‘A reflection of the nation’: Joe Biden’s transition team is majority women and employs many people of colour"
"With pandemic raging, Republicans say election results validate their approach"
"Obama Blames Trump's 'Petulance' For Biden Transition Delays"
"Giuliani’s fantasy parade of false voter-fraud claims"
"Trump National Security Adviser Robert O'Brien says it looks like Biden has won - At the Soufan Center's global security forum, National Security Adviser Robert O'Brien also predicted a \"very professional transition.\""
"Don’t Blame the Left for the Democrats’ Losses"
"Obama says Biden victory won’t be enough to stop US ‘truth decay’"
"Trump aide promises ‘very professional transition’ to Biden"
"Trump’s New Vote Fraud Theory Is So Much Crazier Than You Realize"
"Obama says it's 'disappointing' that more Republicans aren't standing up to Trump over election results"
"Trump coronavirus adviser slammed for telling residents to 'rise up' against new restrictions"
"Stacey Abrams leads fight against voter suppression"
"QAnon Supporters, Paramilitary Groups Promise ‘Fight' Over Election At Pro-Trump Rally Near Nevada’s Capitol"
"In Georgia Senate runoff, Loeffler and Warnock battle over health care"
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"Biden turns focus to U.S. economy as Trump vows more challenges to election outcome"
"Organizers look to build off momentum and turn out a new batch of young voters in Georgia's runoffs"
"Americans need to remain vigilant - The American people must not assume it is over until Trump leaves the White House."
"Trump faces criticism over raging COVID-19 crisis as he delays Biden transition and focuses on election"
"Fox News Anchor Debunks Fox News’ Voter Fraud Claims"
"Trump aide promises 'very professional transition' to Biden"
"Biden's Team Warns Trump's Refusal To Aid Transition Would Jeopardize COVID Vaccine Distribution"
"Trump should have his day in court – it’s the only way to stop the dangerous election myths he is peddling"
"MAGA rally: One stabbing and at least 20 arrests as Trump supporters descend on DC"
"Case challenging Va.'s ‘red flag’ law dismissed | A court case challenging Virginia’s “red flag” law was dismissed on Friday after Attorney General Mark Herring argued that the measure did not violate constitutional rights."
"US records 166,000 new Covid cases as Trump supporters crowd Washington"
"Progressive House Democrats to host healthcare strategy session"
"White House COVID Task Force official suggests bars and restaurants should be closed: \"That's very important\""
"John Bolton says GOP leaders need to tell voters that Trump lost and dismiss his 'baseless' election fraud claims"
"New Interior order undermines conservation bill Trump campaigned on, critics say"
"Republicans’ last gasp in Georgia"
"Georgia Recount Yields Few Changes in Vote Totals, Democrats Say"
"Jim Acosta says Trump will just be another 'crackpot' on internet after Jan. 20"
"Americans Were Primed To Believe The Current Onslaught Of Disinformation"
"Democrats pin Senate hopes on breaking Georgia runoff jinx"
"Trump’s student loan cliff threatens chaos for Biden | Biden could inherit the confusion of monthly payments restarting for tens of millions of Americans amid a pandemic."
"As a third covid-19 wave rises, Trump dawdles and Republicans hide"
"A breakdown of Giuliani's role in Trump's post-election fight"
"Profiles in cowardice: Trump's Senate enablers"
"The federal government’s chief information security officer is helping an outside effort to hunt for alleged voter fraud"
"Trump declares 'I won': the Presidential tweet that threatens chaos | ITV News"
"Ivanka in Exile"
"House Returns With First Widespread COVID-19 Testing Program, Lame Duck Agenda"
"Can Mitch McConnell do the right thing just once?"
"Controversial Fed Nominee Set To Prevail In Senate Confirmation Vote This Week"
"\"That's His Priority as the Pandemic Rages On\": McConnell Readies Lame Duck Push to Further Pack Courts With Trump's Judicial Appointees"
"Lawsuits that tried to disrupt Biden's wins in four states are withdrawn"
"A March Without Millions Is Still A Worrying Sign Of A Nation Divided"
"Trump Tweets That Biden Won Election, Says Vote Was ‘Rigged’"
"Pro-Trump Wisconsin Lawyers Spike Election Lawsuit on Morning of Court Hearing"
"Fauci says it's 'obvious' that it would be 'better' for public health if Trump facilitated a smooth transition to Biden"
"‘Cavalry may not be coming’: Former military Covid planner warns of nightmare of distributing vaccine in rural America"
"I'm Not Going to Be Comfortable Until Joe Biden's Hand Comes Off the Bible"
"The MAGA Army Tries to Drag America to Hell — Dear Leader Trump’s toy soldiers make one last stand on the streets of Washington, DC."
"Biden Won. Will the Climate? 5 leaders point the way forward for a divided nation."
"Jay Clayton says he will step down early as head of the SEC at the end of 2020"
