"CNN Compares The Trump Administration To Genocidal Nazi Germany"
"Pollster: It's Curious How Biden Underperformed Hillary Clinton In Every City...Except These Four: Milwaukee, Detroit, Atlanta and Philadelphia."
"Kristi Noem fires back at former president Obama over his characterization of America in his forthcoming memoir"
"MSNBC’s exodus to work for Joe Biden shows it’s been shilling for him all along"
"Rep. Louie Gohmert, (R-TX): Foreign company had evidence of 'vote switching' -- Server 'seized' by U.S. Army forces after he gave information to President Trump"
"Fox’s Wallace: Trump Can’t ‘Credibly’ Say the Election Was Taken from Him — No ‘Serious Fraud’"
"An MRC study finds that 4.6% of Joe Biden voters would NOT have voted for him had they known about the Biden family's corrupt business dealings."
"Wisconsin lawsuit seeks to toss 800,00 ballots -- Biden leads by 20,000 votes in state"
"Trump Tweet: Our election was hijacked. There is no question. Congress has a duty to #ProtectOurDemocracy &amp; #FollowTheFacts.... oh, wait, that was Nancy Pelosi in 2017."
"BREAKING: President Trump Makes Surprise Appearance As Thousands March In DC To Show Their Support For Him…#MarchForTrump"
"Retiring diplomat says defense officials misled Trump on troop count in Syria"
"Law Firm That Dropped Trump Advises CCP-Linked Firms, Aided In Outsourcing U.S. Jobs To China"
"Milwaukee Elections Head Misplaced Crucial Voting Flash Drive"
"Media's hiding of Hunter Biden scandal robbed Trump of clear win: Poll"
"President Trump wins North Carolina, hits 232 electoral votes"
"Thousands flock to DC for pro-Trump rally"
"Three Wisconsin Voters Band Together, File Election Lawsuit That Could Give Trump An Easy Win"
"Journalist Glenn Greenwald Rips 'The Most Pathological Liar' in Politics and Other Dems for Burying Hunter Biden Fiasco"
"South Dakota Gov. Kristi Noem won't comply if Biden pursues national mask mandate"
"Hillary Clinton Supporter Alan Dershowitz: 'Trump Will Win the Pennsylvania Lawsuit'"
"Trump Team to Call Million Plus Voters about Anomalies in 6 Contested States. “We’re calling them to confirm whether or not they actually cast the ballot, or if that ballot was cast by somebody else in their name”"
"This is disturbing. Facebook removed the title of “President” from Donald Trump and designated him as “Political Candidate.” Trump is still president and, no matter what happens, will remain so until Inauguration Day"
"Plan B? Trump could receive second term from U.S. House in 'contingent election'"
"If Media Didn't Think Trump Could Win, It Wouldn't be Targeting his Lawyers"
"Trump drives by supporters at DC march"
"President Trump Drives by Supporters in DC for 'Million MAGA March'. 'Chants of “USA! USA!” “We want Trump! We want Trump!” and “Four more years! Four more years!” could be heard.'"
"If All the Fraud Is Uncovered, Trump Will Win -- How do we know? The people who tried to pull off this election heist are drawn from the same swamp as the conspirators in the Russia hoax."
"South Dakota Gov. Kristi Noem Wouldn’t Enforce a Biden National Lockdown"
"Trump said the vaccine will be available to everyone by April -- except residents in New York state where the governor has decided not to “for political reasons.”"
"Trump talks post-election fight: Trump says he's confident he will win the states needed to get to 270 electoral votes, \"Never bet against me.\""
"Trump wins North Carolina"
"Obama's WH Physician Issues Brutal Statement on Biden's Mental Health."
"Gambling sites refuse to call election for Biden, leaving $600 million in limbo"
"Watch: fox lou dobbs sydney powell interview on dominion systems"
"Trump got more NYC votes in 2020 — including in the South Bronx"
"Senior Administration Officials Lied To Trump About Troop Levels So He Wouldn’t Pull Out Of Syria"
"Alan Dershowitz Predicts Trump SCOTUS Win in Pennsylvania Ballot Case"
"Trump puts Giuliani in charge of election lawsuits: report"
"Poll: Media's hiding of Hunter Biden scandal robbed Trump of clear win"
"Former Reddit CEO Wants Trump SIlenced Online to Stop ‘A Coup’"
"Gov. Newsom says he shouldn't have attended birthday party at French Laundry amid COVID-19 surge"
"How President Trump Surprised 'Million MAGA March' Participants"
"Democratic congresswoman compliments way Trump 'doesn't talk down to people' unlike some 'woke' Democrats"
"Kyle Rittenhouse's Mother Tears Into Joe Biden for Smearing Her Son as a White Supremacist"
"A dark look into Biden's America: Norway criminalizes private criticism of LGTBQ people"
"Jon Voight Condemns the 'Lie' of a Biden Win Amid America's 'Battle of Righteousness Versus Satan' -- Who would’ve ever guessed one of the biggest supporters of the Republican Commander-in-Chief would be…Brad Pitt’s father-in-law?"
"Biden Says He Is Considering Adding Metamucil To His Cabinet"
"Pelosi vows to teach Trump-less McConnell a lesson despite shrunken House majority"
"WATCH: CNN Runs Segment Comparing Trump To Nazis Purging Jews | The Daily Wire"
"Family Income Rose Drastically Under Trump, Meaning His Economy Was Better Than Obama’s"
"Organization That Made Public Blacklist of Trump Supporters Shuts Down After Massive Backlash"
"Watch Live: Pro-Trump Rally in Washington, DC"
"Harmeet Dhillon: GOP Paid Millions to Lawyers Who Abandoned Trump"
"Juliet Samuel: The American era is over if Biden abandons President Trump's toughness on China"
"Pollsters Failed to Detect Trump Support from Educated Whites"
"Trump campaign wins Pennsylvania lawsuit to block ballots that lacked ID"
"Trump Confident He'll Get More Than 270 Electoral College Votes. 'Never Bet Against Me'"
"Will Israel attack Iran before Trump leaves office? | Spectator USA"
"Obama: 'Americans spooked by black man in White House' led to Trump presidency"
"Twitter removes Lincoln Project post that doxxed lawyers representing Trump"
"Trump's campaign drops Arizona results lawsuit - report"
"Left-Wing Activist Group Launches Strategic Harassment Campaign Targeting Trump Election Lawyers"
"Georgia's vote counting software suspected of having pro-Biden bug -- 'A curious thing happened' in Fulton County"
"Hillary in Aug.: \"Joe Biden should not concede under any circumstances. We've got to have a massive legal operation.\""
"Lori Lightfoot Defends Attending Joe Biden Street Parties But Calling for Canceling Thanksgiving: \"There are times when we actually do need to have relief and come together, and I felt like that was one of those times.\""
"Michigan Judge Denies Trump Backers’ Bid to Toss Detroit Votes"
"Trump Team: Americans Owed a Fair Election. “They deserve to know that every legal vote is counted, and that every illegal vote is not counted.”"
"Cancel Culture has finally reached the courtroom: Trump campaign lawyers pressured to quit case in Pennsylvania"
"Iran-backed Terrorist Groups in Iraq Cheer Prospect of Biden Presidency"
"Alan Dershowitz Predicts Trump Will Win Pennsylvania Lawsuit | The Daily Wire"
"Progress: Biden Administration To Apply 'Black Lives Matter' Decals To All Attack Drones"
"Anti-Trump Lions in the Press Turn Into Cuddly Biden Kittens"
"Trump: Might 'Stop By' DC Rallies for Election Integrity this Weekend"
"Developing: Milwaukee Elections Chief Lost Elections Flash Drive In Morning Hours Of November 4th When Democrats Miraculously Found 120,000 Votes For Joe Biden"
"Tucker Carlson on Biden Transition: 'Not an Incoming Presidential Administration --- A Corporate Takeover of the Country'"
"Exit Polls showed military and veteran voters favored Trump to Biden 52-45. However, other polling suggests younger veteran voters preferred Biden 51-40. In 2016, veteran voters favored Trump over Clinton 60-34."
"Biden’s Pentagon Transition Team Members Funded By The Arms Industry"
"The lawless fantasy to oust all the election lawyers of Donald Trump"
"Trump Admin. strikes deal to make COVID-19 vaccine free at major pharmacies and the MSM hasn't really covered this"
"Biden Considers Hillary Clinton To Serve As US Envoy To United Nations"
"Joe Biden announces Greta Thunberg will head Climate Change Task Force (Satire)"
"Gov. Tate Reeves Signals Mississippi Wouldn’t Comply with a Biden Mandatory Six-Week National Lockdown"
"Lawyer behind Trump's legal campaign to win Pa. has a long history in Philly"
"Biden Reveals New Plans For Space Force To Bomb Space Middle East (For The Space Oil)"
"Obama: Paranoia about 'black man in White House' drove voters to Trump"
"Biden considering Yellen as possible Treasury secretary: report"
"In a Rose Garden address on Friday, the commander-in-chief said they would distribute a COVID-19 vaccine across the United States but would not send it to the hard-hit NY State because Cuomo doesn’t trust it."
"Anarchist and anti-fascist groups planning to 'overwhelm' 'Million MAGA March' in DC — Trump hints at attending"
"Examining the code, internet geeks conclude 'Trump's win was yuuuge'"
"Can you really blame Trump supporters for refusing to accept the election result? | Spectator USA"
"Ala. Sen.-elect Tommy Tuberville labels Biden a socialist | One America News Network"
"Trump talks post-election fight: The bottom line: No matter what news organizations have projected, Trump says he's confident he will win the states needed to get to 270 electoral votes. He quickly ran through the situation in six states."
"Amend the constitution to prevent another President Trump. FFS."
"Trump Signs New Executive Order Targeting Investments in Chinese Companies -- Specifically bars US investment in companies with ties to China's military."
"Biden Administration to target Domestic \"Terrorism\""
"EPISODE TAKEN OFF OF YOUTUBE!!! (warning, contains alex jones. that is all) Timcast IRL #165 - Alex Jones Talks Lockdowns, The Election With Tim Pool And Michael Malice - Timcast IRL"
"Law firm Porter Wright withdraws from representing Trump in Pennsylvania case"
"Joe Biden's Disastrous Record of Using 'Bold Federal Action' To Solve America's Problems"
"The Election Fraud Allegations - A Definitive Breakdown of What is Happening."
"More than two dozen Fortune 500 CEOs held a secret video conference to discuss collective action if Trump refuses to leave office, conducts mass firings in government or holds rallies which become 'seditious riots'"
"Joseph Epstein: Donald Trump, the President His Detractors Loved to Hate"
"L. Lin Wood Says 100% Trump will stay president and the legal evidence is overwhelming (22 mins in)"
"Report: Biden Considering Hillary Clinton For UN Ambassador"
"Beijing Is Called For Biden, The Big Guy Wins China"
"Bill Galston: President Trump Remade His Party and the World"
"Pentagon shake-up to help cement Trump's legacy, bringing troops home and taking out enemies, White House source says"
"Judge sides with Trump, barring Pennsylvania from extending voter ID deadline -- A portion of mail-in ballots from voters who had failed to provide ID by Nov. 9 should not be counted."
"Pope Congratulates 'Deeply Devout' Catholic Biden, Who Calls Abortion an 'Essential Health Care Service'"
"Biden Reveals New Plans For Space Force To Bomb Space Middle East (For The Space Oil)"
"Democrat Senator Joe Manchin tweets that Democrats do not want to defund the police and do not have a socialist agenda and AOC tweets a photo of herself glaring at him during a SOTU speech by Trump."
"Pope Francis, Frequent Trump Critic, Congratulates Biden | The Daily Wire"
"Mexico’s President Declines to Acknowledge Biden as President-Elect"
"The Real Resistance - The 70million people who voted for Trump are revolting against the new elites."
"Hispanic Networks Triggered by Mexican President Refusal to Acknowledge Biden as President-Elect"
"The National Urging Plan: Biden Appears To Downgrade His Mask Pledge From A “Mandate” To An “Urging”"
"BREAKING: PA Judge Rules In Favor Of Trump Campaign, Says State MAY NOT Count Ballots Where Voters Failed To Provide Proof Of Identification"
"WATCH: CNN Runs Segment Comparing Trump To Nazis Purging Jews | The Daily Wire"
"Why President Trump Has A Strong Supreme Court Case To Contest Pennsylvania"
"Joe Biden's COVID-19 board co-chair says US lockdown unlikely under new administration but pushed for targeted intervention, using the example of New York City's cracking down on hotspots by the zip code instead of enforcing citywide shutdowns."
"Outgoing Syria Envoy Admits Hiding US Troop Numbers; Praises Trump’s Mideast Record"
"Potential Biden Cabinet Pick a Frequent Guest on Chinese Propaganda Outlets"
"Trump Campaign, Georgia GOP Highlight Major Concerns over Recount"
"Trump lawyers withdraw from key Pennsylvania case challenging vote count"
"Did Dominion Delete 2.7 Million Trump Votes?"
"Biden set to roll back Trump rules on abortion funding, religious exemptions in ObamaCare"
"Arizona Secretary of State Referred to Trump's 'Base' as 'Neo-Nazi' in 2017"
"Cindy McCain Says Late Husband Would Want Country to ‘Move on’ and Support Joe Biden"
"How President Trump Surprised 'Million MAGA March' Participants"
"Trump Tweet: Our election was hijacked. There is no question. Congress has a duty to #ProtectOurDemocracy &amp; #FollowTheFacts.... oh, wait, that was Nancy Pelosi in 2017."
"President Trump Drives by Supporters in DC for 'Million MAGA March'. 'Chants of “USA! USA!” “We want Trump! We want Trump!” and “Four more years! Four more years!” could be heard.'"
"Will Israel attack Iran before Trump leaves office? | Spectator USA"
"Trump drives by supporters at DC march"
"Watch: fox lou dobbs sydney powell interview on dominion systems"
"Fox’s Wallace: Trump Can’t ‘Credibly’ Say the Election Was Taken from Him — No ‘Serious Fraud’"
"Obama's WH Physician Issues Brutal Statement on Biden's Mental Health."
"Law Firm That Dropped Trump Advises CCP-Linked Firms, Aided In Outsourcing U.S. Jobs To China"
"Thousands flock to DC for pro-Trump rally"
"If All the Fraud Is Uncovered, Trump Will Win -- How do we know? The people who tried to pull off this election heist are drawn from the same swamp as the conspirators in the Russia hoax."
"BREAKING: President Trump Makes Surprise Appearance As Thousands March In DC To Show Their Support For Him…#MarchForTrump"
"Pelosi vows to teach Trump-less McConnell a lesson despite shrunken House majority"
"K-pop fans protest pro-Trump rally"
"Watch Live: Pro-Trump Rally in Washington, DC"
"Anti-Trump Lions in the Press Turn Into Cuddly Biden Kittens"
"Poll: Media's hiding of Hunter Biden scandal robbed Trump of clear win"
"An MRC study finds that 4.6% of Joe Biden voters would NOT have voted for him had they known about the Biden family's corrupt business dealings."
"Developing: Milwaukee Elections Chief Lost Elections Flash Drive In Morning Hours Of November 4th When Democrats Miraculously Found 120,000 Votes For Joe Biden"
"Pollster: It's Curious How Biden Underperformed Hillary Clinton In Every City...Except These Four: Milwaukee, Detroit, Atlanta and Philadelphia."
"The lawless fantasy to oust all the election lawyers of Donald Trump"
"Can President Trump win? Here’s how!"
"Retiring diplomat says defense officials misled Trump on troop count in Syria"
"White men swung to Biden. Trump made gains with black and Latino voters. Why? | US politics"
"Media's hiding of Hunter Biden scandal robbed Trump of clear win: Poll"
"Did Non-Citizen Voters Hand The Election To Joe Biden?"
"Three Wisconsin Voters Band Together, File Election Lawsuit That Could Give Trump An Easy Win"
"If Media Didn't Think Trump Could Win, It Wouldn't be Targeting his Lawyers"
"Plan B? Trump could receive second term from U.S. House in 'contingent election'"
"Kristi Noem fires back at former president Obama over his characterization of America in his forthcoming memoir"
"Rep. Louie Gohmert, (R-TX): Foreign company had evidence of 'vote switching' -- Server 'seized' by U.S. Army forces after he gave information to President Trump"
"MSNBC’s exodus to work for Joe Biden shows it’s been shilling for him all along"
"CNN Compares The Trump Administration To Genocidal Nazi Germany"
"Milwaukee Elections Head Misplaced Crucial Voting Flash Drive"
"Jon Voight Condemns the 'Lie' of a Biden Win Amid America's 'Battle of Righteousness Versus Satan' -- Who would’ve ever guessed one of the biggest supporters of the Republican Commander-in-Chief would be…Brad Pitt’s father-in-law?"
"Journalist Glenn Greenwald Rips 'The Most Pathological Liar' in Politics and Other Dems for Burying Hunter Biden Fiasco"
"President Trump critics Rosie O’Donnell and Mary Trump joining forces"
"Hillary Clinton Supporter Alan Dershowitz: 'Trump Will Win the Pennsylvania Lawsuit'"
"Mitch McConnell Will Appease Joe Biden? Oh, Please!"
"Democratic congresswoman compliments way Trump 'doesn't talk down to people' unlike some 'woke' Democrats"
"Ann Coulter: What America Wants Is ‘Trumpism without Trump’"
"Biden considering Yellen as possible Treasury secretary: report"
"Trump puts Giuliani in charge of election lawsuits: report"
"Pollsters Failed to Detect Trump Support from Educated Whites"
"Harmeet Dhillon: GOP Paid Millions to Lawyers Who Abandoned Trump"
"Iran-backed Terrorist Groups in Iraq Cheer Prospect of Biden Presidency"
"Trump talks post-election fight: Trump says he's confident he will win the states needed to get to 270 electoral votes, \"Never bet against me.\""
"Alan Dershowitz Predicts Trump SCOTUS Win in Pennsylvania Ballot Case"
"Gov. Newsom says he shouldn't have attended birthday party at French Laundry amid COVID-19 surge"
"Amend the constitution to prevent another President Trump. FFS."
"Wisconsin lawsuit seeks to toss 800,00 ballots -- Biden leads by 20,000 votes in state"
"Trump Team to Call Million Plus Voters about Anomalies in 6 Contested States. “We’re calling them to confirm whether or not they actually cast the ballot, or if that ballot was cast by somebody else in their name”"
"South Dakota Gov. Kristi Noem Wouldn’t Enforce a Biden National Lockdown"
"Left-Wing Activist Group Launches Strategic Harassment Campaign Targeting Trump Election Lawyers"
"Biden’s Pentagon Transition Team Members Funded By The Arms Industry"
"Joe Biden announces Greta Thunberg will head Climate Change Task Force (Satire)"
"Trump: Might 'Stop By' DC Rallies for Election Integrity this Weekend"
"Trump Campaign, Georgia GOP Highlight Major Concerns over Recount"
"Trump got more NYC votes in 2020 — including in the South Bronx"
"Cancel Culture has finally reached the courtroom: Trump campaign lawyers pressured to quit case in Pennsylvania"
"Lawyer behind Trump's legal campaign to win Pa. has a long history in Philly"
"Joe Biden transition official wrote op-ed advocating free speech restrictions"
"Left-Wing Reporters Rush To Distort What Trump Said About New York Getting The Vaccine"
"Alan Dershowitz Predicts Trump Will Win Pennsylvania Lawsuit | The Daily Wire"
"Biden Says He Is Considering Adding Metamucil To His Cabinet"
"President Trump wins North Carolina, hits 232 electoral votes"
"Biden Considers Hillary Clinton To Serve As US Envoy To United Nations"
"A dark look into Biden's America: Norway criminalizes private criticism of LGTBQ people"
"Senior Administration Officials Lied To Trump About Troop Levels So He Wouldn’t Pull Out Of Syria"
"James Freeman: Biden and Big Government"
"5 Historical Trends That Show It's Utterly Shocking If Trump Lost In 2020"
"Obama: Paranoia about 'black man in White House' drove voters to Trump"
"Joseph Epstein: Donald Trump, the President His Detractors Loved to Hate"
"Bill Galston: President Trump Remade His Party and the World"
"Can you really blame Trump supporters for refusing to accept the election result? | Spectator USA"
"Biden Reveals New Plans For Space Force To Bomb Space Middle East (For The Space Oil)"
"Juliet Samuel: The American era is over if Biden abandons President Trump's toughness on China"
"Biden Administration to target Domestic \"Terrorism\""
"Pope Francis, Frequent Trump Critic, Congratulates Biden | The Daily Wire"
"Leftists Declare A Biden-Harris Victory, Cue The Marxist Sing-Alongs"
"South Dakota Gov. Kristi Noem won't comply if Biden pursues national mask mandate"
"In a Rose Garden address on Friday, the commander-in-chief said they would distribute a COVID-19 vaccine across the United States but would not send it to the hard-hit NY State because Cuomo doesn’t trust it."
"Ala. Sen.-elect Tommy Tuberville labels Biden a socialist | One America News Network"
"Anarchist and anti-fascist groups planning to 'overwhelm' 'Million MAGA March' in DC — Trump hints at attending"
"Trump said the vaccine will be available to everyone by April -- except residents in New York state where the governor has decided not to “for political reasons.”"
"Biden Reveals New Plans For Space Force To Bomb Space Middle East (For The Space Oil)"
"EPISODE TAKEN OFF OF YOUTUBE!!! (warning, contains alex jones. that is all) Timcast IRL #165 - Alex Jones Talks Lockdowns, The Election With Tim Pool And Michael Malice - Timcast IRL"
"Hispanic Networks Triggered by Mexican President Refusal to Acknowledge Biden as President-Elect"
"The shy trump voter is a suburban woman"
"Potential Biden Cabinet Pick a Frequent Guest on Chinese Propaganda Outlets"
"Report: Biden Considering Hillary Clinton For UN Ambassador"
"This is disturbing. Facebook removed the title of “President” from Donald Trump and designated him as “Political Candidate.” Trump is still president and, no matter what happens, will remain so until Inauguration Day"
"Alan Dershowitz: 'I Do Think that Trump Will Win the Pennsylvania Lawsuit' if Enough Votes at Stake"
"Trump Team: Americans Owed a Fair Election. “They deserve to know that every legal vote is counted, and that every illegal vote is not counted.”"
"Pentagon shake-up to help cement Trump's legacy, bringing troops home and taking out enemies, White House source says"
"Law firm Porter Wright withdraws from representing Trump in Pennsylvania case"
"Biden's power pact: A return to the Paris climate accord would cost much, yield little"
"Joe Biden's COVID-19 board co-chair says US lockdown unlikely under new administration but pushed for targeted intervention, using the example of New York City's cracking down on hotspots by the zip code instead of enforcing citywide shutdowns."
"Trump wins North Carolina"
"Georgia's vote counting software suspected of having pro-Biden bug -- 'A curious thing happened' in Fulton County"
"Watch: Trump vote totals go down before your eyes"
"Progress: Biden Administration To Apply 'Black Lives Matter' Decals To All Attack Drones"
"Prediction: Trump will resign, Pence will pardon him"
"Navarro: White House’s operating ‘assumption is a second Trump term’"
"Twitter removes Lincoln Project post that doxxed lawyers representing Trump"
"Organization That Made Public Blacklist of Trump Supporters Shuts Down After Massive Backlash"
"Deep State diplomat lied to Trump about Syria on behalf of military - Industrial Complex"
"Lori Lightfoot Defends Attending Joe Biden Street Parties But Calling for Canceling Thanksgiving: \"There are times when we actually do need to have relief and come together, and I felt like that was one of those times.\""
"Return of the Propeller Heads - Heavy-handed bureaucracy is set for a comeback under Biden"
"Michigan Judge Denies Trump Backers’ Bid to Toss Detroit Votes"
"Trump Confident He'll Get More Than 270 Electoral College Votes. 'Never Bet Against Me'"
"Trump's campaign drops Arizona results lawsuit - report"
"Outgoing Syria Envoy Admits Hiding US Troop Numbers; Praises Trump’s Mideast Record"
"The Election Fraud Allegations - A Definitive Breakdown of What is Happening."
"More than two dozen Fortune 500 CEOs held a secret video conference to discuss collective action if Trump refuses to leave office, conducts mass firings in government or holds rallies which become 'seditious riots'"
"Exit Polls showed military and veteran voters favored Trump to Biden 52-45. However, other polling suggests younger veteran voters preferred Biden 51-40. In 2016, veteran voters favored Trump over Clinton 60-34."
"Trump talks post-election fight: The bottom line: No matter what news organizations have projected, Trump says he's confident he will win the states needed to get to 270 electoral votes. He quickly ran through the situation in six states."
"If Anyone Can Win This Monumental Election Challenge, It's Donald Trump"
"We will win!"
"Biden set to roll back Trump rules on abortion funding, religious exemptions in ObamaCare"
"A Biden Victory Does Not Compute: 5 Historical Trends That Show It's Utterly Shocking If Trump Lost In 2020"
"Family Income Rose Drastically Under Trump, Meaning His Economy Was Better Than Obama’s"
"Top contender for Biden Defense chief would be historic pick as first female"
"Kyle Rittenhouse's Mother Tears Into Joe Biden for Smearing Her Son as a White Supremacist"
"Google completely censored all Breitbart links from search results for \"Joe Biden\" and \"Hunter Biden\", starting in May 2020"
"Gambling sites refuse to call election for Biden, leaving $600 million in limbo"
"SPECIAL THANKS To The New York Times For Accidentally Providing The Data That Will Bring Down Biden And CRACK THE BIGGEST VOTE FRAUD IN HISTORY"
"IT’S HAPPENING: Trump Campaign Attorney Points to Dominion Fraud: “Communist China Materially Interfered with Our Election – TRUTH”"
"It would be madness for Joe Biden to return to the Iran nuclear deal"
"'Massive amounts of litigation': Biden administration set to overturn religious liberty protections"
"2020 Election Recap, Discord Chat, and What’s To Come"
"Jared and Ivanka are poised to return to a Manhattan social scene that no longer welcomes them"
"Trump is going out the way he came in: A loser, a liar and a cheat"
"Trump Puts Democracy To The Test After Losing Presidency To Biden : For the first time, a sitting U.S. president tries to convince voters to not believe results clearly showing he lost."
"Deb Haaland says 'of course' she would serve as Interior secretary under Biden; she would be the first Native American in the Cabinet, and overseeing public lands."
"Biden Stocks Transition Teams with Climate Experts"
"A Judge Found Republicans' Claims Of Vote Fraud In Detroit \"Incorrect And Not Credible\""
"Secret intelligence exists that ‘would cast Trump in very negative light’, warns ex-FBI chief"
"Republicans are playing with fire. And we all risk getting burned | The party is challenging the outcome of the election without any proof of fraud. Their degradation of democracy will reverberate for years to come"
"Lawyers decided to quit Trump case after chaotic Four Seasons Landscaping press conference"
"250,000 Dead Americans by Thanksgiving as Trump Keeps Tweeting | The entire country is being crushed by the virus, Trump doesn’t care, Biden does, but he can’t do anything about it."
"Joe Biden's popular vote share is third largest by presidential challenger in election history"
"Trump puts personal lawyer Rudy Giuliani in charge of all election lawsuits"
"Obama says Biden's margin of victory over Trump is bigger than Trump's margin over Clinton in 2016"
"Obama White House Veterans Urge Biden To Embrace Executive Action"
"Judges rule against 6 Trump campaign lawsuits to invalidate nearly 9,000 Pennsylvania ballots"
"Donald Trump lost the 2020 election, but misinformation will continue to win"
"Trump-appointed election official says president’s claims are ‘baffling’ and court evidence ‘laughable’"
"Georgia's Blue Shift Is A Lesson For Progressive Organizers Across The South"
"Detroit Police Chief admits to treating 'peaceful' Trump supporters differently than Black Lives Matter protesters"
"Fake posts promoting 'free pancakes' at Trump Hotel before DC rally spread on social media"
"Trump greets hundreds of supporters descending on D.C. to falsely claim he won election"
"Biden demands urgent federal COVID action as Trump feuds with Cuomo"
"Mike Pence suggests the Trump administration will be in place for four more years despite Biden victory: 'That's the plan'"
"Biden Asked Republicans to Give Him a Chance. They’re Not Interested."
"Giuliani wrecks Trump campaign's well-laid legal plans"
"Two \"dead voters\" cited by Trump as proof of Georgia ballot fraud are alive"
"Fox's Lou Dobbs Has Full-On Election Meltdown: Denies Trump What's 'Rightfully His'"
"'You Lost': Chris Evans Lambasts Trump and Four Seasons Landscaping Gaffe"
"Thomas Friedman on GOP: This is not a political party. It's a cult"
"Trump Again Boasts He Won Pennsylvania And Georgia; Twitter Slaps Him Down"
"K-pop fans protest pro-Trump rally with pancake tweets"
"Lincoln project ad accuses GOP of \"acting like China, Iran, North Korea\" for refusing to accept Trump's election loss"
"Count on Biden to Restore the National Monuments Trump Trashed"
"Georgia Democrats Ask Judge to Shut Down Trump Supporters’ Lawsuit: This ‘Gambit’ Is Backed by No ‘Concrete, Credible Evidence’"
"Chris Hayes explains how the GOP is already setting ‘booby traps’ for Biden"
"Trump Is Going Out Like He Came In: With His Press Secretary Lying About Crowd Size"
"Biden Wants Census To See 'Invisible' Groups: LGBTQ, Middle Eastern, North African"
"Trump had a very bad Friday in court with his election cases. They're headed for more action next week"
"Trump puts Giuliani in charge of election lawsuits: report"
"Vaccine czar calls on Trump to allow contact with Biden - Operation Warp Speed head warns thousands of lives at stake if project interrupted."
"Giuliani Time: Trump Taps Rudy To Lead Legal Challenges That Are Going Nowhere"
"‘Huge Loss’: Trump Loses Two Pennsylvania Mail-in Ballot Cases within Hours"
"Beyond irresponsible: Republicans must put Americans and reality ahead of fealty to Trump | Republicans are embarrassing America. It's past time to admit Trump lost, congratulate Biden, stop spouting misinformation and move on to a transition."
"Republicans try packing the Fed before Trump exits"
"Democrats need to clearly embrace popular, progressive policies or they will continue to fail in down ballot elections"
"Trump Could Lose Far More Than the White House"
"Trump’s Post-Election Power Grab Isn’t Just Selfish, It’s Dangerous to Democracy"
"Prosecutors who AG Bill Barr dispatched to investigate Trump's evidence-free claims of mass election fraud say they found no substantial irregularities"
"Outgoing President Crawls Out From Safe Space, Remains in Denial"
"Resurfaced Clips Show Donald Trump Saying 306 Electoral Votes Is a 'Landslide' in 2016 After Biden Wins Same Amount in 2020"
"Amend the Constitution to Prevent Another Trump"
"Trump to face ‘subpoenas and seizures’ following presidency, ex-Manhattan prosecutor says"
"Trump Says New York Won’t Get Vaccine Right Away Because He’s a Petty Little Bitch"
"The $15 Minimum Wage Won in Florida, But Biden Didn't. Here's Why — Activists say the key was actually talking about working-class issues."
"Trump’s far-fetched legal campaign to question the election seems to be falling apart"
"Biden is considering Janet Yellen for Treasury Secretary, potentially making her the first woman to hold the role: report"
"U.S. could see 13 million more COVID cases before Biden is sworn in as president"
"New York attorney general threatens Trump with lawsuit if he denies state access to ‘life-saving’ vaccine"
"After $15 billion and 450 miles, Joe Biden will halt border wall, Trump’s signature project"
"Trump to rush drilling leases in Arctic before Biden takes over"
"Before Biden inauguration, 70,000 more could die from COVID-19 in the U.S."
"Trump rails against Georgia Gov. Kemp for consent decree aimed at helping minority voters"
"Bush v. Gore Lawyer Tells Federalist Society That 2020 Election ‘Is Over’ — It's time to accept Joe Biden as the president-elect."
"Philadelphia suburbs return with a vengeance to oust Trump"
"Trump Camp Forced To Shut Down Absurd Voter Fraud Hotline Due To Ceaseless Prank Calls"
"US sees record 184,000 new daily Covid cases as Trump politicises vaccine effort"
"‘They know their vote matters’: the Georgia Senate runoffs battle is already on | Trump’s defeat in the reliably red state has shown Democratic voters the power of their ballot, activists say as they focus on Ossoff and Warnock’s races"
"Rudy Giuliani is reportedly taking charge in Trump's election legal battles — and Twitter is having a field day with it"
"John Kelly says Trump hurting national security by delaying Biden transition"
"With final races called, Biden ends with 306 Electoral College votes, Trump 232: Edison Research"
"Trump Taps Giuliani to Lead Election Lawsuits After Disastrous Day of Losses"
"Trump's Voter Fraud Claims Are Now Being Debunked By His Own Government"
"AP Fact Check: Trump tweets a tall tale of ‘deleted’ votes"
"Trump says coronavirus vaccine won't be delivered to New York"
"Christiane Amanpour compares Trump administration ‘assault on values’ to Kristallnacht"
"President Trump threatens to withhold COVID-19 vaccine from New York in new feud with Governor Cuomo"
"John King: If Trump thinks 2016 was a landslide, 2020 is as well"
"Joe Biden Declared Winner in Georgia, Taking Electoral College Tally to 306"
"By Team Trump's standards, Biden has now won in a 'landslide'"
"Trump Takes Credit For 'Most Secure Election Ever' But Says It Was 'Rigged'"
"Biden likely to break barriers, pick woman to lead Pentagon"
"Trump Almost Admits He Lost Election, Says 'Time Will Tell'"
"Trump forced to drop ‘voter fraud’ hotline after it was swamped by prank calls from teenagers on TikTok"
"Chelsea Clinton blames Trump for Secret Service officers in quarantine"
"White House Press Secretary Kayleigh McEnany Wildly Exaggerates Trump March Crowd Size"
"New York Times: Rudy Giuliani put in charge of Trump's election lawsuits after series of losses"
"Biden plans to reach across the aisle – but is he walking into a Republican trap?"
"GOP leaders in 4 states quash dubious Trump bid on electors"
"Joe Biden Calls on Americans to 'Step Up,' Wear a Mask and Social Distance as COVID Spikes"
"Joe Biden Has Won Georgia. He’s The First Democrat To Win The State In Decades."
"Pompeo’s meetings in France to be held in ‘complete transparency’ with Biden team, says Macron"
"No longer mirror of US, Ohio’s electoral bellwether quiets"
"Biden wins Georgia as Trump continues unsupported fraud claims, secures North Carolina | U.S. president-elect's legal team confident Georgia recount won't change results"
"The purge at the Pentagon - The potential for sudden troop withdrawals should spur Congress to curtail Trump’s powers in his final weeks as president."
"The Trump Campaign Can’t Find a Judge Who Will Ignore Facts — but It’s Trying"
"White House press secretary Kayleigh McEnany insists that Trump will attend 'his own' inauguration in January"
"In Trump’s final days, a 30-year-old aide purges officials seen as insufficiently loyal"
"Trump supporters chant 'Four more years!'; at Washington rally as he pushes false election claims"
"Trump Campaign Gets Laughed Out Of Court For Claiming A Bunch Of Unvetted Webform Submissions Is 'Evidence' Of Voter Fraud"
"Trump wavers between reality and election fiction with eye on his legacy during Rose Garden vaccine address"
"Trump, for once, listened when aides told him to lay low"
"With 'Irrevocable Injustice' on the Line, Democratic Lawmakers Demand Trump Admin Put Brakes on Federal Killing Spree"
"How hate for Trump may have triumphed over love for Biden — and Trump"
"Sore loser or victim? Trump voters struggle with president’s role in defeat."
"Trump cheered as motorcade drives through far-right ‘Million MAGA March’ rally in DC"
"Trump campaign files election lawsuit at wrong court in latest blunder"
"Arizona Election Witness Confesses to Being Trump Campaign Lawyer's Business Partner in Court"
"Biden’s Education Department Will Move Fast to Reverse Betsy DeVos’s Policies"
"Trump’s Men in Moscow - Russian Media Revels in Trump’s Nonsensical Claims of Fraud as Enemies of Democracy Reap Propaganda Harvest."
"Biden solidifies win with Georgia victory as Trump appears to hint at presidency changing hands"
"With final races called, Biden takes 306 Electoral College votes, Trump 232: Edison Research"
"The US president-elect is interested in Australia's COVID-19 response. This is what Scott Morrison sent Joe Biden's team"
"Biden’s victory came from the suburbs"
"More than 130 Secret Service officers are said to be infected with coronavirus or quarantining in wake of Trump’s campaign travel"
"'Self-pardon' no protection for Trump from cases awaiting his presidency's end"
"President Trump taps Rudy Giuliani to take over election legal fight | Prior lawyers pulled out of a federal lawsuit in Pennsylvania FridAY."
"Nearly the whole world considers Biden president-elect"
"White men swung to Biden. Trump made gains with Black and Latino voters. Why?"
"Trump bolts presser as reporters yell, \"When will you admit you lost the election?\""
"Mr. President, Pack Your Bags and Be Gone | Trump wants to preserve, protect and defend only himself."
"Out Of Sight And Going Out Of His Mind. Hold Up in the White House, Trump Rages; Finally, He Feels Shame"
"Donald Trump, Kellyanne Conway’s ‘Landslide’ Boasts Come Back To Haunt Them"
"Deb Haaland: ‘Of Course’ I’d Be Interested In Being Biden’s Interior Secretary - Tribal leaders are urging the president-elect to make history by picking the Native American congresswoman to oversee public lands"
"Watch Trump Get Really Close to Admitting He Lost the Election"
"Trump administration pushes to sell Alaska oil leases pre-Biden inauguration"
"King: If Trump thinks 2016 was a landslide, 2020 is as well"
"Goodbye, Golden Goose"
"Trump says \"time will tell\" which administration handles COVID next, stopping short of formal concession"
"The far right is cracking up, as their violent fantasies of Trump's fascist takeover evaporate. QAnon, the Proud Boys and white nationalist groups flail around helplessly as twilight falls on the Trump era"
"Pennsylvania court rejects five Trump campaign, GOP legal challenges to ballots"
"Another law firm bails out on Trump campaign"
"Donald Trump wants to run the Republican party even if he leaves office. Can he?"
"3 scholars say Trump isn’t staging a coup — but he still poses a threat to democracy"
"Law firm Porter Wright withdraws from representing Trump in Pennsylvania case"
"Trump \"determined\" to make Biden transition \"as turbulent as possible,\" former NSC McMaster says"
"Every day Trump refuses to get out of the way he puts our country in danger | Every Republican should be calling Trump out. No more coddling the crybaby, giving him time to come around. Our nation’s best interests can’t wait."
"Fact-checking Trump’s distortions and outright lies about the 2020 election and COVID-19 vaccine"
"Yellen Under Consideration by Biden Team for Treasury Chief"
"Discussion Thread: President Donald Trump’s News Conference on Operation Warp Speed"
"Law Firm Stops Representing Trump Campaign in Pennsylvania Suit"
"Trump will remain President-elect Biden's greatest obstacle even after he takes office"
"The crisis isn’t Trump. It’s the Republican Party."
"That’s a Wrap: Biden Takes Georgia to End Nailbiter 2020 Election"
"Trump Campaign Lawyer Comically Filed Election Lawsuit in Court That Had No Authority to Hear the Case"
"130 Secret Service officers enter quarantine after testing positive for coronavirus or being exposed to Trump"
"Meghan McCain to Trump: I like people who don’t lose Arizona"
"Trump urges Congress to pass a 'big and focused' coronavirus relief bill in 1st stimulus comments since losing the election"
"Top CEOs met to discuss Trump's refusal to concede to Biden"
"Judge blasts Trump administration’s “sloppy” climate analysis in oil case"
"Europe's Populists Loved Trump, Now They Are Dropping Him Hard"
"Obama hits Trump for refusing to concede, says there's 'no legal basis' for challenges"
"Bolton urges Republicans: ‘Acknowledge the reality that Biden is the president-elect’"
"Lou Dobbs demands GOP help Trump fight for 'what is rightfully his'"
"Second Major Law Firm Representing Trump in Election Lawsuits Abandons Ship"
"Joe Biden Becomes First Democrat to Win Arizona's Maricopa County Since Truman"
"Trump’s attempts to challenge the election results suffer further setbacks"
"Bye, Bye, ‘Sharpiegate’: Trump Campaign Hastily Retreats from Conspiracy-Laden Lawsuit After Brutal Hearing"
"The US has been breaking new COVID-19 case records on a daily basis while Trump shares unsubstantiated voter fraud claims on Twitter"
"Trump won't run for president in 2024 because he's too scared to 'lose like this again,' says his niece Mary"
"Newsmax chief says he’d welcome Trump to his cable channel but ‘we don’t want to be Trump TV’"
"The “Real Time” host exposed just how empty the soon-to-be-former president’s allegations of widespread voter fraud really are."
"Final Trump Days Ripe for Settling Scores, Pardoning Allies"
"Rebuking Trump, DHS cybersecurity agency says no evidence of deleted, changed votes"
"‘I like people who don’t lose Arizona’: As Biden officially flips Arizona, Meghan McCain celebrates"
"What Happens to Never Trump Republicans Now?"
"Angus King calls Trump's refusal to share intel with Joe Biden ‘dangerous for national security’"
"Republican Congressman Says Donald Trump Has Boarded the 'Crazy Train' With His Election Claims"
"130 Secret Service Officers Are in Quarantine or Have COVID After Trump’s Reckless Campaign"
"Donald Trump keeps baselessly claiming voter fraud in cities. But suburbs actually lost him the election"
"Biden's toughest foreign policy challenge may be regaining allies' trust"
"Fox News' Chris Wallace dismisses network reporter's claim that Trump's \"winning even as he's losing\""
"The Death Toll of Donald Trump’s Delay Tactics | Tens of thousands may die between now and President-elect Joe Biden’s inauguration."
"Biden's team says he will get daily briefings from his COVID-19 coordinator, unlike Trump who often blanks his task force for weeks"
"How Trump’s Voter Fraud War Room Became a Fart-Infused ‘Room From Hell’"
"Trump asked aides if he could pursue a wild plan to replace the electoral college with loyalists who would ignore the vote, report says"
"Chris Hayes Explains How The GOP Is Already Setting 'Booby Traps' For Biden | All In | MSNBC"
"Trump supporters gather in Washington as president refuses to concede to Biden"
"Law Professor Jonathan Turley Pushes Debunked Vote-Switching Conspiracy Theory, Offers President’s Supporters False Hope"
"Trump: New York will get coronavirus vaccine last because of Cuomo’s comments"
"Biden is bringing back the daily briefing. Here's who is likely to be at the podium."
"The secret weapon in Biden's fight against climate change"
"Christopher Krebs Hasn’t Been Fired, Yet"
"Donald Trump hints at Joe Biden taking office as he speaks publicly for the first time since defeat"
"Trump loses election lawsuits in Pennsylvania and Michigan, drops Arizona case"
"Trump’s media favorites battle for the Trump trophy"
"Heads roll as Trump launches post-election purge"
"Obama Warns Of ‘Dangerous Path’ With GOPers Refusing To Accept Trump’s Defeat"
"Candidate Trump decried the national debt in 2016 and promised to eliminate it. It's only gotten bigger."
"No US national lockdown despite surging Covid cases, says Biden adviser | Instead, the administration will try to target the regions hit hardest"
"Controversial Trump Fed board pick Judy Shelton gets closer to confirmation"
"Lawrence: ‘It’s All Over’ For William Barr &amp; Donald Trump | The Last Word | MSNBC"
"Rebuilding Trump's Broken Global Tech Policy Won't Be Easy"
"Joe Biden's Options To Combat Climate Change"
"Voters in six states getting phone calls from pro-Trump ‘voter integrity’ group"
"Trump keeps making arguments about the election on Twitter that he won't make in court"
"Biden considers Hillary Clinton for UN ambassador role"
"Trump supporters gather in Washington as he pushes false election claims"
"Biden camp hopes to get past Republican fear of Trump, McConnell stonewalling"
"Biden aide says no U.S.-wide COVID lockdown planned as West Coast states advise against travel"
"Biden takes Arizona, first Democrat to win there since 1996"
"The election is over, we do have a new president’: Lawyer who successfully argued Bush v Gore says Trump should accept defeat | Ted Olson said the constitution ‘works pretty well at the end of the day’ because it means ‘flawed individuals’ will get voted out"
"Trump Supporters Descend On Washington For Events Contesting Biden's Victory"
"Law firm withdraws from Trump election suit in Pennsylvania"
"Van Jones: President Trump is strapping the country onto his own kamikaze plane"
"2020 Shows That the Electoral College Is Stupid and Immoral"
"‘Time will tell’: US President Trump hints at departure"
"Trump putting democracy to the test after his loss to Biden"
"How Trump’s Voter Fraud War Room Became a Fart-Infused ‘Room From Hell’"
"Trump says New York State won't get first batch of vaccines due to Governor Cuomo"
"Republican candidates follow Trump's lead not to concede in their races"
"Michigan judge says cheating claims based on ignorance of how elections work"
"Trump Is No Longer Even Pretending To Care About His Job"
"Time is running out for President Trump's election challenges"
"'Abuse of the rule of law': 1,000 ex-judges, legal experts slam Trump's false claims of voter fraud"
"As Soon as Trump Leaves Office, He Faces Greater Risk of Prosecution The president is more vulnerable than ever to an investigation into his business practices and taxes."
"Biden set to roll back Trump rules on abortion"
"Trump lawyers withdraw from key Pennsylvania case challenging vote count"
"‘Fox &amp; Friends’ Host Steve Doocy Debunks Trump’s Dominion Voter Fraud Conspiracy Pushed by Fox Stars"
"Trump’s White House is ‘hollowed out’ due to coronavirus as president spews misinformation and acts on impulse A wave of coronavirus infections in the west wing is leaving the president alone at a critical moment as he continues to lie about the results of the 2020 US election"
"‘306’: Dems tease Trump with projected Biden win which he once called a landslide"
"The Cult Myth: Why Trumpism Won't Disappear with Trump"
"A senator who could become Biden's attorney general said breaking up Google should be 'on the table'"
"In Arizona, the final votes and the final call go for Biden"
"Trump battles Cuomo over vaccine plan"
"Trump Apparently Thinks Rudy Giuliani Can Save His Flailing Court Battles"
"Can Trump win with 'fantasy' electors bid? State GOP leaders say no"
"Joe Biden Promises to Raise Annual U.S. Refugee Target by 800%"
"Trump supporters and far-right groups rally in Washington to protest election results"
"'Bad Boy For Life' Trump Might Leave The White House Without Shaking Biden's Hand"
"Trump's shuffling of the Pentagon makes for a rough transition"
"Trump breaks public silence, but doesn't talk election | TheHill"
"Trump thrills protesting supporters with motorcade drive-by"
"The “Real Time” host exposed just how empty the soon-to-be-former president’s allegations of widespread voter fraud really are."
"Joe Biden Has Won Georgia. He’s The First Democrat To Win The State In Decades."
"No US national lockdown despite surging Covid cases, says Biden adviser | Instead, the administration will try to target the regions hit hardest"
"Controversial Trump Fed board pick Judy Shelton gets closer to confirmation"
"White House Press Secretary Kayleigh McEnany Wildly Exaggerates Trump March Crowd Size"
"The purge at the Pentagon - The potential for sudden troop withdrawals should spur Congress to curtail Trump’s powers in his final weeks as president."
"Trump’s Men in Moscow - Russian Media Revels in Trump’s Nonsensical Claims of Fraud as Enemies of Democracy Reap Propaganda Harvest."
"John King: If Trump thinks 2016 was a landslide, 2020 is as well"
"Biden solidifies win with Georgia victory as Trump appears to hint at presidency changing hands"
"Trump Is Going Out Like He Came In: With His Press Secretary Lying About Crowd Size"
"AP Fact Check: Trump tweets a tall tale of ‘deleted’ votes"
"Trump, for once, listened when aides told him to lay low"
"US sees record 184,000 new daily Covid cases as Trump politicises vaccine effort"
"Trump’s media favorites battle for the Trump trophy"
"Christopher Krebs Hasn’t Been Fired, Yet"
"Trump supporters chant 'Four more years!'; at Washington rally as he pushes false election claims"
"Chris Hayes explains how the GOP is already setting ‘booby traps’ for Biden"
"Trump will remain President-elect Biden's greatest obstacle even after he takes office"
"Trump’s far-fetched legal campaign to question the election seems to be falling apart"
"Fake posts promoting 'free pancakes' at Trump Hotel before DC rally spread on social media"
"Georgia Democrats Ask Judge to Shut Down Trump Supporters’ Lawsuit: This ‘Gambit’ Is Backed by No ‘Concrete, Credible Evidence’"
"Evangelicals have been loyal Trump supporters. Where should they go now?"
"Donald Trump hints at Joe Biden taking office as he speaks publicly for the first time since defeat"
"Watch Trump Get Really Close to Admitting He Lost the Election"
"Trump supporters gather in Washington as he pushes false election claims"
"No longer mirror of US, Ohio’s electoral bellwether quiets"
"The $15 Minimum Wage Won in Florida, But Biden Didn't. Here's Why — Activists say the key was actually talking about working-class issues."
"Goodbye, Golden Goose"
"Trump supporters gather in Washington as president refuses to concede to Biden"
"'You Lost': Chris Evans Lambasts Trump and Four Seasons Landscaping Gaffe"
"Fact-checking Trump’s distortions and outright lies about the 2020 election and COVID-19 vaccine"
"Republicans try packing the Fed before Trump exits"
"Trump battles Cuomo over vaccine plan"
"Trump administration pushes to sell Alaska oil leases pre-Biden inauguration"
"Biden plans to reach across the aisle – but is he walking into a Republican trap?"
"Christiane Amanpour compares Trump administration ‘assault on values’ to Kristallnacht"
"Trump Supporters Descend On Washington For Events Contesting Biden's Victory"
"Mike Pence suggests the Trump administration will be in place for four more years despite Biden victory: 'That's the plan'"
"Yellen Under Consideration by Biden Team for Treasury Chief"
"Biden is considering Janet Yellen for Treasury Secretary, potentially making her the first woman to hold the role: report"
"Trump’s Post-Election Power Grab Isn’t Just Selfish, It’s Dangerous to Democracy"
"With 'Irrevocable Injustice' on the Line, Democratic Lawmakers Demand Trump Admin Put Brakes on Federal Killing Spree"
"Biden's incoming chief of staff Ron Klain opposed COVID-19 lockdowns early in pandemic"
"Pro-Trump Protesters March Through Washington Streets"
"White House press secretary Kayleigh McEnany insists that Trump will attend 'his own' inauguration in January"
"Out Of Sight And Going Out Of His Mind. Hold Up in the White House, Trump Rages; Finally, He Feels Shame"
"Biden Wants Census To See 'Invisible' Groups: LGBTQ, Middle Eastern, North African"
"Detroit Police Chief admits to treating 'peaceful' Trump supporters differently than Black Lives Matter protesters"
"The secret weapon in Biden's fight against climate change"
"Lawyers decided to quit Trump case after chaotic Four Seasons Landscaping press conference"
"Trump urges Congress to pass a 'big and focused' coronavirus relief bill in 1st stimulus comments since losing the election"
"Trump Drives by Supporters Gathered in D.C. for ‘Million MAGA March’"
"Trump Almost Admits He Lost Election, Says 'Time Will Tell'"
"Biden wins Georgia as Trump continues unsupported fraud claims, secures North Carolina | U.S. president-elect's legal team confident Georgia recount won't change results"
"‘Time will tell’: US President Trump hints at departure"
"Count on Biden to Restore the National Monuments Trump Trashed"
"Before Biden inauguration, 70,000 more could die from COVID-19 in the U.S."
"New federal lawsuit seeks to throw out 1.2 million votes in Michigan, flipping the state for Trump"
"Trump rails against Georgia Gov. Kemp for consent decree aimed at helping minority voters"
"Beyond irresponsible: Republicans must put Americans and reality ahead of fealty to Trump | Republicans are embarrassing America. It's past time to admit Trump lost, congratulate Biden, stop spouting misinformation and move on to a transition."
"Trump’s attempts to challenge the election results suffer further setbacks"
"Philadelphia suburbs return with a vengeance to oust Trump"
"Biden Asked Republicans to Give Him a Chance. They’re Not Interested."
"President Trump threatens to withhold COVID-19 vaccine from New York in new feud with Governor Cuomo"
"Throngs of President Trump's supporters gather at Freedom Plaza for Saturday rallies"
"Trump drives by supporters showing up for DC march"
"Million MAGA March: Protesters gather for pro-Trump rallies"
"Judges rule against 6 Trump campaign lawsuits to invalidate nearly 9,000 Pennsylvania ballots"
"Joe Biden's popular vote share is third largest by presidential challenger in election history"
"Trump cheered as motorcade drives through far-right ‘Million MAGA March’ rally in DC"
"New York Times: Rudy Giuliani put in charge of Trump's election lawsuits after series of losses"
"Trump to rush drilling leases in Arctic before Biden takes over"
"Law Professor Jonathan Turley Pushes Debunked Vote-Switching Conspiracy Theory, Offers President’s Supporters False Hope"
"K-pop fans protest pro-Trump rally with pancake tweets"
"Rebuilding Trump's Broken Global Tech Policy Won't Be Easy"
"Sore loser or victim? Trump voters struggle with president’s role in defeat."
"U.S. could see 13 million more COVID cases before Biden is sworn in as president"
"Trump bans Americans from investing in 'Chinese military-linked' firms"
"Trump greets hundreds of supporters descending on D.C. to falsely claim he won election"
"White men swung to Biden. Trump made gains with Black and Latino voters. Why?"
"Trump Taps Giuliani to Lead Election Lawsuits After Disastrous Day of Losses"
"How hate for Trump may have triumphed over love for Biden — and Trump"
"Biden’s victory came from the suburbs"
"Trump Puts Democracy To The Test After Losing Presidency To Biden : For the first time, a sitting U.S. president tries to convince voters to not believe results clearly showing he lost."
"Secret intelligence exists that ‘would cast Trump in very negative light’, warns ex-FBI chief"
"Vaccine czar calls on Trump to allow contact with Biden - Operation Warp Speed head warns thousands of lives at stake if project interrupted."
"Jared and Ivanka are poised to return to a Manhattan social scene that no longer welcomes them"
"3 scholars say Trump isn’t staging a coup — but he still poses a threat to democracy"
"GOP leaders in 4 states quash dubious Trump bid on electors"
"Biden aide says no U.S.-wide COVID lockdown planned as West Coast states advise against travel"
"Biden likely to break barriers, pick woman to lead Pentagon"
"Trump had a very bad Friday in court with his election cases. They're headed for more action next week"
"250,000 Dead Americans by Thanksgiving as Trump Keeps Tweeting | The entire country is being crushed by the virus, Trump doesn’t care, Biden does, but he can’t do anything about it."
"Trump is going out the way he came in: A loser, a liar and a cheat"
"Trump-appointed election official says president’s claims are ‘baffling’ and court evidence ‘laughable’"
"Georgia's Blue Shift Is A Lesson For Progressive Organizers Across The South"
"Deb Haaland says 'of course' she would serve as Interior secretary under Biden; she would be the first Native American in the Cabinet, and overseeing public lands."
"Biden Stocks Transition Teams with Climate Experts"
"Joe Biden's Options To Combat Climate Change"
"Lou Dobbs demands GOP help Trump fight for 'what is rightfully his'"
"Giuliani Time: Trump Taps Rudy To Lead Legal Challenges That Are Going Nowhere"
"Donald Trump, Fox News, and the future of right-wing media"
"Donald Trump wants to run the Republican party even if he leaves office. Can he?"
"Trump putting democracy to the test after his loss to Biden"
"On Eve of ‘Stop the Steal’ Rally, Ed Martin Hosts Right-Wing Archbishop Viganò to Pray For Trump"
"Obama White House Veterans Urge Biden To Embrace Executive Action"
"Trump Could Lose Far More Than the White House"
"A Judge Found Republicans' Claims Of Vote Fraud In Detroit \"Incorrect And Not Credible\""
"Trump says \"time will tell\" which administration handles COVID next, stopping short of formal concession"
"A 'last nod to Trump'? Some countries still silent a week after Biden's win"
"Trump wavers between reality and election fiction with eye on his legacy during Rose Garden vaccine address"
"Biden demands urgent federal COVID action as Trump feuds with Cuomo"
"Donald Trump lost the 2020 election, but misinformation will continue to win"
"Thank God, it’s over! (Isn’t it over? Oh, God . . .)"
"What Happens to Never Trump Republicans Now?"
"Biden aide says no U.S.-wide COVID lockdown planned as West Coast states advise against travel"
"Final Trump Days Ripe for Settling Scores, Pardoning Allies"
"The US president-elect is interested in Australia's COVID-19 response. This is what Scott Morrison sent Joe Biden's team"
"Biden's toughest foreign policy challenge may be regaining allies' trust"
"Giuliani wrecks Trump campaign's well-laid legal plans"
"Trump puts personal lawyer Rudy Giuliani in charge of all election lawsuits"
"King: If Trump thinks 2016 was a landslide, 2020 is as well"
"Trump COVID-19 outreach to governors drops off"
"Republicans are playing with fire. And we all risk getting burned | The party is challenging the outcome of the election without any proof of fraud. Their degradation of democracy will reverberate for years to come"
"Fox's Lou Dobbs Has Full-On Election Meltdown: Denies Trump What's 'Rightfully His'"
"Time is running out for President Trump's election challenges"
"2020 Election Recap, Discord Chat, and What’s To Come"
"Heads roll as Trump launches post-election purge"
"How Trump’s Voter Fraud War Room Became a Fart-Infused ‘Room From Hell’"
"Biden faces tough choice of whether to back virus lockdowns"
"Trump Says COVID-19 Vaccine Could Arrive By April But Not In New York; Cuomo Erupts"
"Europe's Populists Loved Trump, Now They Are Dropping Him Hard"
"Can Trump win with 'fantasy' electors bid? State GOP says no"
"Newsmax chief says he’d welcome Trump to his cable channel but ‘we don’t want to be Trump TV’"
"Biden camp hopes to get past Republican fear of Trump, McConnell stonewalling"
"Obama says Biden's margin of victory over Trump is bigger than Trump's margin over Clinton in 2016"
"Trump’s New Clothes"
"‘They know their vote matters’: the Georgia Senate runoffs battle is already on | Trump’s defeat in the reliably red state has shown Democratic voters the power of their ballot, activists say as they focus on Ossoff and Warnock’s races"
"Donald Trump, Kellyanne Conway’s ‘Landslide’ Boasts Come Back To Haunt Them"
"Fox News' Chris Wallace dismisses network reporter's claim that Trump's \"winning even as he's losing\""
"Trump mulls a future outside the White House as 2020 options fade"
"The Cult Myth: Why Trumpism Won't Disappear with Trump"
"Lawrence: ‘It’s All Over’ For William Barr &amp; Donald Trump | The Last Word | MSNBC"
"Rudy Giuliani is reportedly taking charge in Trump's election legal battles — and Twitter is having a field day with it"
"Far-right groups plan DC rallies for Trump as tensions grow"
"President Donald Trump says he refuses to have another lockdown as coronavirus cases surge across the country, but he suggested one could be in the offing should he lose his legal challenges to overcome his election loss to President-elect Joe Biden."
"Van Jones: President Trump is strapping the country onto his own kamikaze plane"
"Republicans Face Setbacks In The Courts, Trump Law Firm Steps Down"
"Republican candidates follow Trump's lead not to concede in their races"
"Trump's Voter Fraud Claims Are Now Being Debunked By His Own Government"
"Can Biden convince red states to wear masks?"
"Trump breaks his silence, but doesn't pack a punch"
"Trump campaign enjoys minor victory in Pennsylvania lawsuit over voter ID"
"Democrats need to clearly embrace popular, progressive policies or they will continue to fail in down ballot elections"
"Trump Supporters Head to the Streets as He Pushes False Election Claims"
"Two \"dead voters\" cited by Trump as proof of Georgia ballot fraud are alive"
"Nolte: Trump Contesting the Election Is Patriotic and Vital for American Democracy"
"Law firm withdraws from Trump election suit in Pennsylvania"
"Biden HUD secretary frontrunner praised top communist as her 'mentor'"
"Judge blasts Trump administration’s “sloppy” climate analysis in oil case"
"Trump Election Challenges Hamstrung by Hapless Witnesses"
"Voters in six states getting phone calls from pro-Trump ‘voter integrity’ group"
"Trump Again Boasts He Won Pennsylvania And Georgia; Twitter Slaps Him Down"
"After $15 billion and 450 miles, Joe Biden will halt border wall, Trump’s signature project"
"Trump speaks for first time since Joe Biden became President-elect"
"Lincoln project ad accuses GOP of \"acting like China, Iran, North Korea\" for refusing to accept Trump's election loss"
"Rebuking Trump, DHS cybersecurity agency says no evidence of deleted, changed votes"
"President Trump taps Rudy Giuliani to take over election legal fight | Prior lawyers pulled out of a federal lawsuit in Pennsylvania FridAY."
"Money to support Trump court fight could flow to president and his family"
"Thomas Friedman on GOP: This is not a political party. It's a cult"
"The US has been breaking new COVID-19 case records on a daily basis while Trump shares unsubstantiated voter fraud claims on Twitter"
"The Trump-Fox News relationship is coming to a head. Here's what might be coming next"
"Cooper: Trump's outrage doesn't matter. Here's what does"
"In Arizona, the final votes and the final call go for Biden"
"Prosecutors who AG Bill Barr dispatched to investigate Trump's evidence-free claims of mass election fraud say they found no substantial irregularities"
"Biden considering Yellen as possible Treasury secretary: report"
"Nikki Haley, a high-profile Republican and possible 2024 presidential hopeful, has remained silent about Trump's unfounded election fraud claims"
"Trump puts Giuliani in charge of election lawsuits: report"
"Chris Hayes Explains How The GOP Is Already Setting 'Booby Traps' For Biden | All In | MSNBC"
"Was Trump ever as unpopular as we thought?"
"Progressives look to make early mark on Biden White House."
"Biden solidifies U.S. election win, Trump says 'time will tell' if he stays in power"
"Obama hits Trump for refusing to concede, says there's 'no legal basis' for challenges"
"In Trump’s final days, a 30-year-old aide purges officials seen as insufficiently loyal"
"Mr. President, Pack Your Bags and Be Gone | Trump wants to preserve, protect and defend only himself."
"Defense secretary sent classified memo to White House about Afghanistan before Trump fired him"
"How Trump’s Voter Fraud War Room Became a Fart-Infused ‘Room From Hell’"
"Chelsea Clinton Blames Trump For Secret Service COVID Infections"
"Trump: New York will get coronavirus vaccine last because of Cuomo’s comments"
"Haspel not in attendance at latest Trump intelligence briefing: reports"
"Angus King calls Trump's refusal to share intel with Joe Biden ‘dangerous for national security’"
"Trump threatens to deny New York a vaccine. See governor's response"
"As Trump refuses to concede, his agencies awkwardly prepare what they can for a Biden transition"
"Every day Trump refuses to get out of the way he puts our country in danger | Every Republican should be calling Trump out. No more coddling the crybaby, giving him time to come around. Our nation’s best interests can’t wait."
"First black woman crowned Miss USA deemed ‘gun-loving Trump fan’ and the left can’t handle"
"Joe Biden’s cancer charity spent more than $3.7million on staff salaries but distributed ZERO towards research grants over two years, tax filings reveal"
"More Protective MAGA Helmets Now Available For Trump Supporters Brave Enough To Go Out In Public"
"Biden Called Out For Silence As Leftists Attack Pro-Trump Demonstrators In Nation’s Capital | The Daily Wire"
"Twitter Claims Trump Conceded, He Counters: “I concede NOTHING!”"
"Fauci Showed Breakthrough Pfizer COVID Vaccine Results To Biden Before Trump"
"Elderly Trump supporter attacked, protesters shoot fireworks at diners, surround hotel of Million MAGA March attendees"
"South Dakota Gov. Noem Won't Enforce Biden's Mask Mandate Tyranny"
"Trump: Antifa Waited Until Most People Left MAGA Rally to Attack"
"Sharyl Attkisson: Media plotted to destroy Trump, cover for Biden"
"Professor: Trump rose because government hasn’t served the people"
"Biden cancer \"charity\" spent millions on salaries, zero on research"
"Georgia Senate candidate Raphael Warnock: People in US need to 'repent' for Trump and 'worship of whiteness'"
"What’s the most expensive tweet in Twitter history? I nominate Kathryn Murdoch’s post-election tweet, “We did it!” The corruption of Fox News triggers flashbacks to the fall of the former dissident website Drudge Report, which went full Never Trump."
"Watching the footage of all the violence against Trump supporters in DC got me like..."
"Fury as Mayor tells Chicago to CANCEL Thanksgiving over Covid…days after celebrating Biden win maskless in crowd"
"Let's get ready to RATIOOO! Dems claiming Biden will 'restore the soul of this nation' as Biden supporters BEAT on Trump supporters in DC BACKFIRES"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Trump Tweet: Our election was hijacked. There is no question. Congress has a duty to #ProtectOurDemocracy &amp; #FollowTheFacts.... oh, wait, that was Nancy Pelosi in 2017."
"Maria Bartiromo: Don’t censor her and don’t call her a conspiracy theorist. She said she believes Trump was the victim of an attempted coup that began even before his election"
"Why Trump supporters are here for good"
"BLM Attacks Pro-Trump Black Woman Pushing Stroller after D.C. Rally"
"Protesters Stomp on Trump Supporter's Head After D.C. Rally"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Sanders to Trump: ‘Man-Up’ and Say You Lost the Election"
"'Far from over': 'MAGA' diehards pledge allegiance to Trump at Supreme Court"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"After attacking them earlier in the streets, Antifa and BLM now harassing Trump supporters at restaurants and hotels in DC"
"Joe Biden Promises to Raise Annual U.S. Refugee Target by 800%"
"'I'm NOT Hunter Biden, lunchbox.' Dana Loesch takes down HORDE of frothy-mouthed, chest-thumping harpies trying to #FireGinaCarano"
"Jon Meacham Fired By MSNBC for Failure to Disclose Writing Biden Speech He Praised On The Air"
"Giuliani: Trump 'Far From' Conceding Election To Biden"
"Confirmed: Biden Cancer Initiative Spent on Salaries -- and Little Else"
"Fox’s Wallace: Trump Can’t ‘Credibly’ Say the Election Was Taken from Him — No ‘Serious Fraud’"
"Biden COVID Advisory Board Member: Indoor Dining, Gyms, and Gatherings in Homes Should Be Targeted ‘for Closures’"
"Trump: Georgia's Election Recount a 'Waste of Time' -- officials won't allow his campaign's observers to be in the counting rooms"
"For First Time, Trump Says Biden ‘Won,’ But Again Claims ‘Election Was Rigged’ | The Daily Wire"
"Antifa Goes Wild in D.C., Attacking Trump Supporters, Even Terrorizing Children and the Elderly"
"Fox News Anchor Blows Up on Trump Spokeswoman as the Descent Continues"
"CNN’s Acosta Projecting: Trump Will Become Just ‘Another Crackpot On The Internet’ After Jan. 20 | The Daily Wire"
"Massive Crowds March in DC to Show Support for Trump, Demand Election Integrity"
"Leftists Violently Attack Trump Supporters In Nation’s Capital Following ‘MAGA March’ | The Daily Wire"
"Trump Card?"
"Joe Biden promises to raise annual number of refugees admitted to US from 15,000 to at least 125,000"
"Biden's 'I'm no Trump' campaign is not enough to govern"
"Post-election announcement of vaccine ripped by White House -- Biden was notified of vaccine the night before while WH only learned through news reports."
"Violent Left Terrorizes DC: BLM Thug Holding “Trump Pence Out Now!” Sign Sucker Punches, Knocks Out White Male From Behind [VIDEOS]"
"Trump Makes Appearance At ‘Million MAGA March’ In D.C. | The Daily Wire"
"Gov. Kristi Noem won't comply with Biden face mask mandate: He 'doesn't have the authority'"
"BREAKING: President Trump Makes Surprise Appearance As Thousands March In DC To Show Their Support For Him…#MarchForTrump"
"President Trump: COVID vaccine should be approved in coming weeks"
"Million MAGA March: Supporters explain why they're still backing Trump"
"Violence erupts in DC as counter-protesters assault Trump supporters"
"President Trump Drives by Supporters in DC for 'Million MAGA March'. 'Chants of “USA! USA!” “We want Trump! We want Trump!” and “Four more years! Four more years!” could be heard.'"
"'Ready To Help': Biden Spoke At PA Election Board Chairman's Party"
"CNN’s Acosta: Trump Will Become Just ‘Another Crackpot On The Internet’ After Jan. 20 | The Daily Wire"
"Violence occurs after rally in the nation's capital; Trump calls out Antifa"
"An MRC study finds that 4.6% of Joe Biden voters would NOT have voted for him had they known about the Biden family's corrupt business dealings."
"Law Firm That Dropped Trump Advises CCP-Linked Firms, Aided In Outsourcing U.S. Jobs To China"
"CNN Compares The Trump Administration To Genocidal Nazi Germany"
"For those of you wondering, here's a podcast where Giuliani lays out current legal cases and the path remaining for Trump. Great listen!"
"Thousands flock to DC for pro-Trump rally"
"Biden Transition Official Believes the First Amendment Has a 'Design Flaw' -- His Remedy Is to Curb Free Speech"
"Trump rails against Georgia recount process"
"'Sigh of Relief': U.N. Joins Globalist Agencies to Await Biden Handouts"
"Trump supporters protests turn into violent clashes with anti-demonstrators"
"Kristi Noem fires back at former president Obama over his characterization of America in his forthcoming memoir"
"Pennsylvania Won't Need a Recount to Certify Biden Victory, State Says"
"Walked a fine line’: how Fox News found itself in an existential crisis"
"Biden’s Media Campaign"
"Trump drives by supporters at DC march"
"Pollster: It's Curious How Biden Underperformed Hillary Clinton In Every City...Except These Four: Milwaukee, Detroit, Atlanta and Philadelphia."
"MSNBC’s exodus to work for Joe Biden shows it’s been shilling for him all along"
"US election: Trump appears to admit Biden victory in tweet"
"For President Trump, a larger fight endures after 2020 election"
"DHS boss Chad Wolf defies Trump order to fire cyber chief Chris Krebs"
"Lindsey Graham fires back after top Democrat demands no more hearings for Trump's judicial nominees"
"PHOTOS: Donald Trump Thrills D.C. Supporter Rally with Motorcade Drive-By"
"Pennsylvania Court Denies 5 Trump Campaign Legal Challenges"
"Media's hiding of Hunter Biden scandal robbed Trump of clear win: Poll"
"Retiring diplomat says defense officials misled Trump on troop count in Syria"
"Obama's WH Physician Issues Brutal Statement on Biden's Mental Health."
"Three Wisconsin Voters Band Together, File Election Lawsuit That Could Give Trump An Easy Win"
"CHAOS As BLM Terrorize Trump Supporters: ‘Radical Revolution Changes the World B*tch,\" [VIDEO]"
"Rep. Louie Gohmert, (R-TX): Foreign company had evidence of 'vote switching' -- Server 'seized' by U.S. Army forces after he gave information to President Trump"
"Logan Act: Communist China Congratulates Biden on 'Victory,' Opens Backchannel Talks"
"Trump Campaign Asks Pennsylvania Federal Judge To Order State To Provide Information About Mailed-In Ballots"
"If All the Fraud Is Uncovered, Trump Will Win -- How do we know? The people who tried to pull off this election heist are drawn from the same swamp as the conspirators in the Russia hoax."
"Pennsylvania, Michigan, Wisconsin: Here's an Update on Team Trump's Lawsuits and Recounts"
"(Clinton) Federal Judge Invalidates Trump Administration's DACA Rollback"
"How President Trump Surprised 'Million MAGA March' Participants"
"\"Violence erupts in DC as counter-protesters fight Trump supporters\""
"Milwaukee Elections Head Misplaced Crucial Voting Flash Drive"
"Wisconsin lawsuit seeks to toss 800,00 ballots -- Biden leads by 20,000 votes in state"
"Watch: fox lou dobbs sydney powell interview on dominion systems"
"Journalist Glenn Greenwald Rips 'The Most Pathological Liar' in Politics and Other Dems for Burying Hunter Biden Fiasco"
"First African-American Miss USA distances herself from Trump after social media backlash."
"If Media Didn't Think Trump Could Win, It Wouldn't be Targeting his Lawyers"
"President Trump wins North Carolina, hits 232 electoral votes"
"Plan B? Trump could receive second term from U.S. House in 'contingent election'"
"Hillary Clinton Supporter Alan Dershowitz: 'Trump Will Win the Pennsylvania Lawsuit'"
"ANTIFA and BLM demonstrate Biden's UNITY by physically assaulting PEACEFUL Pro-Trump MAGA Marchers"
"Poll: Media's hiding of Hunter Biden scandal robbed Trump of clear win"
"South Dakota Gov. Kristi Noem won't comply if Biden pursues national mask mandate"
"Durham’s Lame Duck Period: Democratic Leaders Suggest A Dim Future For Biden-Related Investigations"
"Trump Team to Call Million Plus Voters about Anomalies in 6 Contested States. “We’re calling them to confirm whether or not they actually cast the ballot, or if that ballot was cast by somebody else in their name”"
"Cindy McCain Says Late Husband Would Want Country to ‘Move on’ and Support Joe Biden"
"Law Firm Targeted by Cancel Culture Will No Longer Represent the Trump Campaign"
"Trump leaves 2024 door open with fundraising push"
"Victor Hansen: Will President Trump Ride Off Into the Sunset? (Shane...)"
"South Dakota Gov. Kristi Noem Wouldn’t Enforce a Biden National Lockdown"
"Trump said the vaccine will be available to everyone by April -- except residents in New York state where the governor has decided not to “for political reasons.”"
"Trump talks post-election fight: Trump says he's confident he will win the states needed to get to 270 electoral votes, \"Never bet against me.\""
"Trump wins North Carolina"
"Trump got more NYC votes in 2020 — including in the South Bronx"
"Gambling sites refuse to call election for Biden, leaving $600 million in limbo"
"Trump supporters descend upon Washington to defend the president Despite Defeat"
"Senior Administration Officials Lied To Trump About Troop Levels So He Wouldn’t Pull Out Of Syria"
"Pelosi vows to teach Trump-less McConnell a lesson despite shrunken House majority"
"Trump puts Giuliani in charge of election lawsuits: report"
"Alan Dershowitz Predicts Trump SCOTUS Win in Pennsylvania Ballot Case"
"Gov. Newsom says he shouldn't have attended birthday party at French Laundry amid COVID-19 surge"
"Former Reddit CEO Wants Trump SIlenced Online to Stop ‘A Coup’"
"Trump walks back tweet saying Biden 'won' election"
"Watch Live: Pro-Trump Rally in Washington, DC"
"Jon Voight Condemns the 'Lie' of a Biden Win Amid America's 'Battle of Righteousness Versus Satan' -- Who would’ve ever guessed one of the biggest supporters of the Republican Commander-in-Chief would be…Brad Pitt’s father-in-law?"
"Democratic congresswoman compliments way Trump 'doesn't talk down to people' unlike some 'woke' Democrats"
"A dark look into Biden's America: Norway criminalizes private criticism of LGTBQ people"
"Biden Says He Is Considering Adding Metamucil To His Cabinet"
"Kyle Rittenhouse's Mother Tears Into Joe Biden for Smearing Her Son as a White Supremacist"
"WATCH: CNN Runs Segment Comparing Trump To Nazis Purging Jews | The Daily Wire"
"Family Income Rose Drastically Under Trump, Meaning His Economy Was Better Than Obama’s"
"Harmeet Dhillon: GOP Paid Millions to Lawyers Who Abandoned Trump"
"Organization That Made Public Blacklist of Trump Supporters Shuts Down After Massive Backlash"
"Juliet Samuel: The American era is over if Biden abandons President Trump's toughness on China"
"'Sigh of Relief': U.N. Joins Globalist Agencies to Await Biden Handouts"
"DHS boss Chad Wolf defies Trump order to fire cyber chief Chris Krebs"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"Biden Transition Official Believes the First Amendment Has a 'Design Flaw' -- His Remedy Is to Curb Free Speech"
"Giuliani: Trump 'Far From' Conceding Election To Biden"
"CNN’s Acosta: Trump Will Become Just ‘Another Crackpot On The Internet’ After Jan. 20 | The Daily Wire"
"Violence occurs after rally in the nation's capital; Trump calls out Antifa"
"First African-American Miss USA distances herself from Trump after social media backlash."
"Joe Biden promises to raise annual number of refugees admitted to US from 15,000 to at least 125,000"
"Jon Meacham Fired By MSNBC for Failure to Disclose Writing Biden Speech He Praised On The Air"
"Joe Biden Promises to Raise Annual U.S. Refugee Target by 800%"
"Watching the footage of all the violence against Trump supporters in DC got me like..."
"For First Time, Trump Says Biden ‘Won,’ But Again Claims ‘Election Was Rigged’ | The Daily Wire"
"CNN’s Acosta Projecting: Trump Will Become Just ‘Another Crackpot On The Internet’ After Jan. 20 | The Daily Wire"
"Confirmed: Biden Cancer Initiative Spent on Salaries -- and Little Else"
"Why Trump supporters are here for good"
"'Ready To Help': Biden Spoke At PA Election Board Chairman's Party"
"Trump walks back tweet saying Biden 'won' election"
"Walked a fine line’: how Fox News found itself in an existential crisis"
"Donald Trump is the only legitimate ‘President-Elect’"
"Sanders to Trump: ‘Man-Up’ and Say You Lost the Election"
"Lefties Assumed Trump Was Conceding... Until He Crushed Their Dreams (Again)."
"Twitter Claims Trump Conceded, He Counters: “I concede NOTHING!”"
"Trump: Antifa Waited Until Most People Left MAGA Rally to Attack"
"Durham’s Lame Duck Period: Democratic Leaders Suggest A Dim Future For Biden-Related Investigations"
"Let's get ready to RATIOOO! Dems claiming Biden will 'restore the soul of this nation' as Biden supporters BEAT on Trump supporters in DC BACKFIRES"
"First black woman crowned Miss USA deemed ‘gun-loving Trump fan’ and the left can’t handle"
"What’s the most expensive tweet in Twitter history? I nominate Kathryn Murdoch’s post-election tweet, “We did it!” The corruption of Fox News triggers flashbacks to the fall of the former dissident website Drudge Report, which went full Never Trump."
"Biden Called Out For Silence As Leftists Attack Pro-Trump Demonstrators In Nation’s Capital | The Daily Wire"
"Sharyl Attkisson: Media plotted to destroy Trump, cover for Biden"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Fauci Showed Breakthrough Pfizer COVID Vaccine Results To Biden Before Trump"
"US election: Trump appears to admit Biden victory in tweet"
"'I'm NOT Hunter Biden, lunchbox.' Dana Loesch takes down HORDE of frothy-mouthed, chest-thumping harpies trying to #FireGinaCarano"
"Elderly Trump supporter attacked, protesters shoot fireworks at diners, surround hotel of Million MAGA March attendees"
"Joe Biden’s cancer charity spent more than $3.7million on staff salaries but distributed ZERO towards research grants over two years, tax filings reveal"
"Biden COVID Advisory Board Member: Indoor Dining, Gyms, and Gatherings in Homes Should Be Targeted ‘for Closures’"
"Biden’s Media Campaign"
"The Grand New Party: Here’s What’s In Store For The Republican Party Without Trump At The Helm"
"'Far from over': 'MAGA' diehards pledge allegiance to Trump at Supreme Court"
"More Protective MAGA Helmets Now Available For Trump Supporters Brave Enough To Go Out In Public"
"South Dakota Gov. Noem Won't Enforce Biden's Mask Mandate Tyranny"
"Georgia Senate candidate Raphael Warnock: People in US need to 'repent' for Trump and 'worship of whiteness'"
"Biden's Daughter: Ashley Biden has a troubled and racy past but - now settled with her plastic surgeon husband"
"Million MAGA March: Supporters explain why they're still backing Trump"
"Trump supporters protests turn into violent clashes with anti-demonstrators"
"Biden Lied on the Grave of His Dead Son"
"Trump Card?"
"ANTIFA and BLM demonstrate Biden's UNITY by physically assaulting PEACEFUL Pro-Trump MAGA Marchers"
"Trump Has a Pathway to Victory. You're About to Learn a Lesson in the 'Trump Rules'"
"\"Violence erupts in DC as counter-protesters fight Trump supporters\""
"Violence erupts in DC as counter-protesters assault Trump supporters"
"Pennsylvania Won't Need a Recount to Certify Biden Victory, State Says"
"For President Trump, a larger fight endures after 2020 election"
"Violent Left Terrorizes DC: BLM Thug Holding “Trump Pence Out Now!” Sign Sucker Punches, Knocks Out White Male From Behind [VIDEOS]"
"For those of you wondering, here's a podcast where Giuliani lays out current legal cases and the path remaining for Trump. Great listen!"
"2 Million MAGA March Visited by Trump. Patriots Marched for Freedom in Merrie Olde England and Germany Too"
"Antifa Goes Wild in D.C., Attacking Trump Supporters, Even Terrorizing Children and the Elderly"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Fox News Anchor Blows Up on Trump Spokeswoman as the Descent Continues"
"CHAOS As BLM Terrorize Trump Supporters: ‘Radical Revolution Changes the World B*tch,\" [VIDEO]"
"President Trump: COVID vaccine should be approved in coming weeks"
"Professor: Trump rose because government hasn’t served the people"
"Victor Hansen: Will President Trump Ride Off Into the Sunset? (Shane...)"
"Protesters Stomp on Trump Supporter's Head After D.C. Rally"
"Leftists Violently Attack Trump Supporters In Nation’s Capital Following ‘MAGA March’ | The Daily Wire"
"Post-election announcement of vaccine ripped by White House -- Biden was notified of vaccine the night before while WH only learned through news reports."
"After attacking them earlier in the streets, Antifa and BLM now harassing Trump supporters at restaurants and hotels in DC"
"(Clinton) Federal Judge Invalidates Trump Administration's DACA Rollback"
"Law Firm Targeted by Cancel Culture Will No Longer Represent the Trump Campaign"
"Trump ‘to announce 2024 candidacy as soon as Biden certified winner’"
"Biden cancer \"charity\" spent millions on salaries, zero on research"
"BLM Attacks Pro-Trump Black Woman Pushing Stroller after D.C. Rally"
"Trump leaves 2024 door open with fundraising push"
"Trump: Georgia's Election Recount a 'Waste of Time' -- officials won't allow his campaign's observers to be in the counting rooms"
"Logan Act: Communist China Congratulates Biden on 'Victory,' Opens Backchannel Talks"
"Trump Campaign Asks Pennsylvania Federal Judge To Order State To Provide Information About Mailed-In Ballots"
"Maria Bartiromo: Don’t censor her and don’t call her a conspiracy theorist. She said she believes Trump was the victim of an attempted coup that began even before his election"
"Lindsey Graham fires back after top Democrat demands no more hearings for Trump's judicial nominees"
"Trump Makes Appearance At ‘Million MAGA March’ In D.C. | The Daily Wire"
"PHOTOS: Donald Trump Thrills D.C. Supporter Rally with Motorcade Drive-By"
"Pennsylvania Court Denies 5 Trump Campaign Legal Challenges"
"Trump rails against Georgia recount process"
"Fury as Mayor tells Chicago to CANCEL Thanksgiving over Covid…days after celebrating Biden win maskless in crowd"
"Massive Crowds March in DC to Show Support for Trump, Demand Election Integrity"
"Trump supporters descend upon Washington to defend the president Despite Defeat"
"Gov. Kristi Noem won't comply with Biden face mask mandate: He 'doesn't have the authority'"
"Pennsylvania, Michigan, Wisconsin: Here's an Update on Team Trump's Lawsuits and Recounts"
"Biden's 'I'm no Trump' campaign is not enough to govern"
"Biden wins election nine days after winning election"
"Cindy McCain Says Late Husband Would Want Country to ‘Move on’ and Support Joe Biden"
"How President Trump Surprised 'Million MAGA March' Participants"
"Trump Tweet: Our election was hijacked. There is no question. Congress has a duty to #ProtectOurDemocracy &amp; #FollowTheFacts.... oh, wait, that was Nancy Pelosi in 2017."
"President Trump Drives by Supporters in DC for 'Million MAGA March'. 'Chants of “USA! USA!” “We want Trump! We want Trump!” and “Four more years! Four more years!” could be heard.'"
"Will Israel attack Iran before Trump leaves office? | Spectator USA"
"Trump drives by supporters at DC march"
"Watch: fox lou dobbs sydney powell interview on dominion systems"
"Fox’s Wallace: Trump Can’t ‘Credibly’ Say the Election Was Taken from Him — No ‘Serious Fraud’"
"Obama's WH Physician Issues Brutal Statement on Biden's Mental Health."
"Law Firm That Dropped Trump Advises CCP-Linked Firms, Aided In Outsourcing U.S. Jobs To China"
"Thousands flock to DC for pro-Trump rally"
"If All the Fraud Is Uncovered, Trump Will Win -- How do we know? The people who tried to pull off this election heist are drawn from the same swamp as the conspirators in the Russia hoax."
"BREAKING: President Trump Makes Surprise Appearance As Thousands March In DC To Show Their Support For Him…#MarchForTrump"
"Pelosi vows to teach Trump-less McConnell a lesson despite shrunken House majority"
"K-pop fans protest pro-Trump rally"
"Watch Live: Pro-Trump Rally in Washington, DC"
"Anti-Trump Lions in the Press Turn Into Cuddly Biden Kittens"
"Poll: Media's hiding of Hunter Biden scandal robbed Trump of clear win"
"An MRC study finds that 4.6% of Joe Biden voters would NOT have voted for him had they known about the Biden family's corrupt business dealings."
"Developing: Milwaukee Elections Chief Lost Elections Flash Drive In Morning Hours Of November 4th When Democrats Miraculously Found 120,000 Votes For Joe Biden"
"Pollster: It's Curious How Biden Underperformed Hillary Clinton In Every City...Except These Four: Milwaukee, Detroit, Atlanta and Philadelphia."
"The lawless fantasy to oust all the election lawyers of Donald Trump"
"Can President Trump win? Here’s how!"
"Retiring diplomat says defense officials misled Trump on troop count in Syria"
"White men swung to Biden. Trump made gains with black and Latino voters. Why? | US politics"
"Media's hiding of Hunter Biden scandal robbed Trump of clear win: Poll"
"Did Non-Citizen Voters Hand The Election To Joe Biden?"
"Three Wisconsin Voters Band Together, File Election Lawsuit That Could Give Trump An Easy Win"
"If Media Didn't Think Trump Could Win, It Wouldn't be Targeting his Lawyers"
"Plan B? Trump could receive second term from U.S. House in 'contingent election'"
"Kristi Noem fires back at former president Obama over his characterization of America in his forthcoming memoir"
"Rep. Louie Gohmert, (R-TX): Foreign company had evidence of 'vote switching' -- Server 'seized' by U.S. Army forces after he gave information to President Trump"
"MSNBC’s exodus to work for Joe Biden shows it’s been shilling for him all along"
"CNN Compares The Trump Administration To Genocidal Nazi Germany"
"Milwaukee Elections Head Misplaced Crucial Voting Flash Drive"
"Jon Voight Condemns the 'Lie' of a Biden Win Amid America's 'Battle of Righteousness Versus Satan' -- Who would’ve ever guessed one of the biggest supporters of the Republican Commander-in-Chief would be…Brad Pitt’s father-in-law?"
"Journalist Glenn Greenwald Rips 'The Most Pathological Liar' in Politics and Other Dems for Burying Hunter Biden Fiasco"
"President Trump critics Rosie O’Donnell and Mary Trump joining forces"
"Hillary Clinton Supporter Alan Dershowitz: 'Trump Will Win the Pennsylvania Lawsuit'"
"Mitch McConnell Will Appease Joe Biden? Oh, Please!"
"Democratic congresswoman compliments way Trump 'doesn't talk down to people' unlike some 'woke' Democrats"
"Ann Coulter: What America Wants Is ‘Trumpism without Trump’"
"Biden considering Yellen as possible Treasury secretary: report"
"2020 Election Recap, Discord Chat, and What’s To Come"
"Massive election disinformation campaign connected to Roger Stone"
"Bolton: Republican leaders need to explain to voters that Trump lost"
"Obama says Trump has caused ‘damage’ by refusing to concede defeat and warns: ‘This is not normal’"
"Exactly four years ago, Trump got his first top-secret intelligence briefing 7 days after election win—Biden still hasn't"
"Biden won places that are thriving. Trump won ones that are hurting."
"Trump hasn't attended a coronavirus task force meeting in five months and is taking no role in combatting the surge in the disease"
"Trump admits for first time that Biden won the election"
"Fauci: 'It would be better' if government health officials could start working with incoming Biden-Harris administration"
"Trump admits Biden won, falsely claims election was 'rigged'"
"Obama throws cold water on a Biden cabinet post: 'Michelle would leave me'"
"US election results: Donald Trump admits Biden 'won' for first time"
"\"Trump just conceded\": Reactions follow president's \"he won because\" tweet"
"Obama says it's 'disappointing' more Republicans aren't challenging Trump over election results"
"MAGA rally: One stabbing and at least 20 arrests as Trump supporters descend on DC"
"DC Trump Supporter Bar Gets $1,000 Fine for Maskless Crowds"
"Memo to Trump: \"The biggest fraud in America continues to be you\""
"Bernie Sanders says Trump denying election results 'beyond belief in terms of behavior for an American president'"
"Native voters aren't 'something else' — we helped swing the presidential election"
"Pompeo calls for respecting elections abroad while ignoring Biden victory"
"Jim Acosta says Trump will just be another 'crackpot' on internet after Jan. 20"
"Public Pressure And Lawsuits Kept USPS From Handing Trump The Election. Here’s How."
"Trump's acting DHS secretary was unlawfully appointed and didn't have the authority to suspend DACA, a federal judge ruled"
"Trump Tweets That Biden Won Election, Says Vote Was ‘Rigged’"
"Opposing Bush v. Gore Attorneys Say Biden Clearly Won the Election, 'No Resemblance' to 2000 Dispute"
"Dr. Fauci: Trump hasn’t attended a coronavirus task force meeting in ‘several months’"
"Republican Arkansas governor: 'I expect Joe Biden to be the next president of the United States'"
"Trump counties make up just 29 percent of U.S. economic output, 2020 election study shows"
"Biden promised a 'railroad revolution' that could see faster trains and a return to Amtrak's nostalgic past — here's what Americans might see"
"Trump Tweets Out a Casual Concession After Long Insisting He Won"
"Cuomo says Trump is 'incompetent' and 'irrelevant' after vaccine threat"
"Health department shuts down pro-Trump rally in Milwaukee"
"John Bolton says GOP leaders need to tell voters that Trump lost and dismiss his 'baseless' election fraud claims"
"Trump tweets \"mail-in elections are a sick joke,\" as conservative groups encourage mail-in voting in Georgia Senate runoffs"
"'It's critical' for Republican leaders to explain to voters Trump lost the election: John Bolton"
"What Does Trump Get Out of Contesting Biden’s Win? The election was not close, and the President’s claims of voter fraud are merely a distraction from his many recent failures."
"Trump Admits Biden Won Election but Quickly Takes it Back"
"Trump Is Not Doing Well With His Election Lawsuits. Here’s a Rundown."
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"Trump ‘has told aides he’ll announce 2024 candidacy as soon as Biden certified winner’"
"Biden task force member: 'We are entering this period that I call COVID hell'"
"Giuliani’s wild Four Seasons rant reportedly scared top attorneys from election fight"
"Feinstein Calls on GOP to Stop Seating Trump Judges in Lame Duck"
"No Self-Respecting Lawyer Should Touch Trump’s Election-Fraud Claims"
"The Electoral College is not going to give Trump a second term"
"Mike Pompeo Loves To Preach About Peaceful Transitions Of Power — When It’s Happening In Other Countries"
"Ohio GOP governor says Trump should begin transition process amid legal battles"
"Trump begging emails raise questions about 'stolen election' slush fund"
"The Best Thing About a Trump Loss Is Stephen Miller Leaving the White House: Just about everyone—conservatives, progressives, libertarians—should be glad to say goodbye to this cruel approach to immigration policy."
"Jeh Johnson: Trump administration's refusal to aid transition a 'disservice to our national security'"
"Biden Likely to Stump in Georgia for Senate Runoffs, Aide Says"
"Kayleigh McEnany Breaks White House Whopper Record With MAGA Crowd Tally"
"Biden chief of staff: All Americans, state and local governments 'need to step up right now' on pandemic"
"Donald Trump Wants You to Know That He Definitely Did Not Just Concede the Election"
"Profiles in cowardice: Trump's Senate enablers"
"Trump in tweet says Biden 'won' but reiterates false claim election was rigged"
"Harvard law professor: Trump's challenges to election results 'dangerous,' and 'going to fail'"
"Trump learns an old Hollywood truth: It sucks to get cancelled"
"Pennsylvania Won’t Need a Recount to Certify Biden Victory, State Says"
"Laugh? We nearly all died – why my US failed state Twitter thread went viral | The final throes of the Trump presidency exposed America as the bad joke – and danger to the world – it has certainly become"
"'Joe's a blue-collar guy': After years of declining power, union leaders look to Biden"
"Native American Voters Were Crucial To Joe Biden’s Victory | “The overwhelming turnout in tribal communities in the state of Arizona was key,” said Navajo Nation president Jonathan Nez"
"As Trump ignores deepening coronavirus crisis, Biden calls for urgent response"
"Trump encourages D.C. police to \"not hold back\" as violence erupts after \"Million MAGA March\""
"After Trump, foreign allies wonder if they can trust America, say former officials"
"As D.C. Clashes Erupt, Trump Sics Police On 'Antifa Scum' In Stunningly Vicious Tweet"
"Incoming Biden chief of staff warns transition delay puts vaccine distribution at risk"
"US election: Trump appears to admit Biden victory in tweet"
"Trump also refuses to admit he lost the fight against the coronavirus"
"Susan Rice: Trump administration not helping Biden transition poses national security threat"
"Trump edges closer to conceding the election"
"'Victory': Federal Judge Invalidates Latest Trump Effort to Kill DACA"
"Twitter might not ban Trump. But we should still ignore him."
"GOP Governors Suggest That Trump Stop Delaying Biden’s Formal Transition Process"
"Ivanka and Kushner pulled children from school amid complaints family didn’t follow Covid rules"
"Michigan counties wrapping up canvases this week. That’s bad news for Trump."
"Kellyanne Conway and Donald Trump said they won by a 'landslide' with 306 Electoral College votes in 2016. Now that Biden has 306, they're crying foul."
"Obama says it's 'disappointing' that more Republicans aren't standing up to Trump over election results"
"More than 8 in 10 Trump voters think Biden’s win is not legitimate: Trump’s efforts to undermine the system are influencing his base"
"Trump Supporters Mocked For ‘Million MAGA March’"
"Incoming chief of staff: “Trump’s Twitter feed doesn’t make Joe Biden president or not president”"
"President-elect Joe Biden knows the pain of grief — and that makes him the leader America needs right now"
"Trump Accidentally Acknowledged Biden Won The Election — Then Tried To Take It Back"
"Lawyers on Both Sides of Bush v. Gore Agree: Joe Biden Clearly Won the 2020 Election. “The sooner that Trump and his supporters accept the election result, the better it will be for the nation.”"
"Joe Biden Has Won Georgia. He’s The First Democrat To Win The State In Decades."
"Fifteen Asia-Pacific economies formed the world's largest free trade bloc on Sunday, a China-backed deal that excludes the United States; The countries abandoned a rival Asia-Pacific grouping formed under Obama which Trump exited in 2017"
"Trump Is Going Out Like He Came In: With His Press Secretary Lying About Crowd Size"
"Donald Trump says Joe Biden 'won' election; but also says he won't concede"
"\"Were not going to stop\": Lawmakers press ahead with Trump-era investigations"
"Republican leaders in Arizona, Michigan, Pennsylvania and Wisconsin throw cold water on ploy to flip electors to Trump"
"Trump Destroyed Any Hope Of Israeli-Palestinian Peace — And Biden Can't Rebuild It"
"Trump’s refusal to concede creates tricky messaging issue for Ga. Republicans"
"Trump is putting this country through something unprecedented. Here are three scenarios."
"There’s a lot Biden can do for rural America. Red-state leaders should accept his help."
"John Bolton Urges Republicans To Publicly Reject Trump's 'Baseless' Voter Fraud Claims"
"Trump indirectly admits he lost the presidential election by tweeting Biden 'won because the election was rigged'"
"Fake posts promoting 'free pancakes' at Trump Hotel before DC rally spread on social media"
"First openly gay Afro-Latino congressman Ritchie Torres says the ‘old boys’ club’ style of politics has ‘collapsed’ with 2020 election"
"'Frankly embarrassing': Tapper breaks down Trump's lawsuits alleging voter fraud"
"Obama said he won't serve in Biden's cabinet because Michelle would 'leave' him"
"Sharpton: Trump's loss is 'a result of the American people assessing for themselves his performance in the last four years'"
"Cuomo threatens to sue Trump administration if vaccine plan burdens Black, Brown communities"
"Trump tweets that Biden 'won' – but repeats baseless vote fraud claim"
"Trump acknowledges Biden 'won' the U.S. election, but says it was 'rigged'"
"Fauci says Trump administration should start working with President-elect Biden on coronavirus response"
"Lawyers decided to quit Trump case after chaotic Four Seasons Landscaping press conference"
"Fox News’ Leland Vittert Goes at It With Trump Spox Over Voter Fraud Claims"
"Mike Pence suggests the Trump administration will be in place for four more years despite Biden victory: 'That's the plan'"
"Trump says Biden 'won' while promoting election conspiracy theories"
"Multiple people arrested at pro-Trump protests, Million MAGA March in DC"
"Obama addresses Trump transition in first interview since election"
"Trump Administration Ending Like it Began: Lying About Crowd Size"
"Trump's post-presidency is going to be boisterous and belligerent. And that will cause headaches for Biden, the media, and the US economy."
"Fareed Zakaria: The conspiracy theory of the 2020 US election is here to stay"
"‘Dreamer’ immigration protections will be reinstated by Joe Biden on ‘day one:’ Incoming chief of staff Ron Klain"
"Cuomo says NY will sue if Trump's vaccine plan lacks equal access for communities of color"
"Trump’s latest defense shakeup ‘destructive,’ Bolton says - Former national security adviser John Bolton said the recent firings of top officials at the Pentagon, NSA and DHS will be damaging to the incoming administration."
"Joe Biden's popular vote share is third largest by presidential challenger in election history"
"Trump rally shut down in Milwaukee, man attacked"
"'You Lost': Chris Evans Lambasts Trump and Four Seasons Landscaping Gaffe"
"Moore: Trump is 'a little grouchy' over election results"
"Judges rule against 6 Trump campaign lawsuits to invalidate nearly 9,000 Pennsylvania ballots"
"'I concede nothing': Trump backtracks after appearing to acknowledge Biden win"
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"The White House press secretary said more than 1 million attended a demonstration in support of Trump, but it was more likely thousands"
"Trump Puts Democracy To The Test After Losing Presidency To Biden : For the first time, a sitting U.S. president tries to convince voters to not believe results clearly showing he lost."
"Trump seems to acknowledge Biden win, but he won’t concede"
"President Trump admits Joe Biden won the 2020 election for the 1st time, then reverses tacit concession"
"Biden solidifies victory, Trump hints at leaving"
"Trump for the first time says Biden won election and falsely blames conspiracy theories for his loss"
"Chris Hayes explains how the GOP is already setting ‘booby traps’ for Biden"
"Secret intelligence exists that ‘would cast Trump in very negative light’, warns ex-FBI chief"
"Trump appears to acknowledge Joe Biden won in a tweet, but says again he won’t concede"
"Trump and His Loyalists Are Lying about the Size of the Million MAGA March"
"Jared and Ivanka are poised to return to a Manhattan social scene that no longer welcomes them"
"Here's How Scientists Want Biden to Take on Climate Change"
"Barack Obama Jokes Wife Michelle 'Would Leave Me' If He Joined President-Elect Joe Biden's Cabinet"
"National lockdown to contain Covid surge is ‘measure of last resort,’ top Biden health advisor says"
"Republicans increasingly urge Trump to begin formal transition"
"Trump seems to suggest Biden 'won' but later says he's not conceding"
"John King: If Trump thinks 2016 was a landslide, 2020 is as well"
"Deb Haaland says 'of course' she would serve as Interior secretary under Biden; she would be the first Native American in the Cabinet, and overseeing public lands."
"Trump’s student loan cliff threatens chaos for Biden"
"What the bunker mentality really means"
"Biden Stocks Transition Teams with Climate Experts"
"Sigh of relief as international organisations await Biden"
"Trump is going out the way he came in: A loser, a liar and a cheat"
"Dr. Fauci discusses Trump impeding transition amid pandemic"
"Sad! Trump Fights The Tyranny Of Reality, Loses Again"
"White House task force physician 'not concerned' that Trump doesn't attend COVID-19 meetings"
"Out of Sight and Going Out of His Mind. Hold Up in the White House, Trump Rages; Finally, He Feels Shame"
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"250,000 Dead Americans by Thanksgiving as Trump Keeps Tweeting | The entire country is being crushed by the virus, Trump doesn’t care, Biden does, but he can’t do anything about it."
"Trump Publicly Admits Biden Win For First Time, Continues To Allege 'Rigged' Election"
"Trump acknowledges Biden's win in latest tweet"
"Biden Asked Republicans to Give Him a Chance. They’re Not Interested."
"Georgia Democrats Ask Judge to Shut Down Trump Supporters’ Lawsuit: This ‘Gambit’ Is Backed by No ‘Concrete, Credible Evidence’"
"A Judge Found Republicans' Claims Of Vote Fraud In Detroit \"Incorrect And Not Credible\""
"Mike Pompeo’s awkward seven-country tour could do more harm than good | All the countries on the itinerary are allies of the US and, at the end of the day, they will come to an accommodation with the new administration"
"Barack Obama rules out role in Biden cabinet – 'Michelle would leave me'"
"Biden Gets His Most Important Pick Right — Imposing order on the modern White House requires a competent chief of staff. Ron Klain is a good choice."
"Trump says Biden ‘won' but refuses to concede"
"1 stabbing, 20 arrests in violent clashes after Trump supporters’ Washington election protest"
"Trump fans flock to conservative-friendly social media apps as they reject US election results"
"We opposed each other in Bush v. Gore. Now we agree: Biden won."
"Biden is expected to select a woman to lead the Pentagon"
"Trump’s refusal to concede election defeat will ‘cost us dearly’ in American lives, says Susan Rice"
"Georgia Trump Supporters, Some Armed, Protest Election Amid State's Voting Recount"
"Obama White House Veterans Urge Biden To Embrace Executive Action"
"Trump's refusal to concede is just the latest gambit to please Republican donors"
"Georgia's Blue Shift Is A Lesson For Progressive Organizers Across The South"
"Trump-appointed election official says president’s claims are ‘baffling’ and court evidence ‘laughable’"
"Trump Campaign Shuts Down Fraud Hotline After it Gets Flooded With Prank Calls"
"Count on Biden to Restore the National Monuments Trump Trashed"
"Trump Says Biden Won, But Only Because the 'Election Was Rigged'"
"GOP leaders in 4 states quash dubious Trump bid on electors"
"Republicans are playing with fire. And we all risk getting burned | The party is challenging the outcome of the election without any proof of fraud. Their degradation of democracy will reverberate for years to come"
"Trump puts personal lawyer Rudy Giuliani in charge of all election lawsuits"
"'Donald Trump v. USA': legal experts marvel as election lawsuits border on bizarre"
"Trump greets hundreds of supporters descending on D.C. to falsely claim he won election"
"Trump election lawsuit in Arizona's Maricopa County dismissed, outcome wouldn't have affected races"
"Biden has a better shot at riding the economy up now than Obama did"
"Trump the Genius, Trump the Incompetent, Trump the Bogeyman"
"Trump will cast a long shadow over Republican party despite defeat"
"White House Press Secretary Kayleigh McEnany Wildly Exaggerates Trump March Crowd Size"
"The promise of LGBTQ equality under the Biden administration"
"The Latest: Trump demands Georgia officials stop the recount amid claims of cheating"
"Donald Trump lost the 2020 election, but misinformation will continue to win"
"Why Mayor Pete is the right choice to be Joe Biden’s UN ambassador"
"Biden Wants Census To See 'Invisible' Groups: LGBTQ, Middle Eastern, North African"
"There Is No Trumpism Without Trump"
"Biden campaign says Georgia's U.S. presidential recount reveals no irregularities"
"Trump lost at the ballot box. His legal challenges aren’t going any better."
"Million Maga March: Trump fans rage against dying of the light"
"Trump and his supporters seek comfort in conspiracy as election hopes dim"
"Obama says Biden's margin of victory over Trump is bigger than Trump's margin over Clinton in 2016"
"Trump hangs over Obama's memoir like an onrushing train"
"Trump and his White House minimize pandemic surge as he focuses on denying election loss"
"Republicans try packing the Fed before Trump exits"
"'This ain’t over!' Vice President Mike Pence exhorts Trump campaign to continue challenging election result"
"US election results: How Native American voters helped flip Arizona for Biden"
"Trump Apparently Thinks Rudy Giuliani Can Save His Flailing Court Battles"
"President Trump briefly drove by the “Million MAGA March” on his way to the golf course"
"Firing a \"Vindictive, Illegal Parting Shot,\" Trump's Interior Proposes Sabotage of Conservation Program | \"The administration's proposal is unneeded, unwanted, and unacceptable.\""
"Trump’s Refusal to Start the Transition Process Is Crippling America’s Coronavirus Response"
"Biden demands urgent federal COVID action as Trump feuds with Cuomo"
"Fox Host's Simple Question Derails Interview With Trump Aide"
"GOP Leaders In 4 States Quash Dubious Trump Scheme On Electors | Lawmakers in Arizona, Michigan, Pennsylvania, and Wisconsin have all said they won’t intervene in selecting electors"
"Leon Panetta: Trump 'plunging Pentagon into uncertainty'"
"Biden likely to break barriers and pick woman to lead Pentagon"
"Trump Implies Biden ‘Won’ in Tweet on ‘Rigged Election’"
"Republican leaders in 4 key U.S. states quash Trump bid on switching electors"
"Understanding the Trump voters: Here's why nobody is doing it right"
"Trump sees electoral turnaround in 'probably two weeks'"
"The $15 Minimum Wage Won in Florida, But Biden Didn't. Here's Why — Activists say the key was actually talking about working-class issues."
"Trump's refusal to concede is just the latest gambit to please Republican donors | Millions who should be ranged against the American oligarchy are distracted and divided – just as their leaders want"
"Thousands Rally Behind Trump, Insisting He Won Race He Lost"
"North Dakota anxiously awaits Biden's climate change agenda"
"Giuliani wrecks Trump campaign's well-laid legal plans"
"Violence erupts as thousands rally behind Trump in Washington, DC"
"Violence breaks out at Trump rally between supporters, counter-protesters"
"Poland's President Duda congratulates Biden on 'successful campaign'"
"The purge at the Pentagon - The potential for sudden troop withdrawals should spur Congress to curtail Trump’s powers in his final weeks as president."
"The biggest errors the Trump administration made in response to COVID"
"As Trump rages, Georgia recount continues"
"Trump’s Post-Election Power Grab Isn’t Just Selfish, It’s Dangerous to Democracy"
"How the Trump administration's 'midnight rule-making' could leave a big mark on government"
"Biden Likely To Take Historic Step In Choosing Woman To Lead Pentagon"
"Beyond irresponsible: Republicans must put Americans and reality ahead of fealty to Trump | Republicans are embarrassing America. It's past time to admit Trump lost, congratulate Biden, stop spouting misinformation and move on to a transition."
"Million MAGA March: Supporters explain why they're still backing Trump Close | Thousands of pro-Trump protesters rallied in Washington DC for the Million MAGA March, turning out to support President Trump and back his unsubstantiated claims of voter fraud in the US election."
"US sees record 184,000 new daily Covid cases as Trump politicises vaccine effort"
"Trump’s far-fetched legal campaign to question the election seems to be falling apart"
"White House Aide Paula White Calls on God and His Followers to Fight to Keep Trump in Office"
"Trump says for first time that Biden 'won,' blaming 'rigged' election"
"Vaccine czar calls on Trump to allow contact with Biden - Operation Warp Speed head warns thousands of lives at stake if project interrupted."
"Trump emerges from White House to take credit for vaccine and leaves open door for second term"
"'Too late': As people dance over Trump loss, rapper Fat Joe sings him goodbye on TV"
"The tragedy of Trump's refusal to concede"
"Two \"dead voters\" cited by Trump as proof of Georgia ballot fraud are alive"
"Biden is considering Janet Yellen for Treasury Secretary, potentially making her the first woman to hold the role: report"
"Violence erupts between counter-protestors, Trump supports following DC rally"
"The Trump Corner is officially closed: What other changes can Palm Beach County expect when Trump's a regular citizen again?"
"Trump had a very bad Friday in court with his election cases. They're headed for more action next week"
"Million Maga March: Trump fans rage against dying of the light"
"Lankford slammed by Trump loyalists over intelligence briefings"
"The “Real Time” host exposed just how empty the soon-to-be-former president’s allegations of widespread voter fraud really are."
"Thousands rally behind Trump, believing he won race he lost"
"Trump’s Refusal to Start the Transition Process Is Crippling America’s Coronavirus Response"
"Biden campaign says Georgia's U.S. presidential recount reveals no irregularities"
"'Donald Trump v. USA': legal experts marvel as election lawsuits border on bizarre"
"Media takes heat for ignoring violent attacks on Trump supporters at MAGA rally"
"White House Aide Paula White Calls on God and His Followers to Fight to Keep Trump in Office"
"Republicans increasingly urge Trump to begin formal transition"
"Cuomo says NY will sue if Trump's vaccine plan lacks equal access for communities of color"
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"Incoming chief of staff: “Trump’s Twitter feed doesn’t make Joe Biden president or not president”"
"Barack Obama Jokes Wife Michelle 'Would Leave Me' If He Joined President-Elect Joe Biden's Cabinet"
"'I concede nothing': Trump backtracks after appearing to acknowledge Biden win"
"GOP Governors Suggest That Trump Stop Delaying Biden’s Formal Transition Process"
"Biden solidifies victory, Trump hints at leaving"
"Trump Has a Pathway to Victory. You're About to Learn a Lesson in the 'Trump Rules'"
"Fauci says Trump administration should start working with President-elect Biden on coronavirus response"
"National lockdown to contain Covid surge is ‘measure of last resort,’ top Biden health advisor says"
"1 stabbing, 20 arrests in violent clashes after Trump supporters’ Washington election protest"
"‘Dreamer’ immigration protections will be reinstated by Joe Biden on ‘day one:’ Incoming chief of staff Ron Klain"
"Obama said he won't serve in Biden's cabinet because Michelle would 'leave' him"
"Obama says it's 'disappointing' that more Republicans aren't standing up to Trump over election results"
"Barack Obama rules out role in Biden cabinet – 'Michelle would leave me'"
"Out of Sight and Going Out of His Mind. Hold Up in the White House, Trump Rages; Finally, He Feels Shame"
"Cuomo threatens to sue Trump administration if vaccine plan burdens Black, Brown communities"
"John Bolton Urges Republicans To Publicly Reject Trump's 'Baseless' Voter Fraud Claims"
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"President Trump admits Joe Biden won the 2020 election for the 1st time, then reverses tacit concession"
"Trump tweets \"mail-in elections are a sick joke,\" as conservative groups encourage mail-in voting in Georgia Senate runoffs"
"Georgia Trump Supporters, Some Armed, Protest Election Amid State's Voting Recount"
"Who are the Latinos who could be in Biden's Cabinet?"
"Biden Likely to Stump in Georgia for Senate Runoffs, Aide Says"
"Trump Accidentally Acknowledged Biden Won The Election — Then Tried To Take It Back"
"Trump learns an old Hollywood truth: It sucks to get cancelled"
"Trump appears to acknowledge Joe Biden won in a tweet, but says again he won’t concede"
"Biden promised a 'railroad revolution' that could see faster trains and a return to Amtrak's nostalgic past — here's what Americans might see"
"First openly gay Afro-Latino congressman Ritchie Torres says the ‘old boys’ club’ style of politics has ‘collapsed’ with 2020 election"
"Trump hangs over Obama's memoir like an onrushing train"
"Trump’s latest defense shakeup ‘destructive,’ Bolton says - Former national security adviser John Bolton said the recent firings of top officials at the Pentagon, NSA and DHS will be damaging to the incoming administration."
"Profiles in cowardice: Trump's Senate enablers"
"DC Trump Supporter Bar Gets $1,000 Fine for Maskless Crowds"
"Fifteen Asia-Pacific economies formed the world's largest free trade bloc on Sunday, a China-backed deal that excludes the United States; The countries abandoned a rival Asia-Pacific grouping formed under Obama which Trump exited in 2017"
"Fareed Zakaria: The conspiracy theory of the 2020 US election is here to stay"
"'It's critical' for Republican leaders to explain to voters Trump lost the election: John Bolton"
"Ohio GOP governor says Trump should begin transition process amid legal battles"
"What the bunker mentality really means"
"Obama throws cold water on a Biden cabinet post: 'Michelle would leave me'"
"'Frankly embarrassing': Tapper breaks down Trump's lawsuits alleging voter fraud"
"Fox News’ Leland Vittert Goes at It With Trump Spox Over Voter Fraud Claims"
"Republican Arkansas governor: 'I expect Joe Biden to be the next president of the United States'"
"Sanders to Trump: ‘Man-Up’ and Say You Lost the Election"
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"Bernie Sanders says Trump denying election results 'beyond belief in terms of behavior for an American president'"
"Donald Trump says Joe Biden 'won' election; but also says he won't concede"
"Donald Trump Wants You to Know That He Definitely Did Not Just Concede the Election"
"Laugh? We nearly all died – why my US failed state Twitter thread went viral | The final throes of the Trump presidency exposed America as the bad joke – and danger to the world – it has certainly become"
"Obama says Trump has caused ‘damage’ by refusing to concede defeat and warns: ‘This is not normal’"
"John Bolton says GOP leaders need to tell voters that Trump lost and dismiss his 'baseless' election fraud claims"
"White House task force physician 'not concerned' that Trump doesn't attend COVID-19 meetings"
"Obama says it's 'disappointing' more Republicans aren't challenging Trump over election results"
"Michigan counties wrapping up canvases this week. That’s bad news for Trump."
"Here's How Scientists Want Biden to Take on Climate Change"
"Obama addresses Trump transition in first interview since election"
"Incoming Biden chief of staff warns transition delay puts vaccine distribution at risk"
"Biden chief of staff: All Americans, state and local governments 'need to step up right now' on pandemic"
"Dr. Fauci: Trump hasn’t attended a coronavirus task force meeting in ‘several months’"
"Pompeo calls for respecting elections abroad while ignoring Biden victory"
"Trump Admits Biden Won Election but Quickly Takes it Back"
"Trump seems to acknowledge Biden win, but he won’t concede"
"Million MAGA March: Supporters explain why they're still backing Trump Close | Thousands of pro-Trump protesters rallied in Washington DC for the Million MAGA March, turning out to support President Trump and back his unsubstantiated claims of voter fraud in the US election."
"Harvard law professor: Trump's challenges to election results 'dangerous,' and 'going to fail'"
"Trump acknowledges Biden's win in latest tweet"
"Trump for the first time says Biden won election and falsely blames conspiracy theories for his loss"
"Jeh Johnson: Trump administration's refusal to aid transition a 'disservice to our national security'"
"North Dakota anxiously awaits Biden's climate change agenda"
"There’s a lot Biden can do for rural America. Red-state leaders should accept his help."
"Dr. Fauci discusses Trump impeding transition amid pandemic"
"Fauci: 'It would be better' if government health officials could start working with incoming Biden-Harris administration"
"What Does Trump Get Out of Contesting Biden’s Win? The election was not close, and the President’s claims of voter fraud are merely a distraction from his many recent failures."
"President-elect Joe Biden knows the pain of grief — and that makes him the leader America needs right now"
"Trump Implies Biden ‘Won’ in Tweet on ‘Rigged Election’"
"Trump fans flock to conservative-friendly social media apps as they reject US election results"
"'This ain’t over!' Vice President Mike Pence exhorts Trump campaign to continue challenging election result"
"Trump also refuses to admit he lost the fight against the coronavirus"
"Trump says Biden ‘won' but refuses to concede"
"Trump seems to suggest Biden 'won' but later says he's not conceding"
"Bolton: Republican leaders need to explain to voters that Trump lost"
"Native voters aren't 'something else' — we helped swing the presidential election"
"Mike Pompeo’s awkward seven-country tour could do more harm than good | All the countries on the itinerary are allies of the US and, at the end of the day, they will come to an accommodation with the new administration"
"'Victory': Federal Judge Invalidates Latest Trump Effort to Kill DACA"
"Trump acknowledges Biden 'won' the U.S. election, but says it was 'rigged'"
"Public Pressure And Lawsuits Kept USPS From Handing Trump The Election. Here’s How."
"Biden has a better shot at riding the economy up now than Obama did"
"Trump tweets that Biden 'won' – but repeats baseless vote fraud claim"
"Opposing Bush v. Gore Attorneys Say Biden Clearly Won the Election, 'No Resemblance' to 2000 Dispute"
"Trump is putting this country through something unprecedented. Here are three scenarios."
"Understanding the Trump voters: Here's why nobody is doing it right"
"Trump indirectly admits he lost the presidential election by tweeting Biden 'won because the election was rigged'"
"Trump Publicly Admits Biden Win For First Time, Continues To Allege 'Rigged' Election"
"\"Trump just conceded\": Reactions follow president's \"he won because\" tweet"
"US election: Trump appears to admit Biden victory in tweet"
"Trump Says Biden Won, But Only Because the 'Election Was Rigged'"
"Trump says for first time that Biden 'won,' blaming 'rigged' election"
"Massive election disinformation campaign connected to Roger Stone"
"Trump the Genius, Trump the Incompetent, Trump the Bogeyman"
"Trump’s refusal to concede creates tricky messaging issue for Ga. Republicans"
"Trump edges closer to conceding the election"
"Memo to Trump: \"The biggest fraud in America continues to be you\""
"After Trump, foreign allies wonder if they can trust America, say former officials"
"Trump admits Biden won, falsely claims election was 'rigged'"
"Majority Rapport — White voters turned out strongly for Trump"
"Trump Tweets Out a Casual Concession After Long Insisting He Won"
"Trump in tweet says Biden 'won' but reiterates false claim election was rigged"
"Trump Tweets That Biden Won Election, Says Vote Was ‘Rigged’"
"Trump says Biden 'won' while promoting election conspiracy theories"
"How Democrats tried to handcuff Trump from the start"
"There Is No Trumpism Without Trump"
"Trump admits for first time that Biden won the election"
"US election results: Donald Trump admits Biden 'won' for first time"
"Trump's post-presidency is going to be boisterous and belligerent. And that will cause headaches for Biden, the media, and the US economy."
"Biden won places that are thriving. Trump won ones that are hurting."
"Trump rally shut down in Milwaukee, man attacked"
"\"Were not going to stop\": Lawmakers press ahead with Trump-era investigations"
"Trump’s student loan cliff threatens chaos for Biden"
"Exactly four years ago, Trump got his first top-secret intelligence briefing 7 days after election win—Biden still hasn't"
"The promise of LGBTQ equality under the Biden administration"
"Moore: Trump is 'a little grouchy' over election results"
"Trump hasn't attended a coronavirus task force meeting in five months and is taking no role in combatting the surge in the disease"
"Trump Destroyed Any Hope Of Israeli-Palestinian Peace — And Biden Can't Rebuild It"
"Kayleigh McEnany Breaks White House Whopper Record With MAGA Crowd Tally"
"MAGA rally: One stabbing and at least 20 arrests as Trump supporters descend on DC"
"'Joe's a blue-collar guy': After years of declining power, union leaders look to Biden"
"Trump emerges from White House to take credit for vaccine and leaves open door for second term"
"Jim Acosta says Trump will just be another 'crackpot' on internet after Jan. 20"
"Trump's acting DHS secretary was unlawfully appointed and didn't have the authority to suspend DACA, a federal judge ruled"
"Biden task force member: 'We are entering this period that I call COVID hell'"
"Trump Is Not Doing Well With His Election Lawsuits. Here’s a Rundown."
"Trump and his supporters seek comfort in conspiracy as election hopes dim"
"Trump will cast a long shadow over Republican party despite defeat"
"As D.C. Clashes Erupt, Trump Sics Police On 'Antifa Scum' In Stunningly Vicious Tweet"
"How the Trump administration's 'midnight rule-making' could leave a big mark on government"
"Leon Panetta: Trump 'plunging Pentagon into uncertainty'"
"Trump encourages D.C. police to \"not hold back\" as violence erupts after \"Million MAGA March\""
"When Biden said to stop 'harsh rhetoric.' he meant us liberals too"
"Trump's refusal to concede is just the latest gambit to please Republican donors | Millions who should be ranged against the American oligarchy are distracted and divided – just as their leaders want"
"Gov. Kristi Noem won't comply with Biden face mask mandate: He 'doesn't have the authority'"
"Trump begging emails raise questions about 'stolen election' slush fund"
"Violence erupts as thousands rally behind Trump in Washington, DC"
"Violence erupts between counter-protestors, Trump supporters following DC rally"
"Cuomo says Trump is 'incompetent' and 'irrelevant' after vaccine threat"
"President Trump's sports missteps should not be overlooked when analyzing election outcome"
"The Trump Corner is officially closed: What other changes can Palm Beach County expect when Trump's a regular citizen again?"
"The biggest errors the Trump administration made in response to COVID"
"Charting the Long-Term Impact of Trump’s Judicial Appointments"
"Clash during Trump rally in Washington DC"
"Biden likely to break barriers and pick woman to lead Pentagon"
"Million Maga March: Trump fans rage against dying of the light"
"Tensions flare between Trump supporters and opponents at DC protests"
"Trump's refusal to concede is just the latest gambit to please Republican donors"
"The Biden-Harris immigration fight ahead: ‘It is their responsibility to deliver for immigrant and Latino communities across the country’"
"Biden is expected to select a woman to lead the Pentagon"
"The ‘stolen election’ myth is powerful enough to keep Trump in power"
"As Trump ignores deepening coronavirus crisis, Biden calls for urgent response"
"Sigh of relief as international organisations await Biden"
"Trump: Coronavirus Vaccine Widely Available by April"
"Violence erupts between counter-protestors, Trump supports following DC rally"
"Ivanka and Kushner pulled children from school amid complaints family didn’t follow Covid rules"
"Violence breaks out at Trump rally between supporters, counter-protesters"
"Trump counties make up just 29 percent of U.S. economic output, 2020 election study shows"
"Mike Pompeo Loves To Preach About Peaceful Transitions Of Power — When It’s Happening In Other Countries"
"Thousands rally behind Trump, believing he won race he lost"
"As Trump rages, Georgia recount continues"
"Twitter might not ban Trump. But we should still ignore him."
"Lankford slammed by Trump loyalists over intelligence briefings"
"No Self-Respecting Lawyer Should Touch Trump’s Election-Fraud Claims"
"Sharpton: Trump's loss is 'a result of the American people assessing for themselves his performance in the last four years'"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Trump lost the 2020 election to Biden. But could he win in 2024?"
"Darrell Issa: Trump on par with Lincoln, Reagan with value added to the Republican Party"
"Trump sees electoral turnaround in 'probably two weeks'"
"Biden considering King for director of national intelligence: report"
"Why Mayor Pete is the right choice to be Joe Biden’s UN ambassador"
"Taiwan hopes for close U.S. cooperation in call with Biden adviser"
"Trump’s Reichstag Fire"
"Health department shuts down pro-Trump rally in Milwaukee"
"Thousands Rally Behind Trump, Insisting He Won Race He Lost"
"Former Congresswoman Michele Bachmann calls on God to use His ‘iron rod’ against Joe Biden"
"Atlanta attorney backing Trump sues to stop Georgia election results"
"Biden Gets His Most Important Pick Right — Imposing order on the modern White House requires a competent chief of staff. Ron Klain is a good choice."
"Giuliani’s wild Four Seasons rant reportedly scared top attorneys from election fight"
"'Too late': As people dance over Trump loss, rapper Fat Joe sings him goodbye on TV"
"Trump ‘has told aides he’ll announce 2024 candidacy as soon as Biden certified winner’"
"Trump and his White House minimize pandemic surge as he focuses on denying election loss"
"Feinstein Calls on GOP to Stop Seating Trump Judges in Lame Duck"
"Republican leaders in 4 key U.S. states quash Trump bid on switching electors"
"Trump’s refusal to concede election defeat will ‘cost us dearly’ in American lives, says Susan Rice"
"Million Maga March: Trump fans rage against dying of the light"
"Trump lost at the ballot box. His legal challenges aren’t going any better."
"Sad! Trump Fights The Tyranny Of Reality, Loses Again"
"The White House press secretary said more than 1 million attended a demonstration in support of Trump, but it was more likely thousands"
"The Trump and the FED | The president could be heading towards a fitting end to a uniquely undistinguished tenure."
"Georgia recount continues, officials respond to Trump’s claims"
"Dear Leader Drive-By: Trump Motorcade Parades Past Million Meh-AGA March"
"The tragedy of Trump's refusal to concede"
"The Electoral College is not going to give Trump a second term"
"Republican leaders in Arizona, Michigan, Pennsylvania and Wisconsin throw cold water on ploy to flip electors to Trump"
"GOP leaders in 4 states quash dubious Trump bid on electors"
"Thousands of Trump supporters gather in Washington, falsely claim election fraud"
"Multiple people arrested at pro-Trump protests, Million MAGA March in DC"
"The Best Thing About a Trump Loss Is Stephen Miller Leaving the White House: Just about everyone—conservatives, progressives, libertarians—should be glad to say goodbye to this cruel approach to immigration policy."
"John Kelly statement on Trump not helping with the transition to a Biden administration"
"Trump and His Loyalists Are Lying about the Size of the Million MAGA March"
"The Latest: Trump demands Georgia officials stop the recount amid claims of cheating"
"Trump Campaign Shuts Down Fraud Hotline After it Gets Flooded With Prank Calls"
"Driving Mr Donald – White House excursion reveals a presidency pushing up daisies: From the motorcade, leaving Washington, it was clear how Trump thrives on a noisy minority’s support – and why he lost"
"Native American Voters Were Crucial To Joe Biden’s Victory | “The overwhelming turnout in tribal communities in the state of Arizona was key,” said Navajo Nation president Jonathan Nez"
"GOP Leaders In 4 States Quash Dubious Trump Scheme On Electors | Lawmakers in Arizona, Michigan, Pennsylvania, and Wisconsin have all said they won’t intervene in selecting electors"
"Fox Host's Simple Question Derails Interview With Trump Aide"
"Continuing to Reject Election Results, Trump Rejoices With Drive-By for MAGA Rally"
"Trump's Legal Efforts Falter in Bid to Undo Biden's Presumptive Victory"
"Texas Lt. Governor on Fox News explains scenario where Trump remains president"
"Biden made his first administration hire this week, with others on the horizon. Here are some top contenders."
"Kellyanne Conway and Donald Trump said they won by a 'landslide' with 306 Electoral College votes in 2016. Now that Biden has 306, they're crying foul."
"Trump Supporters Mocked For ‘Million MAGA March’"
"Trump's not giving up and neither are his supporters"
"Trump is stonewalling Biden's transition. Here's why it matters."
"Trump rails against Georgia recount process"
"Joe Biden administration: president-elect assembles a diverse cabinet"
"Biden Likely To Take Historic Step In Choosing Woman To Lead Pentagon"
"Lawyers on Both Sides of Bush v. Gore Agree: Joe Biden Clearly Won the 2020 Election. “The sooner that Trump and his supporters accept the election result, the better it will be for the nation.”"
"Trump Administration Ending Like it Began: Lying About Crowd Size"
"President Trump briefly drove by the “Million MAGA March” on his way to the golf course"
"GOP Lawmakers in Battleground States Flat Out Dismiss Wacky Attempt to Flip Electors"
"Pennsylvania Won’t Need a Recount to Certify Biden Victory, State Says"
"President-elect Biden expected to pick woman to lead Pentagon"
"Susan Rice: Trump administration not helping Biden transition poses national security threat"
"Mark Taylor Says Christians Who Voted For Biden Have Cursed Their Families for Generations to Come"
"US election results: How Native American voters helped flip Arizona for Biden"
"Thousands rally behind Trump, believing he won the race he lost"
"Firing a \"Vindictive, Illegal Parting Shot,\" Trump's Interior Proposes Sabotage of Conservation Program | \"The administration's proposal is unneeded, unwanted, and unacceptable.\""
"The outgoing Trump administration just revealed its new citizenship test that's twice as long and uses exclusive terms like 'citizens' instead of 'all people'"
"Trump laying groundwork for full US troop withdrawal from Afghanistan before leaving office"
"Biden Transition Official Believes the First Amendment Has a 'Design Flaw' -- His Remedy Is to Curb Free Speech"
"UFC fighter Jorge Masvidal says he may start attending conservative rallies 'to keep the peace' after seeing left-wing violence"
"China Expert: Beijing Happy With Biden Win. “I think China is very happy with how things turned out, because Beijing worked very hard to get the vice president elected” by malicious and massive attacks on President Donald Trump through a public disinformation campaign."
"BREAKING: New Vaccine Developed In Conjunction With Trump’s ‘Operation Warp Speed’ Is 94.5% Effective, Company Says"
"Rand Paul Vows to Prevent Biden Lockdown -- 'We Can't Go on Like This Forever'"
"Asian kids officially kicked out of \"students of color\" category by a WA school district."
"Obama Compares Trump To Dictator During Interview, Gets Slammed Online For Hypocrisy | The Daily Wire"
"Covid is so bad that Robert Reich wants to forget that pesky Constitution and just install Biden as President right now. No, I'm not kidding. This is a real tweet. Reich served in the Ford, Carter, Clinton and Obama administrations."
"If You Haven’t Quit Watching FOX News Yet… Watch this Clip of Leland Vittert laughing at a Trump Spokeswoman"
"1.7 Million Trump Votes Deleted By Dominion Voting System Nationwide."
"New federal lawsuit seeks to throw out 1.2 million votes in Michigan, flipping the state for Trump"
"Israel Demands CNN Apology over Amanpour Likening Trump’s Tenure to Nazi Germany"
"Where's Biden? The silence from 'Mr. Unity' over violent attacks to Trump supporters is deafening"
"Biden COVID Advisor: Those Older Than 75 Should Get Vaccines Last -- American's should be deeply troubled that a man Biden is looking to for advice on COVID is someone who hopes to die at 75 and has publicly supported rationing care for the elderly."
"Sidney Powell with Maria Bartiromo on software evidence to 'OVERTURN' multiple states (Video)"
"The Real 'Authoritarian' Isn't Trump. It's The Left"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"Joe Biden's Student Loan Debt Forgiveness Plan Will Cancel up to $50,000 per Student"
"President Trump’s Final 2020 Act Should Be Pulling U.S. Out From Endless Wars -- A reprioritization of America’s strategic interests would cement the legacy of the first president in the era of great-power rivalry."
"Pollster: It's Curious How Biden Underperformed Hillary Clinton In Every City...Except These Four."
"“Moderna's coronavirus vaccine is 94.5 per cent effective, according to company data” Trump REALLY wasn’t lying.."
"Forget Finding Fraud, Trump May Seek to Deny Biden 270 Electoral Votes, Put Election in Congress"
"Biden Fills Economic Posts With Experts on Systemic Racism"
"Bill O'Reilly Predicts 'Collapse' Of Cable News Networks Post-Trump"
"Watching the footage of all the violence against Trump supporters in DC got me like..."
"Scoop: Trump plans last-minute China crackdown"
"Emboldened by Biden, the Lockdown Fascists Return for Round 3. The political “Science!” leaders will all keep showing up to press conferences with their masks on so that we simple folk can bathe in the healing power of virtue-signalling."
"Obama Compares Trump to Dictator -- 'There Has Been a Sense' He Would 'Do Anything to Stay in Power'"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"The Dominion software story keeps getting worse: the person in charge of the software’s security, is an Antifa supporter and Trump hater"
"Trump allies raising millions for new conservative TV network: report"
"Outgoing Diplomat Admits Lying to President Trump About American Troop Numbers in Syria"
"Biden’s Tax Returns Prove He’s a Scrooge When It Comes to Donating to Charity"
"NASA boss Jim Bridenstine may resign if Joe Biden takes control of the White House, which would likely delay the 2024 Moon Landing and subsequent Mars colonization mission"
"Trump Campaign Rejects Media Reports of Changed Pennsylvania Case"
"Companies Are Preparing to Cut Jobs and Automate if Biden Gets $15 Minimum Wage Hike, Reporting Shows"
"Obama, with a net worth of $70MM, calls Trump 'Richie Rich'"
"Today Governor Cuomo threatened to sue the Trump administration if it moves ahead with its COVID-19 vaccine-distribution plan, which he called discriminatory — after the president threatened to move New York at the back of the line for getting the shot."
"Trump Allies Considering Raising $200 Million For Fox News Alternative | The Daily Wire"
"Small-Town Trump Rally One Of Many Unreported By Corporate Media -- The corporate media gave little to no coverage of the organic Trump rallies that erupted in cities and towns across America in solidarity with the DC march."
"The U.S. Economy’s Remarkable Recovery Continues As Biden Plans To Crush It"
"Trump Allies Considering Raising $200 Million For Fox News Alternative | The Daily Wire"
"Silicon Valley eager for Biden to reverse Trump visa rules, hire more immigrants"
"Biden Called Out For Silence As Leftists Attack Pro-Trump Demonstrators In Nation’s Capital | The Daily Wire"
"Black Lives Matter And Antifa Assault Trump Supporters After DC March"
"The 2020 election took place under a Trump-declared “National Emergency” that set an Election Day trap for the “unauthorized accessing of election and campaign infrastructure”"
"The inevitability of Trump 2024 - As long as there is an audience, he will go on"
"The COVID Lockdown Rut. Biden’s ‘new’ plan is more of the same insanity: life lived through our smartphones and screens."
"Judge Jeanine: \"Don't you DARE ask us to go quietly into the night!\""
"Twitter Claims Trump Conceded, He Counters: “I concede NOTHING!”"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"First black woman crowned Miss USA deemed ‘gun-loving Trump fan’ and the left can’t handle"
"Dershowitz: Trump May Seek to Deny Biden 270 Electoral Votes, Put Election in Congress"
"Trump: Antifa Waited Until Most People Left MAGA Rally to Attack"
"Peter Neffenger, chairman of the board of Smartmatic voting software used by Dominion is on Joe Biden's DHS transition team."
"Not-So-Magic Mike? Bloomberg Spent $100M in 3 Key States That Trump Still Won"
"Leftist Goons Gruesomely Stomp on Trump Supporter’s Head After MAGA Rally"
"‘Things Are Going to Get Easier’: E.U. Dreams of a Subservient U.S. Under Joe Biden"
"If the election does go to the state legislators, that’s where we all come in. Trump supporters have to put so much pressure on these legislators that they do what’s right, not what’s easy."
"WATCH: D.C. Cops Direct Trump-Supporters into Gauntlet of Protesters, Do Nothing When They Are Assaulted"
"Gov. Cuomo: Trump Attacks Me Over COVID Vaccine Because 'He Doesn't Like That I Criticize Him' -- 'Typical Bully'"
"Man Begs Internet To Stop Making Him Defend Trump"
"Sanders 'Fully' Expects Biden to Back the Biden-Sanders Manifesto: 'These Are Not Far-Left Ideas'"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"Trump attorney Rudy Giuliani claims presidential election will be ‘overturned’"
"Jim Acosta: After January 20th, Trump Will Become 'Another Crackpot on the Internet' (How the hell does Acosta think that Trump will magically become Acosta after the swearing in?)"
"Biden Campaign Operative, Texas State Senator Accused of Mail-in Ballot Fraud"
"“The First Thing We Do”: The Lawless Campaign To Harass Lawyers Representing The Trump Campaign"
"Pelosi, Hoyer supposedly telling members not to join Team Biden"
"House leaders urge Congressional Democrats not to join Biden administration because their majority will be razor thin"
"James Woods exposes dozens of local news shows reading from the same (Biden) script"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"Bernie pushes Biden to adopt socialism: Sanders says majority of Americans support a 'far-left agenda' - and he'd like a position in Joe's cabinet"
"Democrats, Media Stand On The Graves Of European Jews To Hit Trump"
"Was Election Software Rigged? Sidney Powell Lays Out the Trump Team's Findings."
"Trump Campaign Files Suit, Asks Judge to Block PA From Certifying Election Results. Filing states that PA \"county officials illegally allowed voters to use deficient ballots to cast replacement absentee mail-in ballots\""
"Giuliani: Trump 'Far From' Conceding Election To Biden"
"Trump coronavirus adviser Scott Atlas urges Michigan to 'rise up' against new Covid-19 measures"
"A Post-Trump Foreign Policy Should Keep America First. Here’s How -- Whenever Trump leaves office, Republicans should devote themselves to fleshing out elements of his agenda that went unfulfilled. Foremost among these should be foreign policy."
"More Protective MAGA Helmets Now Available For Trump Supporters Brave Enough To Go Out In Public"
"Fauci Showed Breakthrough Pfizer COVID Vaccine Results To Biden Before Trump"
"Obama: Why Did Populist Republicans Rally Around 'Richie Rich' Trump?"
"Instant karma..."
"Obama Compares Trump to Dictator -- 'There Has Been a Sense' He Would 'Do Anything to Stay in Power'"
"NY Post: How much research funding did Biden's cancer charity provide?"
"Why did Donald Trump do better than expected in the U.S. election?"
"Joe Biden’s cancer charity spent more than $3.7million on staff salaries but distributed ZERO towards research grants over two years, tax filings reveal"
"Biden’s Foolish Immigration Priorities"
"Always Never Trump"
"Sharyl Attkisson: Media plotted to destroy Trump, cover for Biden"
"After Four Years of ‘the Resistance,’ Trump Is Right to Challenge the Election Results: If denying President Trump’s legitimacy for the past five years was okay, why is taking this one to court suddenly a threat to democracy?"
"Elderly Trump supporter attacked, protesters shoot fireworks at diners, surround hotel of Million MAGA March attendees"
"Joe Biden Promises to Raise Annual U.S. Refugee Target by 800%"
"Here's Why the Pollsters Underestimated the Trump Vote By So Much (1.5-minute audio clip from The All-In Podcast)"
"What’s the most expensive tweet in Twitter history? I nominate Kathryn Murdoch’s post-election tweet, “We did it!” The corruption of Fox News triggers flashbacks to the fall of the former dissident website Drudge Report, which went full Never Trump."
"Let's get ready to RATIOOO! Dems claiming Biden will 'restore the soul of this nation' as Biden supporters BEAT on Trump supporters in DC BACKFIRES"
"Like My Friend Franz Kafka, I’ve Got The Best COVID Rules For Joe Biden -- Restaurants must close at 10 p.m., except on Wednesdays, when they must close at 9 p.m., and Sundays, when they must close at 3 p.m. but cannot open until 4 p.m."
"Why Trump supporters are here for good"
"South Dakota Gov. Noem Won't Enforce Biden's Mask Mandate Tyranny"
"The Grand New Party: Here’s What’s In Store For The Republican Party Without Trump At The Helm"
"Jon Meacham Fired By MSNBC for Failure to Disclose Writing Biden Speech He Praised On The Air"
"[An oldie but a goodie, and maybe our national future under Biden/Harris] Wisconsin’s Shame: ‘I Thought It Was a Home Invasion’"
"Cuomo threatens to sue Trump administration over vaccine distribution plan"
"‘Bury Trump In A Nazi Graveyard,’ Alec Baldwin Says | The Daily Wire"
"Bolton: GOP Leaders Need to Explain to Trump Voters He Lost"
"Ilhan Omar: Biden Won Because Of GOP ‘Chaos’ | The Daily Wire"
"Violence occurs after rally in the nation's capital; Trump calls out Antifa"
"House leaders urge Democrats not to join team Biden to maintain majority"
"CSPAN Clip: Biden describing the dying off and replacement of whites in America"
"Fauci: Coronavirus Task Force Should Begin Meeting with Biden's Transition Team"
"Georgia Senate candidate Raphael Warnock: People in US need to 'repent' for Trump and 'worship of whiteness'"
"Biden wants mask mandates nationwide: ‘We can save tens of thousands of lives"
"'If you have to sleep with her, do it': a Hunter Biden-linked firm's pursuit of Russian money"
"Professor: Trump rose because government hasn’t served the people"
"Biden Cancer Charity Spends Entire Budget On Salaries, Zero On Research"
"Biden cancer \"charity\" spent millions on salaries, zero on research"
"Was Election Software Rigged? Sidney Powell Lays Out the Trump Team's Findings."
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Confirmed: Biden Cancer Initiative Spent on Salaries -- and Little Else"
"Pro-Trump Wisconsin Lawyers Spike Election Lawsuit on Morning of Court Hearing"
"Sanders to Trump: ‘Man-Up’ and Say You Lost the Election"
"Fury as Mayor tells Chicago to CANCEL Thanksgiving over Covid…days after celebrating Biden win maskless in crowd"
"Scoop: Trump plans last-minute China crackdown"
"Media Praise Joe Biden’s ‘Solid Catholic Faith’"
"Biden Transition Official Believes the First Amendment Has a 'Design Flaw' -- His Remedy Is to Curb Free Speech"
"DHS boss Chad Wolf defies Trump order to fire cyber chief Chris Krebs"
"'Far from over': 'MAGA' diehards pledge allegiance to Trump at Supreme Court"
"Trump lashes out after campaign reportedly scraps key claim in Pennsylvania suit"
"'I'm NOT Hunter Biden, lunchbox.' Dana Loesch takes down HORDE of frothy-mouthed, chest-thumping harpies trying to #FireGinaCarano"
"Trump Tweet: Our election was hijacked. There is no question. Congress has a duty to #ProtectOurDemocracy &amp; #FollowTheFacts.... oh, wait, that was Nancy Pelosi in 2017."
"Joe Biden: As Small as the Moment Demanded. On the victory and prospects of the president-elect"
"Maria Bartiromo: Don’t censor her and don’t call her a conspiracy theorist. She said she believes Trump was the victim of an attempted coup that began even before his election"
"Protesters Stomp on Trump Supporter's Head After D.C. Rally"
"BLM Attacks Pro-Trump Black Woman Pushing Stroller after D.C. Rally"
"Biden COVID Advisory Board Member: Indoor Dining, Gyms, and Gatherings in Homes Should Be Targeted ‘for Closures’"
"CNN’s Acosta: Trump Will Become Just ‘Another Crackpot On The Internet’ After Jan. 20 | The Daily Wire"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"CNN’s Acosta Projecting: Trump Will Become Just ‘Another Crackpot On The Internet’ After Jan. 20 | The Daily Wire"
"After attacking them earlier in the streets, Antifa and BLM now harassing Trump supporters at restaurants and hotels in DC"
"'Ready To Help': Biden Spoke At PA Election Board Chairman's Party"
"For First Time, Trump Says Biden ‘Won,’ But Again Claims ‘Election Was Rigged’ | The Daily Wire"
"Fox’s Wallace: Trump Can’t ‘Credibly’ Say the Election Was Taken from Him — No ‘Serious Fraud’"
"Trump: Georgia's Election Recount a 'Waste of Time' -- officials won't allow his campaign's observers to be in the counting rooms"
"Walked a fine line’: how Fox News found itself in an existential crisis"
"Antifa Goes Wild in D.C., Attacking Trump Supporters, Even Terrorizing Children and the Elderly"
"Fox News Anchor Blows Up on Trump Spokeswoman as the Descent Continues"
"Massive Crowds March in DC to Show Support for Trump, Demand Election Integrity"
"Pro-Trump Wisconsin Lawyers Spike Election Lawsuit on Morning of Court Hearing"
"‘Bury Trump In A Nazi Graveyard,’ Alec Baldwin Says | The Daily Wire"
"A Post-Trump Foreign Policy Should Keep America First. Here’s How -- Whenever Trump leaves office, Republicans should devote themselves to fleshing out elements of his agenda that went unfulfilled. Foremost among these should be foreign policy."
"James Woods exposes dozens of local news shows reading from the same (Biden) script"
"House leaders urge Democrats not to join team Biden to maintain majority"
"Scoop: Trump plans last-minute China crackdown"
"Not-So-Magic Mike? Bloomberg Spent $100M in 3 Key States That Trump Still Won"
"CSPAN Clip: Biden describing the dying off and replacement of whites in America"
"Obama, with a net worth of $70MM, calls Trump 'Richie Rich'"
"Trump Allies Considering Raising $200 Million For Fox News Alternative | The Daily Wire"
"Gov. Cuomo: Trump Attacks Me Over COVID Vaccine Because 'He Doesn't Like That I Criticize Him' -- 'Typical Bully'"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"Fauci: Coronavirus Task Force Should Begin Meeting with Biden's Transition Team"
"Obama: Why Did Populist Republicans Rally Around 'Richie Rich' Trump?"
"Obama Compares Trump to Dictator -- 'There Has Been a Sense' He Would 'Do Anything to Stay in Power'"
"Pollster: It's Curious How Biden Underperformed Hillary Clinton In Every City...Except These Four."
"Trump Allies Considering Raising $200 Million For Fox News Alternative | The Daily Wire"
"Biden’s Tax Returns Prove He’s a Scrooge When It Comes to Donating to Charity"
"‘Things Are Going to Get Easier’: E.U. Dreams of a Subservient U.S. Under Joe Biden"
"Israel Demands CNN Apology over Amanpour Likening Trump’s Tenure to Nazi Germany"
"The Grand New Party: Here’s What’s In Store For The Republican Party Without Trump At The Helm"
"Trump Campaign Rejects Media Reports of Changed Pennsylvania Case"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"NY Post: How much research funding did Biden's cancer charity provide?"
"Pelosi, Hoyer supposedly telling members not to join Team Biden"
"Dershowitz: Trump May Seek to Deny Biden 270 Electoral Votes, Put Election in Congress"
"The inevitability of Trump 2024 - As long as there is an audience, he will go on"
"Like My Friend Franz Kafka, I’ve Got The Best COVID Rules For Joe Biden -- Restaurants must close at 10 p.m., except on Wednesdays, when they must close at 9 p.m., and Sundays, when they must close at 3 p.m. but cannot open until 4 p.m."
"Trump lashes out after campaign reportedly scraps key claim in Pennsylvania suit"
"“The First Thing We Do”: The Lawless Campaign To Harass Lawyers Representing The Trump Campaign"
"1.7 Million Trump Votes Deleted By Dominion Voting System Nationwide."
"The U.S. Economy’s Remarkable Recovery Continues As Biden Plans To Crush It"
"The Real 'Authoritarian' Isn't Trump. It's The Left"
"Forget Finding Fraud, Trump May Seek to Deny Biden 270 Electoral Votes, Put Election in Congress"
"“Moderna's coronavirus vaccine is 94.5 per cent effective, according to company data” Trump REALLY wasn’t lying.."
"UFC fighter Jorge Masvidal says he may start attending conservative rallies 'to keep the peace' after seeing left-wing violence"
"BREAKING: New Vaccine Developed In Conjunction With Trump’s ‘Operation Warp Speed’ Is 94.5% Effective, Company Says"
"Biden Fills Economic Posts With Experts on Systemic Racism"
"If the election does go to the state legislators, that’s where we all come in. Trump supporters have to put so much pressure on these legislators that they do what’s right, not what’s easy."
"WATCH: D.C. Cops Direct Trump-Supporters into Gauntlet of Protesters, Do Nothing When They Are Assaulted"
"Obama Compares Trump To Dictator During Interview, Gets Slammed Online For Hypocrisy | The Daily Wire"
"Here's Why the Pollsters Underestimated the Trump Vote By So Much (1.5-minute audio clip from The All-In Podcast)"
"Biden COVID Advisor: Those Older Than 75 Should Get Vaccines Last -- American's should be deeply troubled that a man Biden is looking to for advice on COVID is someone who hopes to die at 75 and has publicly supported rationing care for the elderly."
"President Trump’s Final 2020 Act Should Be Pulling U.S. Out From Endless Wars -- A reprioritization of America’s strategic interests would cement the legacy of the first president in the era of great-power rivalry."
"Always Never Trump"
"Joe Biden's Student Loan Debt Forgiveness Plan Will Cancel up to $50,000 per Student"
"Joe Biden: As Small as the Moment Demanded. On the victory and prospects of the president-elect"
"The COVID Lockdown Rut. Biden’s ‘new’ plan is more of the same insanity: life lived through our smartphones and screens."
"Sanders 'Fully' Expects Biden to Back the Biden-Sanders Manifesto: 'These Are Not Far-Left Ideas'"
"Trump laying groundwork for full US troop withdrawal from Afghanistan before leaving office"
"Obama Compares Trump to Dictator -- 'There Has Been a Sense' He Would 'Do Anything to Stay in Power'"
"Jim Acosta: After January 20th, Trump Will Become 'Another Crackpot on the Internet' (How the hell does Acosta think that Trump will magically become Acosta after the swearing in?)"
"Trump campaign files slimmed down suit in Pennsylvania that drops key claim over 700K votes"
"China Expert: Beijing Happy With Biden Win. “I think China is very happy with how things turned out, because Beijing worked very hard to get the vice president elected” by malicious and massive attacks on President Donald Trump through a public disinformation campaign."
"Biden Transition Official Believes the First Amendment Has a 'Design Flaw' -- His Remedy Is to Curb Free Speech"
"Bernie pushes Biden to adopt socialism: Sanders says majority of Americans support a 'far-left agenda' - and he'd like a position in Joe's cabinet"
"The 2020 election took place under a Trump-declared “National Emergency” that set an Election Day trap for the “unauthorized accessing of election and campaign infrastructure”"
"If You Haven’t Quit Watching FOX News Yet… Watch this Clip of Leland Vittert laughing at a Trump Spokeswoman"
"Sidney Powell with Maria Bartiromo on software evidence to 'OVERTURN' multiple states (Video)"
"Emboldened by Biden, the Lockdown Fascists Return for Round 3. The political “Science!” leaders will all keep showing up to press conferences with their masks on so that we simple folk can bathe in the healing power of virtue-signalling."
"Leftists Declare A Biden-Harris Victory, Cue The Marxist Sing-Alongs"
"Biden Cancer Charity Spends Entire Budget On Salaries, Zero On Research"
"Biden’s Foolish Immigration Priorities"
"Rand Paul Vows to Prevent Biden Lockdown -- 'We Can't Go on Like This Forever'"
"Peter Neffenger, chairman of the board of Smartmatic voting software used by Dominion is on Joe Biden's DHS transition team."
"Trumpism won, despite election results"
"Silicon Valley eager for Biden to reverse Trump visa rules, hire more immigrants"
"Man Begs Internet To Stop Making Him Defend Trump"
"'If you have to sleep with her, do it': a Hunter Biden-linked firm's pursuit of Russian money"
"Why did Donald Trump do better than expected in the U.S. election?"
"Where's Biden? The silence from 'Mr. Unity' over violent attacks to Trump supporters is deafening"
"Trump attorney Rudy Giuliani claims presidential election will be ‘overturned’"
"Judge Jeanine: \"Don't you DARE ask us to go quietly into the night!\""
"Scoop: Trump plans last-minute China crackdown"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Bolton: GOP Leaders Need to Explain to Trump Voters He Lost"
"Leftist Goons Gruesomely Stomp on Trump Supporter’s Head After MAGA Rally"
"New federal lawsuit seeks to throw out 1.2 million votes in Michigan, flipping the state for Trump"
"Covid is so bad that Robert Reich wants to forget that pesky Constitution and just install Biden as President right now. No, I'm not kidding. This is a real tweet. Reich served in the Ford, Carter, Clinton and Obama administrations."
"Democrats, Media Stand On The Graves Of European Jews To Hit Trump"
"Trump coronavirus adviser Scott Atlas urges Michigan to 'rise up' against new Covid-19 measures"
"Media Praise Joe Biden’s ‘Solid Catholic Faith’"
"Asian kids officially kicked out of \"students of color\" category by a WA school district."
"Ilhan Omar: Biden Won Because Of GOP ‘Chaos’ | The Daily Wire"
"Small-Town Trump Rally One Of Many Unreported By Corporate Media -- The corporate media gave little to no coverage of the organic Trump rallies that erupted in cities and towns across America in solidarity with the DC march."
"Black Lives Matter And Antifa Assault Trump Supporters After DC March"
"House leaders urge Congressional Democrats not to join Biden administration because their majority will be razor thin"
"[An oldie but a goodie, and maybe our national future under Biden/Harris] Wisconsin’s Shame: ‘I Thought It Was a Home Invasion’"
"Outgoing Diplomat Admits Lying to President Trump About American Troop Numbers in Syria"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Donald Trump's Stealthy Road to Victory"
"Biden wants mask mandates nationwide: ‘We can save tens of thousands of lives"
"NASA boss Jim Bridenstine may resign if Joe Biden takes control of the White House, which would likely delay the 2024 Moon Landing and subsequent Mars colonization mission"
"Biden Campaign Operative, Texas State Senator Accused of Mail-in Ballot Fraud"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"Instant karma..."
"Trump Campaign Files Suit, Asks Judge to Block PA From Certifying Election Results. Filing states that PA \"county officials illegally allowed voters to use deficient ballots to cast replacement absentee mail-in ballots\""
"Cuomo threatens to sue Trump administration over vaccine distribution plan"
"Trump allies raising millions for new conservative TV network: report"
"Today Governor Cuomo threatened to sue the Trump administration if it moves ahead with its COVID-19 vaccine-distribution plan, which he called discriminatory — after the president threatened to move New York at the back of the line for getting the shot."
"Was Election Software Rigged? Sidney Powell Lays Out the Trump Team's Findings."
"WATCH: D.C. Cops Direct Trump-Supporters into Gauntlet of Protesters, Do Nothing When They Are Assaulted"
"Bill O'Reilly Predicts 'Collapse' Of Cable News Networks Post-Trump"
"Companies Are Preparing to Cut Jobs and Automate if Biden Gets $15 Minimum Wage Hike, Reporting Shows"
"Was Election Software Rigged? Sidney Powell Lays Out the Trump Team's Findings."
"After Four Years of ‘the Resistance,’ Trump Is Right to Challenge the Election Results: If denying President Trump’s legitimacy for the past five years was okay, why is taking this one to court suddenly a threat to democracy?"
"The Dominion software story keeps getting worse: the person in charge of the software’s security, is an Antifa supporter and Trump hater"
"DHS boss Chad Wolf defies Trump order to fire cyber chief Chris Krebs"
"Trump Lawyer Sidney Powell: 'We’re Getting Ready to Overturn Election Results in Multiple States'"
"Biden Transition Official Believes the First Amendment Has a 'Design Flaw' -- His Remedy Is to Curb Free Speech"
"Giuliani: Trump 'Far From' Conceding Election To Biden"
"CNN’s Acosta: Trump Will Become Just ‘Another Crackpot On The Internet’ After Jan. 20 | The Daily Wire"
"Violence occurs after rally in the nation's capital; Trump calls out Antifa"
"First African-American Miss USA distances herself from Trump after social media backlash."
"Jon Meacham Fired By MSNBC for Failure to Disclose Writing Biden Speech He Praised On The Air"
"Joe Biden Promises to Raise Annual U.S. Refugee Target by 800%"
"Watching the footage of all the violence against Trump supporters in DC got me like..."
"For First Time, Trump Says Biden ‘Won,’ But Again Claims ‘Election Was Rigged’ | The Daily Wire"
"CNN’s Acosta Projecting: Trump Will Become Just ‘Another Crackpot On The Internet’ After Jan. 20 | The Daily Wire"
"Confirmed: Biden Cancer Initiative Spent on Salaries -- and Little Else"
"Why Trump supporters are here for good"
"'Ready To Help': Biden Spoke At PA Election Board Chairman's Party"
"Walked a fine line’: how Fox News found itself in an existential crisis"
"Donald Trump is the only legitimate ‘President-Elect’"
"Sanders to Trump: ‘Man-Up’ and Say You Lost the Election"
"Lefties Assumed Trump Was Conceding... Until He Crushed Their Dreams (Again)."
"Twitter Claims Trump Conceded, He Counters: “I concede NOTHING!”"
"Trump: Antifa Waited Until Most People Left MAGA Rally to Attack"
"Durham’s Lame Duck Period: Democratic Leaders Suggest A Dim Future For Biden-Related Investigations"
"Let's get ready to RATIOOO! Dems claiming Biden will 'restore the soul of this nation' as Biden supporters BEAT on Trump supporters in DC BACKFIRES"
"First black woman crowned Miss USA deemed ‘gun-loving Trump fan’ and the left can’t handle"
"What’s the most expensive tweet in Twitter history? I nominate Kathryn Murdoch’s post-election tweet, “We did it!” The corruption of Fox News triggers flashbacks to the fall of the former dissident website Drudge Report, which went full Never Trump."
"Biden Called Out For Silence As Leftists Attack Pro-Trump Demonstrators In Nation’s Capital | The Daily Wire"
"Sharyl Attkisson: Media plotted to destroy Trump, cover for Biden"
"Tax filings reveal Biden cancer charity spent millions on salaries, zero on research"
"Fauci Showed Breakthrough Pfizer COVID Vaccine Results To Biden Before Trump"
"US election: Trump appears to admit Biden victory in tweet"
"'I'm NOT Hunter Biden, lunchbox.' Dana Loesch takes down HORDE of frothy-mouthed, chest-thumping harpies trying to #FireGinaCarano"
"Elderly Trump supporter attacked, protesters shoot fireworks at diners, surround hotel of Million MAGA March attendees"
"Joe Biden’s cancer charity spent more than $3.7million on staff salaries but distributed ZERO towards research grants over two years, tax filings reveal"
"Biden COVID Advisory Board Member: Indoor Dining, Gyms, and Gatherings in Homes Should Be Targeted ‘for Closures’"
"Biden’s Media Campaign"
"'Far from over': 'MAGA' diehards pledge allegiance to Trump at Supreme Court"
"More Protective MAGA Helmets Now Available For Trump Supporters Brave Enough To Go Out In Public"
"South Dakota Gov. Noem Won't Enforce Biden's Mask Mandate Tyranny"
"Georgia Senate candidate Raphael Warnock: People in US need to 'repent' for Trump and 'worship of whiteness'"
"Biden's Daughter: Ashley Biden has a troubled and racy past but - now settled with her plastic surgeon husband"
"2020 Election Recap, Discord Chat, and What’s To Come"
"The \"What happened in your state last week?\" Megathread, Week 45"
"The Republican Party Is Dead. It’s the Trump Cult Now."
"Judges appear increasingly frustrated with Trump's legal claims about 2020 election"
"Winter COVID surge is upon us — Trump and the Republicans are just ignoring it. Chasing electoral delusions and holding his entire party hostage, Trump is condemning thousands more to death"
"Trump in overnight meltdown as he makes eight false election claims in just four tweets"
"Where Biden Can Find $1 Trillion |Make the rich actually pay what they owe."
"Georgia recount is returning almost no changes in vote tallies that give Biden win"
"Will Trump Burn the Evidence? How the President could endanger the official records of one of the most consequential periods in American history."
"Now's a Good Time to Remember the Time Donald Trump's Own Investigation Proved Voter Fraud Isn't a Thing"
"Fauci says Biden transition is key to quick distribution of Covid vaccine"
"Fauci distances himself from Trump adviser Atlas: 'I totally disagree with the stand he takes'"
"Trump coronavirus advisor Scott Atlas urged people to 'rise up' against new restrictions in Michigan, then said he wasn't trying to encourage violence"
"Native Voters Helped Flip States for Biden. The Media Should Recognize That."
"Donald Trump's refusal to concede is no joke – it's a dangerous precedent"
"Trump claims he won the election; Twitter flags the tweet"
"\"No You Didn't\" Trends After Trump's Latest Election Result Lie"
"Trump is planning a series of confrontations with China in the final weeks of his presidency"
"Emily Murphy, the official blocking Biden's transition, has a record of working the system in ways that benefit Trump, ethics expert says"
"Obama says social media companies 'are making editorial choices, whether they've buried them in algorithms or not'"
"Dr. Fauci 'concerned' about Trump stalling Biden transition at critical time in pandemic"
"Fox News Anchor Thoroughly Debunks Trump's Election Fraud Claims"
"Trump has been struggling to walk back his tweet where he appeared to admit Biden won, undermining his baseless case that the election was stolen"
"To achieve his climate goals, Joe Biden needs to bring scientists back - ‘Much of the expertise of the federal bureaucracy has fled in horror’"
"Biden transition team prepares to fight Covid with no help from Trump"
"For GOP, time to accept reality"
"Trump should be held responsible"
"Biden Fills Economic Posts With Experts on Systemic Racism — Previous administrations haven’t made race scholarship such a clear priority."
"Trump or No Trump, Religious Authoritarianism Is Here to Stay"
"Trump coronavirus adviser Scott Atlas urges Michigan to 'rise up' against new Covid-19 measures"
"Trump, the Absolute Worst Loser"
"Donald Trump should concede and ‘put country above his ego’, says Barack Obama"
"Obama: Trump has accelerated 'truth decay'"
"Trump Distances Himself from Ongoing Election Lawsuits, Acts Like Campaign Hasn’t Been Losing in Court"
"Michigan Gov. Whitmer slams Trump adviser who encouraged residents to 'rise up"
"Trump’s Favorite Coronavirus Adviser Just Urged People to ‘Rise Up’ Against Restrictions - He singled out Michigan Gov. Gretchen Whitmer, who has already been the target of one violent far-right group."
"Obama’s advice to Trump? ‘It’s time for you’ to concede to Biden."
"America’s largest militia says it will refuse to recognise Biden as president and ‘resist’ his administration"
"‘We need to do another stimulus package’: Former Obama economist tells MarketWatch what advice she would give Joe Biden"
"Obama said he was surprised at top Republicans who did a 'complete 180 on everything they claimed to believe' to align with Trump"
"Trump Camp Melts Down Over Reports Noting Its PA Lawsuit Had Been Scaled Back"
"N.Y. senators blame Mitch McConnell for holding up COVID relief bill"
"This is no conventional coup. Trump is paving the way for a 'virtual Confederacy'"
"Dear Joe Biden: Don’t Put Rahm Emanuel in Your Administration"
"Why Joe Biden Must Sideline Fox"
"Georgia's GOP secretary of state goes on Facebook fact-checking spree over Trump's misinformation"
"Biden to campaign in Georgia for Warnock and Ossoff in runoff elections deciding control of Senate"
"President Donald Trump shouldn't be able to pardon himself"
"What the history of coups tells us about Trump’s refusal to concede - Democracies are fragile and only vigilance from citizens can protect them."
"Trump’s Top COVID Adviser Denies Trying To Incite Violence Against MI Guv. With ‘Rise Up’ Tweet"
"Trump coronavirus adviser tells Michigan to ‘rise up’ against new shutdown orders"
"Donald Trump's legal strategy makes no sense for winning the vote count. So what is he doing?"
"Trump Campaign Scales Back Pennsylvania Lawsuit After Law Firm Abandoned Ship"
"Trump campaign scraps claims its observers weren’t allowed to watch vote count from key lawsuit"
"Americans across party lines, regions embrace marijuana"
"Trump’s Tantrum Could Do Real Harm"
"2 more GOP governors push Trump to start the formal presidential transition process with Biden"
"If it were happening in Turkey, we’d call Trump’s actions an attempted coup"
"Yes, 55 Percent of White Women Voted for Trump. No, I’m Not Surprised."
"Obama said he was surprised at top Republicans who did a 'complete 180 on everything they claimed to believe' to align with Trump"
"You Can't Eat Civility: A Message to Joe Biden and the Democrats"
"Two more people from Trump's Election Night party at White House test positive for coronavirus"
"Obama Says Trump Has Accelerated 'Truth Decay' In America"
"The deafening silence of Republican senators on Donald Trump's increasingly erratic behavior"
"Obama Calls Trump's Refusal To Concede Another 'Breach Of Basic Democratic Norms'"
"Trump's Midnight Twitter Scream Causes 3 Honest Words To Trend In Response"
"Trump allies in talks to buy Newsmax and turn it into Fox News competitor, reports say"
"Trump takes no questions in first public remarks since losing election"
"Obama to Trump on conceding election: 'Think beyond your own ego'"
"Newsmax CEO: 'We Are Not Actively Selling,' Have No Desire to Be 'Trump TV'"
"Jared Kushner’s Company Reportedly Moves To Evict Hundreds As Pandemic Rages"
"Trump campaign retreats from key Pennsylvania suite"
"Former US ambassador: Biden's lack of access to intel briefings 'potentially catastrophic'"
"Community colleges find an advocate in future First Lady Jill Biden"
"Remember when Canada and the U.S. were friends? Joe Biden does"
"Court Agrees with Attorney General James That Trump Administration’s Latest DACA Order Was Illegal"
"Azar Defends WH's Refusal To Share COVID Vaccine Plans With Biden's Transition Team"
"Fauci Suggests 'It Would Be Better' to Begin Working With Biden Team, Says Trump Hasn't Attended Task Force Meeting in Months"
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"Incoming chief of staff: “Trump’s Twitter feed doesn’t make Joe Biden president or not president”"
"Trump's failure to work with Biden is becoming more urgent as Covid spreads"
"Michigan governor says she has authority for stay-home order"
"Trump tweets \"mail-in elections are a sick joke,\" as conservative groups encourage mail-in voting in Georgia Senate runoffs"
"Trump Won't Stop Posting a Bogus Voting Machine Conspiracy Theory From QAnon - He spent the weekend boosting the theory about rigged voting machines, and Monday morning screaming that he won the election he lost."
"Cuomo says NY will sue if Trump's vaccine plan lacks equal access for communities of color"
"The Million MAGA March in DC Got Ugly - Violence broke out when thousands of Trump supporters—including QAnon conspiracy theorists and Proud Boys—descended on Washington, D.C. Saturday to insist the president won the election."
"Biden team to meet with coronavirus vaccine makers this week as Trump stonewalls transition"
"Trump campaign jettisons major parts of its legal challenge against Pennsylvania’s election results"
"Trump campaign drops key claim in Pennsylvania ballot challenge"
"Biden promised a 'railroad revolution' that could see faster trains and a return to Amtrak's nostalgic past — here's what Americans might see"
"First Thing: Trump's election lawsuits continue to crumble"
"Georgia elections chief fires back at Trump over claims about recount process"
"Obama says Trump voters’ alternative views divide the country"
"GOP Governors Suggest That Trump Stop Delaying Biden’s Formal Transition Process"
"Obama throws cold water on a Biden cabinet post: 'Michelle would leave me'"
"The Note: Toll of Trump’s defiance comes into view | Trump's refusal to acknowledge the election results could have consequences."
"What Bernie Sanders Could Do as Secretary of Labor - If Biden were to embrace the idea, Sanders and a team of visionary leaders could forge a new New Deal for working Americans."
"Potentially Catastrophic': Former U.S. Ambassador Says Biden Needs Intel Briefings Before Inauguration"
"Bernie Sanders says Trump denying election results 'beyond belief in terms of behavior for an American president'"
"Lawsuits that tried to disrupt Biden's wins in four states are withdrawn"
"‘Several months’ since Trump attended a Covid crisis meeting, Fauci says"
"Trump's lawyer falsely claims he won by millions of votes"
"Obama says Trump has caused ‘damage’ by refusing to concede defeat and warns: ‘This is not normal’"
"Obama says it's 'disappointing' more Republicans aren't challenging Trump over election results"
"Obama calls Trump 'Richie Rich'"
"Donald Trump's estranged niece says uncle is 'deliberately' refusing to concede election"
"EU says looking forward to better ties with US under Biden"
"Trump Has Been Skipping White House COVID Meetings for Months"
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"Trump Admits Defea … Never Mind"
"Republican Arkansas governor: 'I expect Joe Biden to be the next president of the United States'"
"Bolton: Republican leaders need to explain to voters that Trump lost"
"'Donald Trump v. USA': legal experts marvel as election lawsuits border on bizarre"
"Fauci: 'It would be better' if government health officials could start working with incoming Biden-Harris administration"
"Trump national security adviser: There will be a 'professional transition' of power"
"Massive election disinformation campaign connected to Roger Stone"
"Trump's Pentagon shakeup may be more than perceived disloyalty"
"Bernie Sanders Tells Trump to 'Man Up' and Get Out of the White House in January"
"Trump Campaign Retreats From Key Claim in Pennsylvania Suit"
"Attorney General James Ready to Sue Trump Administration if New York Doesn’t Receive COVID-19 Vaccine with Rest of U.S."
"Trump says Ohio governor's race will be 'hotly contested' after DeWine acknowledges Biden win"
"Will Donald Trump derail the economy by desperately clinging to power after being defeated by Joe Biden?"
"Pompeo calls for respecting elections abroad while ignoring Biden victory"
"America Has Yet To Shake Its Addiction To Hate - Black Americans did not grieve Trump's 2016 win in the same way as white liberals."
"Biden Likely to Stump in Georgia for Senate Runoffs, Aide Says"
"Trump, Trying to Cling to Power, Fans Unrest and Conspiracy Theories"
"Fox Fact-Checks Trump and Own Hosts’ Claims of Voter Fraud"
"Biden campaign says Georgia's U.S. presidential recount reveals no irregularities"
"Dr. Fauci: Trump hasn’t attended a coronavirus task force meeting in ‘several months’"
"Trump campaign abandons parts of Pennsylvania election lawsuit"
"Biden’s chief of staff says ‘he won’ and there’s nothing Donald Trump can tweet to change it"
"\"Trump just conceded\": Reactions follow president's \"he won because\" tweet"
"Trump asserts he will soon file 'big cases' challenging 2020 election results"
"Trump national security adviser O'Brien says looks now that Biden has won"
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"Trump admits Biden won, falsely claims election was 'rigged'"
"Native voters aren't 'something else' — we helped swing the presidential election"
"Exactly four years ago, Trump got his first top-secret intelligence briefing 7 days after election win—Biden still hasn't"
"National Security Adviser Says It Looks Like Biden Has Won The Election"
"Biden won places that are thriving. Trump won ones that are hurting."
"Republican governors say Biden transition must begin as Trump tweets \"I concede nothing\""
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"The Trump campaign dropped a major part of its election lawsuit regarding their claims that observers were not allowed to watch vote counts in Pennsylvania"
"John Bolton urges GOP leaders to \"explain\" to voters that Trump lost: \"This is a character test\""
"Trump campaign abandons part of legal challenge to Pennsylvania election results - Allegation that 682,479 mail-in and absentee ballots were illegally processed without its representatives watching has been dropped"
"Trump campaign downsizing, letting most staff go — except those helping legal battle"
"The Cities Accused in Fraud Conspiracies Didn’t Cost Trump the Election"
"John Kelly: Trump’s Failure to Concede the Election ‘Hurts Our National Security’"
"Trump has conceded, whether he walked it back or not. Now Emily Murphy has to act"
"HHS Secretary Azar says the FDA will move 'as quickly as possible' to clear Moderna and Pfizer's Covid vaccines"
"State AGs have sued the Trump admin. 138 times — nearly double those of Obama, Bush"
"Trump’s Refusal to Start the Transition Process Is Crippling America’s Coronavirus Response"
"Republicans increasingly urge Trump to begin formal transition"
"Trump Throws Twitter Tantrum As Long-Shot Attempts To Stay In Power Fade Away"
"Trump, Trying to Cling to Power, Fans Unrest and Conspiracies"
"Lawsuits that tried to disrupt Biden's wins in four states are withdrawn"
"Trump hasn't attended a coronavirus task force meeting in five months and is taking no role in combatting the surge in the disease"
"Here are 10 climate executive actions Biden says he will take on day one"
"Biden’s corporate tax plan depends on Georgia’s Senate results"
"Trump admits for first time that Biden won the election"
"As Biden Hails Moderna Vaccine Scientists, Trump Tweets 'All Took Place on My Watch!'"
"Trump Rebuffs Biden Transition Team, Setting Off Virus and National Security Risks"
"Trump, with help, is trying to sue and tweet his way to a second term. Could it work?"
"Opposing Bush v. Gore Attorneys Say Biden Clearly Won the Election, 'No Resemblance' to 2000 Dispute"
"Trump campaign retreats from key claim in Pennsylvania lawsuit"
"Fox Fact-Checks Trump and Own Hosts' Claims of Voter Fraud"
"Trump learns an old Hollywood truth: It sucks to get cancelled"
"Public Pressure And Lawsuits Kept USPS From Handing Trump The Election. Here’s How."
"Ivanka Trump and Jared Kushner are poised to return to a Manhattan social scene that no longer welcomes them"
"Biden’s IRS could finally give Trump’s tax returns to Democrats"
"Trump hints at primary challenge for Ohio Gov. DeWine, who acknowledged Biden as president-elect"
"Juan Williams: Defeated Trump is in legal peril"
"Trump's election support from evangelicals shows we're the biggest obstacle to racial justice"
"Memo to Trump: \"The biggest fraud in America continues to be you\""
"Lawyers Pan Significant ‘Shrinkage’ of Trump Campaign’s Pennsylvania Lawsuit: Only Addresses a ‘Handful of Ballots’"
"Obama calls Trump 'Richie Rich'"
"Was It Worth It, Jared and Ivanka? The glossiest grifters become Vuitton vagabonds."
"Trump’s enablers are playing a dangerous game | Remember last weekend, when Joe Biden was declared president-elect and it seemed like the madness would finally end?"
"US election results: Donald Trump admits Biden 'won' for first time"
"Trump COVID Adviser Tells People of Michigan to ‘Rise Up’ Against New Restrictions"
"Michigan Gov. Whitmer slams Trump adviser who encouraged residents to 'rise up'"
"Barack Obama Reveals Meaning Behind Memoir Title, Gives Advice to Trump in '60 Minutes' Interview"
"'It's critical' for Republican leaders to explain to voters Trump lost the election: John Bolton"
"A lawyer for Trump's campaign claims without evidence the president won reelection by 'millions of votes'"
"How Trump Set Up Nursing Home Residents to Die in the Pandemic. And What President-Elect Biden Can Do to Help Them"
"‘A reflection of the nation’: Joe Biden’s transition team is majority women and employs many people of colour"
"Obama Blames Trump's 'Petulance' For Biden Transition Delays"
"Trump National Security Adviser Robert O'Brien says it looks like Biden has won - At the Soufan Center's global security forum, National Security Adviser Robert O'Brien also predicted a \"very professional transition.\""
"Obama says Biden victory won’t be enough to stop US ‘truth decay’"
"Trump aide promises ‘very professional transition’ to Biden"
"Trump’s New Vote Fraud Theory Is So Much Crazier Than You Realize"
"Obama says it's 'disappointing' that more Republicans aren't standing up to Trump over election results"
"Trump coronavirus adviser slammed for telling residents to 'rise up' against new restrictions"
"QAnon Supporters, Paramilitary Groups Promise ‘Fight' Over Election At Pro-Trump Rally Near Nevada’s Capitol"
"Biden advisers to meet vaccine firms as Trump stalls handoff"
"Biden turns focus to U.S. economy as Trump vows more challenges to election outcome"
"Americans need to remain vigilant - The American people must not assume it is over until Trump leaves the White House."
"Trump faces criticism over raging COVID-19 crisis as he delays Biden transition and focuses on election"
"Trump aide promises 'very professional transition' to Biden"
"Biden's Team Warns Trump's Refusal To Aid Transition Would Jeopardize COVID Vaccine Distribution"
"Trump should have his day in court – it’s the only way to stop the dangerous election myths he is peddling"
"MAGA rally: One stabbing and at least 20 arrests as Trump supporters descend on DC"
"US records 166,000 new Covid cases as Trump supporters crowd Washington"
"John Bolton says GOP leaders need to tell voters that Trump lost and dismiss his 'baseless' election fraud claims"
"New Interior order undermines conservation bill Trump campaigned on, critics say"
"Jim Acosta says Trump will just be another 'crackpot' on internet after Jan. 20"
"Trump’s student loan cliff threatens chaos for Biden | Biden could inherit the confusion of monthly payments restarting for tens of millions of Americans amid a pandemic."
"As a third covid-19 wave rises, Trump dawdles and Republicans hide"
"A breakdown of Giuliani's role in Trump's post-election fight"
"Profiles in cowardice: Trump's Senate enablers"
"The federal government’s chief information security officer is helping an outside effort to hunt for alleged voter fraud"
"Trump declares 'I won': the Presidential tweet that threatens chaos | ITV News"
"\"That's His Priority as the Pandemic Rages On\": McConnell Readies Lame Duck Push to Further Pack Courts With Trump's Judicial Appointees"
"Lawsuits that tried to disrupt Biden's wins in four states are withdrawn"
"Trump Tweets That Biden Won Election, Says Vote Was ‘Rigged’"
"Pro-Trump Wisconsin Lawyers Spike Election Lawsuit on Morning of Court Hearing"
"Fauci says it's 'obvious' that it would be 'better' for public health if Trump facilitated a smooth transition to Biden"
"I'm Not Going to Be Comfortable Until Joe Biden's Hand Comes Off the Bible"
"The MAGA Army Tries to Drag America to Hell — Dear Leader Trump’s toy soldiers make one last stand on the streets of Washington, DC."
"Biden Won. Will the Climate? 5 leaders point the way forward for a divided nation."
"The Post-Presidency of a Con Man: Out of office, Trump might seem a lot less formidable."
"Where Trump’s recount fundraising dollars are really going"
"Obama calls Trump 'Richie Rich'"
"GOP, Biden team raise pressure on Trump official to approve transition, citing national security, COVID-19"
"Chicago mayor issues stay at home order to stem COVID-19 deaths"
"Ohio GOP governor says Trump should begin transition process amid legal battles"
"Trump's acting DHS secretary was unlawfully appointed and didn't have the authority to suspend DACA, a federal judge ruled"
"Trump will cast a long shadow over Republican party despite defeat"
"Joe Biden Won. But Our Politics Are Incredibly Unstable."
"Obama says it's 'disappointing' more Republicans aren't challenging Trump over election results | TheHill"
"Trump Admits Biden Won Election but Quickly Takes it Back"
"‘Stop the Steal’ Movement Will ‘Force’ States Biden Won to Send Republican Electors to Electoral College, Says Trump Rally Organizer"
"Here are 7 Donald Trump health care measures that Joe Biden will likely overturn"
"Hospitals Are Being Overwhelmed by COVID and Trump Has Left It to States to Solve It"
"Trump campaign retreats from key claim in Pennsylvania suit"
"Trump Tweets Out a Casual Concession After Long Insisting He Won"
"Trump fights to keep a job he shows no interest in performing"
"AP Fact Check: Trump wrong on Georgia voter signature checks"
"Biden COVID-19 adviser: We can get pandemic under control without another national lockdown"
"Debunking Trump’s Post-Election Lies"
"What Does Trump Get Out of Contesting Biden’s Win? The election was not close, and the President’s claims of voter fraud are merely a distraction from his many recent failures."
"Trump's Border Wall Builders Carry On Even Though Projects May Never Be Completed"
"After Trump, will the presidency recede a bit for Americans?"
"Trump’s Lawyers Just Blew Up Their Own Pennsylvania Lawsuit"
"GOP shows limited appetite for pursuing Biden probes"
"Trump officials rush to auction off rights to Arctic National Wildlife Refuge before Biden can block it"
"Trump’s COVID-19 Adviser Tells Michigan To ‘Rise Up’ Over Whitmer's New Restrictions"
"Trump faces growing pressure to start transition as Covid surges across US"
"Trump national security adviser O'Brien says looks now that Biden has won"
"Election Latest: Trump Campaign Retreats From Key Claim in Pa. Suit"
"Women crucial to Biden's win, even as gender gap held steady"
"A less-racist brand of Trump populism could bring a GOP dynasty unless Dems do something"
"Barack Obama Implores Donald Trump to Look 'Beyond' His Ego and 'Put the Country First'"
"Trump tweets words 'he won;' says vote rigged, not conceding"
"Trump campaign drops key request in Pennsylvania lawsuit"
"Joe Biden is the PTSD president we need"
"Democrats warn Trump administration against last-minute regulations"
"Obama calls Trump 'Richie Rich'"
"Trump’s Lawyers Just Blew Up Their Own Pennsylvania Lawsuit"
"Liz Peek: Trump's 2020 supporters – what they had to overcome to vote for 4 more years"
"Trump fights to keep a job he shows no interest in performing"
"Lawsuits that tried to disrupt Biden's wins in four states are withdrawn"
"Trump national security adviser O'Brien says looks now that Biden has won"
"For President Trump, a larger fight endures after 2020 election: Goodwin"
"Biden can do 3 things on day one to unwind Trump’s war on reproductive health | And he doesn’t need Congress."
"Barack Obama Implores Donald Trump to Look 'Beyond' His Ego and 'Put the Country First'"
"GOP Infighting Continues As Georgia Secretary Of State Does Some Late-Night Debunking"
"I'm Not Going to Be Comfortable Until Joe Biden's Hand Comes Off the Bible"
"Trump officials rush to auction off rights to Arctic National Wildlife Refuge before Biden can block it"
"Women crucial to Biden's win, even as gender gap held steady"
"The MAGA Army Tries to Drag America to Hell — Dear Leader Trump’s toy soldiers make one last stand on the streets of Washington, DC."
"Pro-Trump Wisconsin Lawyers Spike Election Lawsuit on Morning of Court Hearing"
"Trump Administration, in Late Push, Moves to Sell Oil Rights in Arctic Refuge"
"Trump national security adviser O'Brien says looks now that Biden has won"
"Trump’s New Vote Fraud Theory Is So Much Crazier Than You Realize"
"Biden’s IRS could finally give Trump’s tax returns to Democrats"
"National Security Adviser Says It Looks Like Biden Has Won The Election"
"Trump has conceded, whether he walked it back or not. Now Emily Murphy has to act"
"Lawsuits that tried to disrupt Biden's wins in four states are withdrawn"
"The \"What happened in your state last week?\" Megathread, Week 45"
"Obama says it's 'disappointing' more Republicans aren't challenging Trump over election results | TheHill"
"‘Stop the Steal’ Movement Will ‘Force’ States Biden Won to Send Republican Electors to Electoral College, Says Trump Rally Organizer"
"‘A reflection of the nation’: Joe Biden’s transition team is majority women and employs many people of colour"
"Trump's election support from evangelicals shows we're the biggest obstacle to racial justice"
"Trump aide promises 'very professional transition' to Biden"
"Ex-HHS chief Sebelius says Trump administration deserves credit for vaccine progress"
"QAnon Supporters, Paramilitary Groups Promise ‘Fight' Over Election At Pro-Trump Rally Near Nevada’s Capitol"
"Lawsuits that tried to disrupt Biden's wins in four states are withdrawn"
"Lawyers Pan Significant ‘Shrinkage’ of Trump Campaign’s Pennsylvania Lawsuit: Only Addresses a ‘Handful of Ballots’"
"One of Biden’s First Acts as President-Elect Was to Antagonize Kim Jong Un"
"Trump hints at primary challenge for Ohio Gov. DeWine, who acknowledged Biden as president-elect"
"How Trump Set Up Nursing Home Residents to Die in the Pandemic. And What President-Elect Biden Can Do to Help Them"
"Trump's Border Wall Builders Carry On Even Though Projects May Never Be Completed"
"Trump, Trying to Cling to Power, Fans Unrest and Conspiracy Theories"
"Michigan Gov. Whitmer slams Trump adviser who encouraged residents to 'rise up'"
"Obama calls Trump 'Richie Rich'"
"Trump campaign drops key request in Pennsylvania lawsuit"
"Obama calls Trump 'Richie Rich'"
"Obama calls Trump 'Richie Rich'"
"Trump coronavirus adviser slammed for telling residents to 'rise up' against new restrictions"
"Trump's lawyer falsely claims he won by millions of votes"
"The deafening silence of Republican senators on Donald Trump's increasingly erratic behavior"
"If it were happening in Turkey, we’d call Trump’s actions an attempted coup"
"Trump Won't Stop Posting a Bogus Voting Machine Conspiracy Theory From QAnon - He spent the weekend boosting the theory about rigged voting machines, and Monday morning screaming that he won the election he lost."
"Could Trump Hamstring Biden’s COVID Vaccine Rollout?"
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"E.U. Dreams of a Subservient U.S. Under Joe Biden"
"Trump National Security Adviser Robert O'Brien says it looks like Biden has won - At the Soufan Center's global security forum, National Security Adviser Robert O'Brien also predicted a \"very professional transition.\""
"Shields and Brooks on election results, Trump’s resistance"
"Jared Kushner’s Company Reportedly Moves To Evict Hundreds As Pandemic Rages"
"Obama said he was surprised at top Republicans who did a 'complete 180 on everything they claimed to believe' to align with Trump"
"Ivanka Trump and Jared Kushner are poised to return to a Manhattan social scene that no longer welcomes them"
"Fox Fact-Checks Trump and Own Hosts’ Claims of Voter Fraud"
"The federal government’s chief information security officer is helping an outside effort to hunt for alleged voter fraud"
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"Trump officials rush to auction off rights to the Arctic National Wildlife Refuge before Biden can block it"
"Trump’s student loan cliff threatens chaos for Biden | Biden could inherit the confusion of monthly payments restarting for tens of millions of Americans amid a pandemic."
"Trump aide promises ‘very professional transition’ to Biden"
"Obama said he was surprised at top Republicans who did a 'complete 180 on everything they claimed to believe' to align with Trump"
"Biden’s corporate tax plan depends on Georgia’s Senate results"
"Emily Murphy, the official blocking Biden's transition, has a record of working the system in ways that benefit Trump, ethics expert says"
"Trump Camp Melts Down Over Reports Noting Its PA Lawsuit Had Been Scaled Back"
"Dear Joe Biden: Don’t Put Rahm Emanuel in Your Administration"
"Trump says Ohio governor's race will be 'hotly contested' after DeWine acknowledges Biden win"
"Georgia elections chief fires back at Trump over claims about recount process"
"Georgia's GOP secretary of state goes on Facebook fact-checking spree over Trump's misinformation"
"Michigan governor says she has authority for stay-home order"
"Newsmax CEO: 'We Are Not Actively Selling,' Have No Desire to Be 'Trump TV'"
"Analysis | The Cybersecurity 202: Trump’s finally talking about election security – but only to spread conspiracy theories"
"Obama says social media companies 'are making editorial choices, whether they've buried them in algorithms or not'"
"Trump’s Favorite Coronavirus Adviser Just Urged People to ‘Rise Up’ Against Restrictions - He singled out Michigan Gov. Gretchen Whitmer, who has already been the target of one violent far-right group."
"America Has Yet To Shake Its Addiction To Hate - Black Americans did not grieve Trump's 2016 win in the same way as white liberals."
"Debunking Trump’s Post-Election Lies"
"After Biden win, Black activists demand reparations for slavery, police reform"
"Trump national security adviser: There will be a 'professional transition' of power"
"Trump Campaign Retreats From Key Claim in Pennsylvania Suit"
"How a Republican Congresswoman Won by Betting on Trump - Representative Elise Stefanik embraced the president in her rural New York district and has reaped the benefits in spite of his defeat."
"Now's a Good Time to Remember the Time Donald Trump's Own Investigation Proved Voter Fraud Isn't a Thing"
"Here are 7 Donald Trump health care measures that Joe Biden will likely overturn"
"Azar Defends WH's Refusal To Share COVID Vaccine Plans With Biden's Transition Team"
"New Interior order undermines conservation bill Trump campaigned on, critics say"
"What the history of coups tells us about Trump’s refusal to concede - Democracies are fragile and only vigilance from citizens can protect them."
"Obama to Trump on conceding election: 'Think beyond your own ego'"
"As Biden Hails Moderna Vaccine Scientists, Trump Tweets 'All Took Place on My Watch!'"
"Was It Worth It, Jared and Ivanka? The glossiest grifters become Vuitton vagabonds."
"Michigan Gov. Whitmer slams Trump adviser who encouraged residents to 'rise up"
"Fauci distances himself from Trump adviser Atlas: 'I totally disagree with the stand he takes'"
"First Thing: Trump's election lawsuits continue to crumble"
"Trump campaign scraps claims its observers weren’t allowed to watch vote count from key lawsuit"
"NATO, acting US Pentagon chief discuss Afghanistan"
"Where Biden Can Find $1 Trillion |Make the rich actually pay what they owe."
"What Bernie Sanders Could Do as Secretary of Labor - If Biden were to embrace the idea, Sanders and a team of visionary leaders could forge a new New Deal for working Americans."
"The Cities Accused in Fraud Conspiracies Didn’t Cost Trump the Election"
"You Can't Eat Civility: A Message to Joe Biden and the Democrats"
"Barack Obama on his book, President Trump, George Floyd, the divisions in the country, and more"
"Former US ambassador: Biden's lack of access to intel briefings 'potentially catastrophic'"
"Gov. Cuomo threatens to sue Trump administration over vaccine distribution"
"Trump, with help, is trying to sue and tweet his way to a second term. Could it work?"
"Americans across party lines, regions embrace marijuana"
"Mick Mulvaney: Policy makers may consider a targeted stimulus approach"
"The Note: Toll of Trump’s defiance comes into view | Trump's refusal to acknowledge the election results could have consequences."
"HHS Secretary Azar says the FDA will move 'as quickly as possible' to clear Moderna and Pfizer's Covid vaccines"
"What do Trump supporters think of a Biden presidency?"
"A breakdown of Giuliani's role in Trump's post-election fight"
"To achieve his climate goals, Joe Biden needs to bring scientists back - ‘Much of the expertise of the federal bureaucracy has fled in horror’"
"Why Joe Biden Must Sideline Fox"
"Trump's Pentagon shakeup may be more than perceived disloyalty"
"Native Voters Helped Flip States for Biden. The Media Should Recognize That."
"The Republican Party Is Dead. It’s the Trump Cult Now."
"\"No You Didn't\" Trends After Trump's Latest Election Result Lie"
"Red County: Why Jasper County residents say they voted for Trump"
"Barack Obama Reveals Meaning Behind Memoir Title, Gives Advice to Trump in '60 Minutes' Interview"
"Trump’s Top COVID Adviser Denies Trying To Incite Violence Against MI Guv. With ‘Rise Up’ Tweet"
"Dr. Fauci 'concerned' about Trump stalling Biden transition at critical time in pandemic"
"Winter COVID surge is upon us — Trump and the Republicans are just ignoring it. Chasing electoral delusions and holding his entire party hostage, Trump is condemning thousands more to death"
"Trump campaign retreats from key claim in Pennsylvania lawsuit"
"Obama: Trump has accelerated 'truth decay'"
"Trump campaign retreats from key Pennsylvania suite"
"Trump’s Tantrum Could Do Real Harm"
"Fauci says Biden transition is key to quick distribution of Covid vaccine"
"Trump campaign drops key claim in Pennsylvania ballot challenge"
"After Trump, will the presidency recede a bit for Americans?"
"Trump is planning a series of confrontations with China in the final weeks of his presidency"
"Trump coronavirus adviser tells Michigan to ‘rise up’ against new shutdown orders"
"Biden Won. Will the Climate? 5 leaders point the way forward for a divided nation."
"Obama compares Trump to dictator who suppresses journalists, after his own admin targeted reporters"
"Judges appear increasingly frustrated with Trump's legal claims about 2020 election"
"‘We need to do another stimulus package’: Former Obama economist tells MarketWatch what advice she would give Joe Biden"
"Trump Admits Defea … Never Mind"
"Biden transition team prepares to fight Covid with no help from Trump"
"Here are 10 climate executive actions Biden says he will take on day one"
"Obama’s advice to Trump? ‘It’s time for you’ to concede to Biden."
"Trump will get portrait, library no matter his future plans"
"For GOP, time to accept reality"
"A house divided: Under Joe Biden, Democrats must find a way to be a pragmatic, big-tent party"
"Women crucial to Biden's win, even as gender gap held steady"
"Trump's Midnight Twitter Scream Causes 3 Honest Words To Trend In Response"
"Trump has been struggling to walk back his tweet where he appeared to admit Biden won, undermining his baseless case that the election was stolen"
"Biden turns focus to U.S. economy as Trump vows more challenges to election outcome"
"Trump coronavirus advisor Scott Atlas urged people to 'rise up' against new restrictions in Michigan, then said he wasn't trying to encourage violence"
"Obama Blames Trump's 'Petulance' For Biden Transition Delays"
"Juan Williams: Defeated Trump is in legal peril"
"Will Trump Burn the Evidence? How the President could endanger the official records of one of the most consequential periods in American history."
"Trump faces criticism over raging COVID-19 crisis as he delays Biden transition and focuses on election"
"Trump in overnight meltdown as he makes eight false election claims in just four tweets"
"‘Several months’ since Trump attended a Covid crisis meeting, Fauci says"
"State AGs have sued the Trump admin. 138 times — nearly double those of Obama, Bush"
"Trump should have his day in court – it’s the only way to stop the dangerous election myths he is peddling"
"Trump or No Trump, Religious Authoritarianism Is Here to Stay"
"‘Walked a fine line’: how Fox News found itself in an existential crisis"
"Trump plans last-minute China crackdown"
"Obama says Biden victory won’t be enough to stop US ‘truth decay’"
"Potentially Catastrophic': Former U.S. Ambassador Says Biden Needs Intel Briefings Before Inauguration"
"Election Latest: Trump Campaign Retreats From Key Claim in Pa. Suit"
"Trump campaign drops key claim over election observers in Pennsylvania lawsuit"
"How a Minneapolis Suburb Turned Blue, Despite Trump’s Law-and-Order Pitch"
"Trump declares 'I won': the Presidential tweet that threatens chaos | ITV News"
"Here’s What We Learned About the Far Right From Donald Trump’s Presidency"
"EU says looking forward to better ties with US under Biden"
"Georgia recount is returning almost no changes in vote tallies that give Biden win"
"John Bolton urges GOP leaders to \"explain\" to voters that Trump lost: \"This is a character test\""
"GOP, Biden team raise pressure on Trump official to approve transition, citing national security, COVID-19"
"Trump claims he won the election; Twitter flags the tweet"
"Trump Allies Reportedly Consider Buying Newsmax as Anger at Fox News Grows"
"Court Agrees with Attorney General James That Trump Administration’s Latest DACA Order Was Illegal"
"Attorney General James Ready to Sue Trump Administration if New York Doesn’t Receive COVID-19 Vaccine with Rest of U.S."
"Trump administration will attempt to box Biden administration in on China policies"
"The Evangelical Reckoning Begins. Andy Stanley, the pastor of one of the largest megachurches in the country, ponders the future of an influential corner of American Christianity."
"Trump Plans More Actions on China in Coming Weeks to Bind Biden"
"Obama Says Trump Has Accelerated 'Truth Decay' In America"
"Donald Trump's refusal to concede is no joke – it's a dangerous precedent"
"Trump asserts he will soon file 'big cases' challenging 2020 election results"
"Chicago mayor issues stay at home order to stem COVID-19 deaths"
"The Trump campaign dropped a major part of its election lawsuit regarding their claims that observers were not allowed to watch vote counts in Pennsylvania"
"Biden seeks window on vaccine plans as Trump stalls handoff"
"Obama Calls Trump's Refusal To Concede Another 'Breach Of Basic Democratic Norms'"
"Biden Will Raise Number Of Refugees Admitted To U.S. From 15K to 125K"
"Trump tweets words 'he won;' says vote rigged, not conceding"
"Trump should be held responsible"
"Trump campaign abandons part of legal challenge to Pennsylvania election results - Allegation that 682,479 mail-in and absentee ballots were illegally processed without its representatives watching has been dropped"
"Trump's failure to work with Biden is becoming more urgent as Covid spreads"
"Trump Campaign Scales Back Pennsylvania Lawsuit After Law Firm Abandoned Ship"
"Biden Would Be the Weakest President Ever"
"Trump’s COVID-19 Adviser Tells Michigan To ‘Rise Up’ Over Whitmer's New Restrictions"
"Donald Trump's legal strategy makes no sense for winning the vote count. So what is he doing?"
"3 reasons why Gov. Doug Ducey won't acknowledge that Joe Biden won the election"
"Trump takes no questions in first public remarks since losing election"
"Where Trump’s recount fundraising dollars are really going"
"Trump COVID Adviser Tells People of Michigan to ‘Rise Up’ Against New Restrictions"
"Trump is looking like the thing that wouldn’t leave"
"Biden COVID-19 adviser: We can get pandemic under control without another national lockdown"
"Trump Rebuffs Biden Transition Team, Setting Off Virus and National Security Risks"
"Trump campaign pares back federal suit over Pennsylvania election results"
"Trump campaign retreats from key claim in Pennsylvania suit"
"Trump, Trying to Cling to Power, Fans Unrest and Conspiracies"
"Trump plans last-minute China crackdown"
"Biden Fills Economic Posts With Experts on Systemic Racism — Previous administrations haven’t made race scholarship such a clear priority."
"Cuomo Bashes Trump, Threatens Legal Action For Equal Access To COVID-19 Vaccine"
"Trump asserts he will soon file 'big cases' challenging 2020 election results"
"Trump campaign abandons parts of Pennsylvania election lawsuit"
"Fox News Anchor Thoroughly Debunks Trump's Election Fraud Claims"
"Gov. Cuomo threatens to sue Trump administration over vaccine distribution"
"Donald Trump's estranged niece says uncle is 'deliberately' refusing to concede election"
"Democrats, Media Stand On The Graves Of European Jews To Hit Trump"
"The Million MAGA March in DC Got Ugly - Violence broke out when thousands of Trump supporters—including QAnon conspiracy theorists and Proud Boys—descended on Washington, D.C. Saturday to insist the president won the election."
"There are economic reasons that Trump's coup attempt won't work, experts say"
"Trump will cast a long shadow over Republican party despite defeat"
"How the Trump administration’s ‘midnight rule-making’ could leave a big mark on government"
"Trump coronavirus adviser Scott Atlas urges Michigan to 'rise up' against new Covid-19 measures"
"Trump campaign jettisons major parts of its legal challenge against Pennsylvania’s election results"
"Obama says Trump voters’ alternative views divide the country"
"Biden Called Out For Silence As Leftists Attack Pro-Trump Demonstrators In Nation’s Capital"
"Barack Obama on his book, President Trump, George Floyd, the divisions in the country, and more"
"Donald Trump should concede and ‘put country above his ego’, says Barack Obama"
"Trump Distances Himself from Ongoing Election Lawsuits, Acts Like Campaign Hasn’t Been Losing in Court"
"The advice Barack Obama would give President Trump"
"Pollster: It's Curious How Biden Underperformed Hillary Clinton In Every City...Except These Four."
"Biden likely to choose a woman, a person of color or both for White House press secretary"
"Trump, the Absolute Worst Loser"
"This is no conventional coup. Trump is paving the way for a 'virtual Confederacy'"
"Biden team to meet with coronavirus vaccine makers this week as Trump stonewalls transition"
"Trump’s last days in office could be his most dangerous"
"Here Are All the Lawsuits the Trump Campaign Has Filed Since Election Day—And Why Most Are Unlikely to Go Anywhere"
"GOP shows limited appetite for pursuing Biden probes"
"Behind Trump’s Yearslong Effort to Turn Losing Into Winning"
"America’s largest militia says it will refuse to recognise Biden as president and ‘resist’ his administration"
"House leaders urge Democrats not to join team Biden to maintain majority"
"Iran’s oil exports, uranium stockpile surge as Trump administration’s ‘maximum pressure’ policy hits a wall"
"Bolton: Trump's Pentagon shakeup 'destructive'"
"Nearly 2 dozen arrested after violence at pro-Trump march in Washington"
"Yes, 55 Percent of White Women Voted for Trump. No, I’m Not Surprised."
"Trump legal battles: How six cases may play out"
"Trump campaign downsizing, letting most staff go — except those helping legal battle"
"Biden’s Putin Challenge"
"Trump allies in talks to buy Newsmax and turn it into Fox News competitor, reports say"
"The one good thing Donald Trump did for Canada"
"Trump trashes 'real dope' John Bolton for pushing election loss, calls him 'one of the dumbest people'"
"2 more GOP governors push Trump to start the formal presidential transition process with Biden"
"Watch as Donald Trump almost concedes the US election, then catches himself and backtracks"
"Why Trump Carried Out His Pentagon Purge"
"Trump backtracks after acknowledging that Joe Biden won"
"Why Biden didn’t do better in big cities | He failed to produce the massive big-city margins some Democrats expected. One reason is that Trump surpassed his 2016 performance in many cities."
